[
  {
    "text": "The Digital Home High Level Requirements Definition is intended as a prototype, which will allow business decisions to be made about future development of a commercial product.",
    "id": [
      5,
      12,
      0,
      109,
      13,
      27,
      8,
      26,
      7,
      9
    ],
    "example": [
      "This initial version of DigitalHome will be a limited prototype version, which will be used by HomeOwner management to make business decisions about the future commercial development of DigitalHomeOwner products and services.",
      "The product is based on the Digital Home High Level Requirements Definition.",
      "This document specifies the requirements for the development of a “Smart House”, called DigitalHome (DH), by the DigitalHomeOwner Division of HomeOwner Inc.",
      "Although the product produced under this document will be a “prototype” version, all modules and components of this prototype version shall be designed and implemented in such a manner that it may be incorporated in a fully specified commercial version of the DigitalHome System.",
      "The prototype DigitalHome software system will be situated in a simulated environment.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "These document were prepared by the DigitalHomeOwner Division, in consultation with the Marketing Division of HomeOwner Inc.",
      "The development team will use the development process specified by the Digital HomeOwner Inc.",
      "There is a supplementary document that provides additional detail and information about the DigitalHome requirements: the Digital Home Use Case Model.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home."
    ]
  },
  {
    "text": "The scope of the project will be limited to the management of devices which control temperature, humidity, security, and power to small appliances and lighting units, through the use of a web-ready device.",
    "id": [
      1157,
      5,
      2,
      1227,
      108,
      191,
      525,
      28,
      85,
      58
    ],
    "example": [
      "Systems will interface to the “cloud” using a project defined protocol.",
      "This initial version of DigitalHome will be a limited prototype version, which will be used by HomeOwner management to make business decisions about the future commercial development of DigitalHomeOwner products and services.",
      "The Smart House components consist of household devices (e.g., a heating and air conditioning unit, a security system, and small appliances and lighting units, etc.), sensors and controllers for the devices, communication links between the components, and a computer system, which will manage the components.",
      "The remote Center Control GUI shall be designed to execute on a public network (e.g., Internet) and transmit equipment requests to the C-2-C software system.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "The product will be a web-based, interactive system.",
      "The CCTNS system should be designed for access through browser-based systems and must impose minimal requirements on the client device ",
      "Because of potential market competition for DigitalHome products, the cost of DigitalHome elements (sensors, controllers, server, tools, etc.), for this project should be minimized.",
      "The DigitalHome programmable Appliance Manager shall provide for management of a home’s small appliances, including lighting units, by allowing a user to turn them on or off as desired.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems."
    ]
  },
  {
    "text": "A Master user will be designated, who shall be able to change the configuration of the system.",
    "id": [
      664,
      22,
      666,
      896,
      1119,
      895,
      853,
      964,
      1229,
      851
    ],
    "example": [
      "The administrator shall have the ability to create and add a new user to the EVLA Correlator Monitor and Control System.",
      "A DigitalHome Technician will have rights beyond the DigitalHome General User, capable of setting up and making changes in the configuration of the system (e.g.,setting system parameters and establishing user accounts), and starting and stopping operation of the DigitalHome System.",
      "The administrator shall have the ability to edit a user’s system access properties.",
      "The operator shall be able to manually override the automatic mode selection of the selected data terminal, if desired.",
      "The Tactical Control System shall provide access to the DII Style Manager so that pointing device characteristics can be modified.",
      "The operator shall be able to manually override the automatic function selection of the selected data terminal, if desired.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, UAV navigation methods by sending the proper control commands to the UAV.",
      "The Tactical Control System shall provide the capability for Authorized Operators to modify all Tactical Control System programmable parameters.",
      "The user shall be provided with the capability to select a network identifier for a device command/control request.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, flight behaviors by sending the proper control commands to the UAV."
    ]
  },
  {
    "text": "For example, a Master User shall be able to add a user account or change the default parameter settings.",
    "id": [
      666,
      664,
      90,
      105,
      491,
      1229,
      1228,
      252,
      364,
      107
    ],
    "example": [
      "The administrator shall have the ability to edit a user’s system access properties.",
      "The administrator shall have the ability to create and add a new user to the EVLA Correlator Monitor and Control System.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices ",
      "Upon installation, a DigitalHome user account shall be established.",
      "Allowing users to see and change profiles: If user-specified profiles are used, users should be able to see, modify and delete that profile on demand.",
      "The user shall be provided with the capability to select a network identifier for a device command/control request.",
      "When the GUI application is initiated, the user shall be prompted for the following information, including User name and Password.",
      "Upon correct submission of her password, she uses an intuitive web forms interface to update the system to her desiring.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "Log in to an account shall require entry of an account name and a password."
    ]
  },
  {
    "text": "The DigitalHome system will be tested in a simulated environment.",
    "id": [
      13,
      31,
      21,
      82,
      20,
      45,
      108,
      15,
      19,
      60
    ],
    "example": [
      "The prototype DigitalHome software system will be situated in a simulated environment.",
      "However, the simulated environment will be realistic and adhere to the physical properties and constraints of an actual home and to real sensors and controllers.",
      "A DigitalHome Technician is specially trained by DigitalHomeOwner to be familiar with the functionality, architecture, and operation of the DigitalHome system product.",
      "The DigitalHome security system consists of contact sensors and a set security alarms.",
      "A DigitalHome Technician has experience with the type of hardware, software, and web services associated with a system like the DigitalHome system.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "A DigitalHome Technician is responsible for setting up and maintaining the configuration of a DigitalHome system.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches)."
    ]
  },
  {
    "text": "Some of them are related to issues of long-term production and marketing of a DigitalHome product.",
    "id": [
      28,
      8,
      433,
      34,
      553,
      27,
      148,
      108,
      943,
      467
    ],
    "example": [
      "Because of potential market competition for DigitalHome products, the cost of DigitalHome elements (sensors, controllers, server, tools, etc.), for this project should be minimized.",
      "These document were prepared by the DigitalHomeOwner Division, in consultation with the Marketing Division of HomeOwner Inc.",
      "This encompasses being able to present content containing newer technologies by older user agents as well as designing content to be usable with future technologies.",
      "To make marketing and development decisions, the following sections describe operational environment concerns and constraints.",
      "The document may also be of interest to VLA Expansion Project project scientists and engineers or as a reference for individuals involved in similar projects with similar requirements.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "However, there are privacy issues related to intellectual property and sensitive information and data.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "Processing will include formatting, storing, routing, and display.",
      "Frequently, however, different pages have different purposes and types of content."
    ]
  },
  {
    "text": "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
    "id": [
      63,
      9,
      75,
      15,
      60,
      2,
      88,
      45,
      85,
      16
    ],
    "example": [
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "The DigitalHome programmable humidistat shall allow a user to monitor and control a home’s humidity from any location, using a web ready computer, cell phone, or PDA.",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "The Smart House components consist of household devices (e.g., a heating and air conditioning unit, a security system, and small appliances and lighting units, etc.), sensors and controllers for the devices, communication links between the components, and a computer system, which will manage the components.",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The DigitalHome programmable Appliance Manager shall provide for management of a home’s small appliances, including lighting units, by allowing a user to turn them on or off as desired.",
      "The general user is familiar with the layout of his/her home and the location of sensor and control devices (for temperature, for humidity, and for power to small appliances and lighting units)."
    ]
  },
  {
    "text": "If a humdistat device allows a user to make a manual temperature setting, the setting shall remain in effect until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
    "id": [
      70,
      65,
      47,
      89,
      88,
      64,
      77,
      617,
      69,
      898
    ],
    "example": [
      "If a thermostat device allows a user to make a manual temperature setting, the setting shall remain in effect until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "A DigitalHome user shall be able to set the thermostat temperatures to between 60 °F and 80 °F, inclusive, at one degree increments.",
      "The controller part of thermostat shall provides a “set point” temperature that is used to control the flow of heat energy (by switching heating or cooling devices on or off as needed) to achieve the set point temperature.",
      "For a given month and year, a user shall be able to create or modify a month plan that specifies for each day, for up to four daily time periods, the environmental parameter settings (temperature, humidity, contact sensors and power switches).",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "A DigitalHome user shall be able to read the temperature at a thermostat position.",
      "A DigitalHome user shall be able to set the humidity level for a humidistat, from 30% to 60%, inclusive a 1% increments.",
      "The UPS devices need the ability to signal the Correlator Monitor and Control System when a power outage has occurred and keep the Correlator Monitor and Control System apprised of time remaining on backup power.",
      "For each thermostat, up to twenty-four one hour settings per day for every day of the week can be scheduled.",
      "The operator shall be able to manually override the automatic frequency selection if desired."
    ]
  },
  {
    "text": "A DigitalHome system shall be able to manage up to fifty door and window contact sensors.",
    "id": [
      83,
      60,
      82,
      15,
      49,
      53,
      45,
      81,
      9,
      59
    ],
    "example": [
      "A DigitalHome system shall be able to activate both light and sound alarms: one sound alarm and one light alarm subsystem, with multiple lights.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "The DigitalHome security system consists of contact sensors and a set security alarms.",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "The system shall include digital programmable humidistats, which shall be used to monitor and regulate the humidity of an enclosed space.",
      "The system shall include security sound and light alarms, which can be activated when DigitalHome senses a security breach from a magnetic contact.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "A DigitalHome system shall use wireless signals to communicate, through the master control unit, with the humidistats.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "Each DigitalHome shall contain a master control device (the DigitalHome Gateway Device) that connects to the home’s broadband Internet connection, and uses wireless communication to send and receive communication between the DigitalHome system and the home devices and systems."
    ]
  },
  {
    "text": "The Appliance Manager shall be able to manage up to one hundred 115 volt, 10 amp power switches.",
    "id": [
      55,
      85,
      54,
      87,
      86,
      60,
      83,
      1007,
      624,
      52
    ],
    "example": [
      "The system shall be able to use a power switch to change the state of the appliance (e.g., from “off” to “on”).",
      "The DigitalHome programmable Appliance Manager shall provide for management of a home’s small appliances, including lighting units, by allowing a user to turn them on or off as desired.",
      "The system shall include digital programmable power switches which shall be used to monitor the current state of an appliance (e.g., a coffee maker is off or on).",
      "The system shall be able to change the state of a power switch (OFF to ON, or ON to OFF), in turn changing the state of an appliance connected to the power switch.",
      "The system shall be able to provide information about the state of a power switch (OFF or ON), indicating the whether an appliance connected to the power switch is OFF or ON.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "A DigitalHome system shall be able to activate both light and sound alarms: one sound alarm and one light alarm subsystem, with multiple lights.",
      "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment.",
      "The Correlator Power Control Computer shall be a high availability type general purpose computer capable of supporting a COTS operating system and have the ability to accept a large number of external hardware status signals either directly or through external interface hardware.",
      "The system shall include magnetic alarm contact switches which shall be used to monitor entry through a door or window when the switch is active."
    ]
  },
  {
    "text": "If a user changes the state of power switch device manually, the device shall remain in that state until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
    "id": [
      70,
      87,
      744,
      617,
      743,
      55,
      498,
      90,
      54,
      22
    ],
    "example": [
      "If a thermostat device allows a user to make a manual temperature setting, the setting shall remain in effect until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "The system shall be able to change the state of a power switch (OFF to ON, or ON to OFF), in turn changing the state of an appliance connected to the power switch.",
      "When the Tactical Control System software is halted due to an unplanned power interruption as well as abnormal program termination, then the Tactical Control System shall enter the Recovery Startup Mode upon application of power.",
      "The UPS devices need the ability to signal the Correlator Monitor and Control System when a power outage has occurred and keep the Correlator Monitor and Control System apprised of time remaining on backup power.",
      "When the Tactical Control System Software is terminated normally the Tactical Control System shall enter the Normal Startup Mode of operation upon application of power.",
      "The system shall be able to use a power switch to change the state of the appliance (e.g., from “off” to “on”).",
      "In the event of any software or hardware failure, it must be possible to restore the CCTNS system (with inline synchronization) within no more than <xx> hours.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices ",
      "The system shall include digital programmable power switches which shall be used to monitor the current state of an appliance (e.g., a coffee maker is off or on).",
      "A DigitalHome Technician will have rights beyond the DigitalHome General User, capable of setting up and making changes in the configuration of the system (e.g.,setting system parameters and establishing user accounts), and starting and stopping operation of the DigitalHome System."
    ]
  },
  {
    "text": "All system documents (Software Requirements Specification, Architectural Design Specification, Module Detailed Design, Module Source Code, and all Test Plans) shall be up-to-date, use the Homeowner document format [HO2305] and reside in the HomeOwner Document Archive at completion of the project.",
    "id": [
      645,
      671,
      643,
      109,
      695,
      145,
      165,
      141,
      194,
      1110
    ],
    "example": [
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "Software system and application code shall be well documented and written in a generally familiar language or languages.",
      "All system processing and interconnect hardware shall be readily accessible for maintenance, repair, replacement and reconfiguration.",
      "Although the product produced under this document will be a “prototype” version, all modules and components of this prototype version shall be designed and implemented in such a manner that it may be incorporated in a fully specified commercial version of the DigitalHome System.",
      "Software developed will be Defense Information Infrastructure / Common Operating Environment (DII/COE) compliant, non-proprietary, and the architectural standard for all future tactical UAVs.",
      "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the internal interfaces.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I's.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I’s.",
      "This document is designed to provide information to both the client and the technical designers of the software.",
      "All Tactical Control System warning messages and HCI actions shall be archived for later review."
    ]
  },
  {
    "text": "The APAF data system acquires the telemetry data via NISN, processes the data into IDFS data sets, distributes the IDFS data sets to the ASPERA-3 team, provides web-based displays of the most current data for public view, stores the telemetry and IDFS data sets on a local SwRI archive, and submits the ASPERA-3 IDFS data sets to PDS for long-term archival.",
    "id": [
      136,
      134,
      135,
      117,
      166,
      131,
      165,
      141,
      132,
      169
    ],
    "example": [
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be stored on a local SwRI archive for data availability and re-processing, and to support the ASPERA-3 team.",
      "The ASPERA-3 and MEX OA telemetry data shall be stored on a local SwRI archive for data availability and re-processing.",
      "The ASPERA-3 and MEX OA IDFS data sets shall be stored on a local SwRI archive for data availability and analysis.",
      "The ASPERA-3 Processing and Archiving Facility (APAF) is a ground data system responsible for processing all of the ASPERA-3 telemetry.",
      "ASPERA-3 IDFS data that are electronically distributed shall be provided to the ASPERA-3 Co-I’s within 24 hours of acquiring ASPERA-3 telemetry as long as the transmission and processing are error-free to support the ASPERA-3 team in meeting MEX mission goals and objectives ",
      "The APAF system shall process all ASPERA-3 science data into IDFS data sets.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I's.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I’s.",
      "The APAF system shall process the engineering and ancillary information necessary for calibration and science validation into IDFS data sets.",
      "ASPERA-3 IDFS data and MEX OA IDFS data shall be provided to NASA PDS."
    ]
  },
  {
    "text": "Each of the seven components described above will have an associated Software Design Document (SDD) that will define and fully describe all of the data products contained within each individual virtual instrument.",
    "id": [
      145,
      1083,
      109,
      120,
      508,
      645,
      509,
      1148,
      732,
      1085
    ],
    "example": [
      "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the internal interfaces.",
      "The Tactical Control System core software shall be generically written to provide level one through level five interaction for both Outrider and Predator UAVs and establish the architecture for future tactical UAVs.",
      "Although the product produced under this document will be a “prototype” version, all modules and components of this prototype version shall be designed and implemented in such a manner that it may be incorporated in a fully specified commercial version of the DigitalHome System.",
      "Each of the physical components will be divided into logical groups (called virtual instruments) in which each logical group will be formatted as an IDFS data set.",
      "Each of the components contains multiple services as defined by Service Definition.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "The core services, support layer and security and access control components can be deployed as standard components with necessary configuration changes.",
      "The Center-to-Center project will be implemented using the evolving ITS Traffic Management Data Dictionary (TMDD) standard, the message sets associated with TMDD, other ITS Data Elements and Message Sets.",
      "The Tactical Control System shall provide software capabilities and hardware configurations necessary to fulfill the operational tasking requirements across the 5 levels of interaction.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services."
    ]
  },
  {
    "text": "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the virtual instrument data items.",
    "id": [
      145,
      562,
      557,
      1083,
      198,
      196,
      194,
      563,
      674,
      56
    ],
    "example": [
      "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the internal interfaces.",
      "The remainder of this document contains a more detailed description of the Correlator Monitor and Control System as well as the primary requirements necessary to design and build the EVLA Correlator Monitor and Control System.",
      "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
      "The Tactical Control System core software shall be generically written to provide level one through level five interaction for both Outrider and Predator UAVs and establish the architecture for future tactical UAVs.",
      "This section includes information such as functional and data requirements, general constraints, and assumptions.",
      "The definitions section is intended to assist the technical designers as well as the client in clarifying the terms used throughout the document.",
      "This document is designed to provide information to both the client and the technical designers of the software.",
      "The format of the document follows that outlined in the IEEE STD 830 document, IEEE The VLA Expansion Project Correlator Monitor and Control System is responsible for correlator configuration, real time monitor/control, and hardware testing/servicing.",
      "This TACTICAL CONTROL SYSTEM (TCS) - SYSTEM / SUBSYSTEM SPECIFICATION (SSS) - VERSION 1.0 identifies, specifies, and establishes the detailed system requirements for the Tactical control system as set forth by the OPERATIONAL REQUIREMENTS DOCUMENT FOR THE UNMANNED AERIAL VEHICLE (UAV) TACTICAL CONTROL SYSTEM (TCS) - VERSION 5.0.",
      "This section provides a description of the functional requirements."
    ]
  },
  {
    "text": "The APAF system web server shall be password protected where appropriate to allow only pertinent ASPERA-3 team members access.",
    "id": [
      139,
      390,
      388,
      965,
      525,
      1014,
      618,
      694,
      653,
      41
    ],
    "example": [
      "The web-based displays defined by the ASPERA-3 team to be used for science analysis shall be password protected until the ASPERA-3 data is made public to support the ASPERA-3 team in meeting mission goals and objectives.",
      "The CCTNS system must allow changes to security attributes for groups or users (such as access rights, security level, privileges, password allocation and management) to be made only by super-user.",
      "The CCTNS system must allow only admin-users to set up user profiles and allocate users to groups.",
      "As a minimum, the Tactical Control System shall restrict Operator access to this capability via password protection.",
      "The CCTNS system should be designed for access through browser-based systems and must impose minimal requirements on the client device ",
      "Remotely hosted applications shall communicate in a client server relationship via the defined data server interface.",
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "The Tactical Control System will operate in an open architecture and be capable of being hosted on computers that are typically supported by the using Service.",
      "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access.",
      "The home web server will provide backup service for user account information, user plans and a home database."
    ]
  },
  {
    "text": "ASPERA-3 data shall be calibrated and validated prior to depositing in the NASA PDS.",
    "id": [
      170,
      169,
      171,
      122,
      112,
      121,
      172,
      138,
      166,
      132
    ],
    "example": [
      "ASPERA-3 data shall be provided to NASA PDS in PDS-compliant form.",
      "ASPERA-3 IDFS data and MEX OA IDFS data shall be provided to NASA PDS.",
      "ASPERA-3 data shall be provided to NASA PDS no later than 6 months after acquisition.",
      "In addition, validation and archiving of all ASPERA-3 scientific data in the NASA Planetary Data System (PDS) within 6 months of receipt in a form useable by the general scientific community is to be provided by the APAF.",
      "This Software Requirements Specification (SRS) identifies the requirements for the ASPERA-3 Processing and Archiving Facility (APAF) ground data system for the Mars Express mission.",
      "The APAF ground data system is to provide data processing algorithms and support to IRF for the ASPERA-3 science team (including Co-I’s) in preparation for the Mission Operations and Data Analysis (MO&DA) phase of the Mars Express mission.",
      "Science analysis software shall be integrated into the NASA approved data repository.",
      "Web-based displays defined by ASPERA-3 team shall be provided where any available ASPERA-3 data (as opposed to just the most current) can be used for science analysis to support the ASPERA-3 team in meeting mission goals and objectives.",
      "ASPERA-3 IDFS data that are electronically distributed shall be provided to the ASPERA-3 Co-I’s within 24 hours of acquiring ASPERA-3 telemetry as long as the transmission and processing are error-free to support the ASPERA-3 team in meeting MEX mission goals and objectives ",
      "The APAF system shall process the engineering and ancillary information necessary for calibration and science validation into IDFS data sets."
    ]
  },
  {
    "text": "SwRI shall provide IDFS data processing algorithms to IRF.",
    "id": [
      142,
      173,
      174,
      143,
      161,
      162,
      131,
      132,
      116,
      135
    ],
    "example": [
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made avaiable to the ASPERA=3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "SwRI shall provide APAF system maintenance.",
      "SwRI shall provide software support for the APAF system.",
      "The APAF system shall process all ASPERA-3 science data into IDFS data sets.",
      "The APAF system shall process the engineering and ancillary information necessary for calibration and science validation into IDFS data sets.",
      "These data products will be put into a form known as the Instrument Data File Set (IDFS).",
      "The ASPERA-3 and MEX OA IDFS data sets shall be stored on a local SwRI archive for data availability and analysis."
    ]
  },
  {
    "text": "Therefore, there are no safety requirements of the APAF ground data system.",
    "id": [
      147,
      179,
      181,
      186,
      183,
      178,
      218,
      177,
      221,
      184
    ],
    "example": [
      "There are no security requirements associated with the APAF ground data system.",
      "There are no installation-dependent requirements for the operation of the APAF data system.",
      "The APAF data system will not impose hazards to personnel, property, or the environment.",
      "There are no requirements of the APAF data system that need special treatment or consideration at this time.",
      "There are no requirements that constrain the design and implementation of the APAF software.",
      "The APAF data system is not required to operate in more than one state or mode.",
      "The Space Fractions system will not be dependent on any other software and is not a component of another program.",
      "This section identifies the requirements considered but not part of the APAF ground data system requirements.",
      "The Space Fractions system does not require any new hardware.",
      "There are no identified requirements related to personnel that will use the software."
    ]
  },
  {
    "text": "Although the APAF data system and associated software will be developed with the highest quality possible, there are no requirements concerned with software quality.",
    "id": [
      183,
      179,
      147,
      186,
      181,
      182,
      218,
      178,
      184,
      695
    ],
    "example": [
      "There are no requirements that constrain the design and implementation of the APAF software.",
      "There are no installation-dependent requirements for the operation of the APAF data system.",
      "There are no security requirements associated with the APAF ground data system.",
      "There are no requirements of the APAF data system that need special treatment or consideration at this time.",
      "The APAF data system will not impose hazards to personnel, property, or the environment.",
      "Some of the software quality factors that will be considered when developing the APAF data system include: reliability, maintainability, availability, flexibility, portability, testability, and usability.",
      "The Space Fractions system will not be dependent on any other software and is not a component of another program.",
      "The APAF data system is not required to operate in more than one state or mode.",
      "There are no identified requirements related to personnel that will use the software.",
      "Software developed will be Defense Information Infrastructure / Common Operating Environment (DII/COE) compliant, non-proprietary, and the architectural standard for all future tactical UAVs."
    ]
  },
  {
    "text": "However, the APAF Operations Procedures Document will aid personnel in the operational use of the APAF system.",
    "id": [
      185,
      180,
      176,
      132,
      781,
      718,
      977,
      803,
      762,
      763
    ],
    "example": [
      "In addition, the APAF Operations Procedures Document shall provide installation and operations procedures of the APAF system in enough detail where there are no training-related requirements for users and operators of the APAF data system.",
      "However, if any are identified, they shall be documented in the APAF Operations Procedures Document.",
      "The distribution mechanisms shall be clearly defined/described in the APAF Operation Procedures Document.",
      "The APAF system shall process the engineering and ancillary information necessary for calibration and science validation into IDFS data sets.",
      "The Tactical Control System Mission plan shall include all necessary information required to be interoperable with the service specific mission planning systems including the Tactical Aircraft Mission Planning System (TAMPS), Aviation Mission Planning System (AMPS), and Air Force Mission Support System (AFMSS).",
      "The Tactical Control System will be connected with Air Force Mission Support System (AFMSS)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ASAS.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "In the Training Operations Mode the Tactical Control System shall support mission planning.",
      "In the Training Operations Mode the Tactical Control System shall support mission control and monitoring."
    ]
  },
  {
    "text": "Since the members of the SwRI software team are experienced with data system and IDFS processing software development, there are no training-related requirements for developers of the APAF data system.",
    "id": [
      184,
      183,
      179,
      147,
      186,
      218,
      1089,
      181,
      178,
      142
    ],
    "example": [
      "There are no identified requirements related to personnel that will use the software.",
      "There are no requirements that constrain the design and implementation of the APAF software.",
      "There are no installation-dependent requirements for the operation of the APAF data system.",
      "There are no security requirements associated with the APAF ground data system.",
      "There are no requirements of the APAF data system that need special treatment or consideration at this time.",
      "The Space Fractions system will not be dependent on any other software and is not a component of another program.",
      "Training software is the software that provides the computer based training functionality for the system operator.",
      "The APAF data system will not impose hazards to personnel, property, or the environment.",
      "The APAF data system is not required to operate in more than one state or mode.",
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives."
    ]
  },
  {
    "text": "The umbrella will be a web-based menu system allowing the user to choose between the systems.",
    "id": [
      222,
      368,
      308,
      415,
      156,
      274,
      484,
      283,
      281,
      1095
    ],
    "example": [
      "The umbrella will be a singular component, providing links to projects relating to fractions, decimals, and percents in a format accessible over the World Wide Web.",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
      "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators.",
      "The application logo to be available on all pages as a link to the home page.",
      "There shall be a web server for the APAF system for web-based displays and information change.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "The output of interacting with the main menu is determined by the player's choice.",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page.",
      "Each control console shall have a display windows that presents the interface menus for workstation software."
    ]
  },
  {
    "text": "Although Alice has used computers for email and systems, Alice considers computers to be boring.",
    "id": [
      206,
      208,
      207,
      152,
      210,
      495,
      17,
      211,
      621,
      625
    ],
    "example": [
      "Alice is a sixth grade female student learning fractions who does not like to use computers.",
      "However, Alice is really interested in learning fractions and enjoys working with other students.",
      "Alice would rather read a story or talk with friends.",
      "Computer resources include computer hardware, computer software, and computer communication.",
      "Bobby enjoys playing competitive sports and using computers, especially to play systems.",
      "The CCTNS system is considered to be down if any user is unable to perform any normal System function and if this failure is attributed to any component of the CCTNS system other than the workstation.",
      "Although the general user is not familiar with the technical features of the DigitalHome system, he/she is familiar with the use of a web interface and can perform simple web operations (logging in and logging out, browsing web pages, and submitting information and requests via a web interface).",
      "Bobby has used computers since age five.",
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible.",
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible."
    ]
  },
  {
    "text": "Claire finds that students have a particularly hard time learning about the concepts related to fractions.",
    "id": [
      202,
      215,
      206,
      214,
      203,
      208,
      205,
      190,
      240,
      242
    ],
    "example": [
      "These students are in the process of learning how to solve arithmetic problems involving fractions.",
      "Claire enjoys teaching sixth graders and is interested in finding innovative ways to teach her students.",
      "Alice is a sixth grade female student learning fractions who does not like to use computers.",
      "Claire is a sixth grade teacher who has computer skills.",
      "Moreover, these students (as well as the teacher) are assumed to have basic computer and ",
      "However, Alice is really interested in learning fractions and enjoys working with other students.",
      "The personas we will use to model our intended users are a sixth grade female student called Alice learning fractions who does not like to use computers, a sixth grade male student called Bobby learning fractions who is very competitive and a sixth grade teacher with computer skills called Claire.",
      "The Space Fractions system is a learning tool created to help improve fraction-solving skills for sixth-grade students.",
      "Claire will be assured that the students will know what to do from this main screen.",
      "These questions will test the user's knowledge of basic fraction operations and will be presented as a multiple-choice questionnaire."
    ]
  },
  {
    "text": "In addition, a component accessible over the World Wide Web will allow the series of fraction questions to be updated by an administrator of the Space Fractions system.",
    "id": [
      227,
      336,
      331,
      308,
      316,
      224,
      228,
      156,
      232,
      311
    ],
    "example": [
      "The administrator of the Space Fractions system may wish to design a custom system complete with custom fraction questions.",
      "The Space Fractions system will be available over the Internet via the S2S website.",
      "However, the Space Fractions system will reside on the Internet so more than one user can access the product and download its content for use on their computer.",
      "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators.",
      "This file contains the updated question data, structured in a format that the system sequence can dynamically read and incorporate into the gameplay.",
      "The Space Fractions system will have a main menu, including a brief help section.",
      "This information must be saved in a file on the web server where the Space Fractions system is hosted and will be easily edited through simplified administrative screens.",
      "There shall be a web server for the APAF system for web-based displays and information change.",
      "The Space Fractions system will run on any Internet-accessible computer with a web browser that supports ",
      "Each question is managed on a separate page within the tool, and navigation between questions is streamlined through the use of a button to progress from one question to the next, ensuring a smooth and organized content update process."
    ]
  },
  {
    "text": "The user will be given a problem and then must click the correct solution.",
    "id": [
      366,
      364,
      367,
      312,
      1228,
      365,
      238,
      266,
      398,
      325
    ],
    "example": [
      "The solution should enable the user to track the submitted defect or enhancement request.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The solution should enable the help-desk user to view the reports on the submitted defects or enhancement requests category-wise, status-wise, and age- wise.",
      "Upon the completion of data entry for a question, the administrator will use a submission button to initiate the update process.",
      "When the GUI application is initiated, the user shall be prompted for the following information, including User name and Password.",
      "The solution should send alerts (e.g., email, SMS) to the user if the user chooses to whenever any action has been taken on the alert.",
      "To start the Space Fractions system, the user will click on the corresponding button.",
      "The primary input for this component is the user's interaction in the form of a mouse click. ",
      "Ideally, each error message will be accompanied by explanatory text and an indication of the action(s) which the user can take in response to the error.",
      "The system is designed to detect and respond to the player's choice by initiating the process to open the selected S2S project."
    ]
  },
  {
    "text": "This gives Bobby the competition he requires and allows Alice to have a unique experience the next time through the program.",
    "id": [
      212,
      239,
      244,
      208,
      210,
      209,
      276,
      320,
      205,
      249
    ],
    "example": [
      "Bobby particularly likes to play systems where Bobby can excel.",
      "The information and interface will be effective so that Bobby will easily recognize what to do to start the system immediately and Alice will have no problems navigating through the help section to understand the rules and systemplay.",
      "Bobby will be captivated by the storyline and will wish to progress as fast as possible.",
      "However, Alice is really interested in learning fractions and enjoys working with other students.",
      "Bobby enjoys playing competitive sports and using computers, especially to play systems.",
      "Bobby is a sixth grade male student learning fractions who is very competitive.",
      "This menu aims to equip players with the necessary knowledge to start playing and offer additional learning resources, thereby enriching the overall game experience.",
      "This component aims to extend the educational value of the system by integrating additional, topic-relevant resources that support and deepen the player's understanding of mathematics.",
      "The personas we will use to model our intended users are a sixth grade female student called Alice learning fractions who does not like to use computers, a sixth grade male student called Bobby learning fractions who is very competitive and a sixth grade teacher with computer skills called Claire.",
      "Either way, the user will be encouraged to try again and further better their fraction skills."
    ]
  },
  {
    "text": "If the input is valid, the Space Fractions system calculates the velocity adjustment by converting the fraction into a decimal value and applying it to the spaceship's current velocity.",
    "id": [
      261,
      254,
      262,
      238,
      229,
      259,
      257,
      263,
      226,
      225
    ],
    "example": [
      "The output of this process is the adjusted velocity of the spaceship, represented as a decimal value.",
      "The purpose of the Space Fractions system is to process player inputs during gameplay, specifically for calculating spaceship velocity adjustments based on fraction inputs. ",
      "This adjusted velocity is applied to the game's physics engine to update the spaceship's speed in real-time.",
      "To start the Space Fractions system, the user will click on the corresponding button.",
      "The user's score must be kept as local data within the Space Fractions system so that the results may be given at the end of the Space Fractions system.",
      "Upon receiving the fraction inputs, the Space Fractions system will validate the integrity and format of the data to ensure they are integers and that the denominator is not zero.",
      "These inputs will be in the form of two integers representing the numerator and denominator of a fraction. ",
      "The output timing is immediate, ensuring responsive gameplay. The range of output values is determined by the game's physics rules and the maximum and minimum velocity constraints set within the Space Fractions system.",
      "The Space Fractions system will have an ending scene where the user's score is calculated and ranked, with an option to quit the system or try again.",
      "The Space Fractions system will have a series of fraction questions (testing arithmetic, equivalence, graphical interpretation, and improper versus proper fraction skills) that sequentially form a storyline related to the introduction."
    ]
  },
  {
    "text": "This engaging start is designed to enhance understanding and interest in the game's educational objectives.",
    "id": [
      276,
      287,
      320,
      274,
      309,
      265,
      328,
      294,
      297,
      306
    ],
    "example": [
      "This menu aims to equip players with the necessary knowledge to start playing and offer additional learning resources, thereby enriching the overall game experience.",
      "This sequence is designed to challenge and educate players on fractions while advancing the plot, thereby keeping the educational content engaging and contextually relevant.",
      "This component aims to extend the educational value of the system by integrating additional, topic-relevant resources that support and deepen the player's understanding of mathematics.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "Its primary function is to facilitate the updating and editing of questions within the system sequence, ensuring that the game's educational content remains current, accurate, and engaging for players. By providing an easy-to-use interface for content modification, this tool supports the game's adaptability and longevity in educational settings.",
      "The introductory movie serves to immerse players into the game's universe, setting the stage for the storyline and providing critical information to assist users in solving fraction-related puzzles.",
      "This functionality facilitates a seamless integration of supplemental educational resources, ensuring that players have the opportunity to engage with a broader range of topics and materials at their own pace.",
      "After completing a predetermined set of questions, the player is directed to the concluding scene of the game, providing closure to the educational journey.",
      "Feedback is provided after each question to help players understand their performance and learn from their mistakes, reinforcing the educational goals of the game.",
      "The dynamic nature of the conclusion serves to emphasize the educational progress and decisions of the player, offering a personalized ending that varies from one session to another based on the player's performance."
    ]
  },
  {
    "text": "Alternatively, if the player selects the option to visit the Denominators' web page, the system facilitates this redirection, opening the web page either within the game environment or in a separate browser window, depending on the game's design and platform capabilities.",
    "id": [
      281,
      279,
      329,
      219,
      299,
      300,
      283,
      483,
      274,
      285
    ],
    "example": [
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page.",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "By presenting these resources in a separate window, the system maintains the player's context within the main system environment, enabling easy return to the system after exploring the external content.",
      "Since the Space Fractions system requires a Flash-supporting browser, the external interface will depend on the configuration of the browser.",
      "Additionally, it presents players with the option to either conclude their current session or navigate back to the main menu for further exploration or replay.",
      "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
      "The output of interacting with the main menu is determined by the player's choice.",
      "User adaptation can also be important for making the user interface more accessible.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "This dual-path output allows for a customized experience that caters to the player's immediate preference, whether it be diving into the game or seeking additional information and resources."
    ]
  },
  {
    "text": "his scene not only showcases the player's overall score but also offers a narrative conclusion that ties directly back to the choices made during gameplay, reinforcing the impact of educational achievements within the game's context.",
    "id": [
      306,
      298,
      287,
      293,
      296,
      265,
      297,
      294,
      305,
      295
    ],
    "example": [
      "The dynamic nature of the conclusion serves to emphasize the educational progress and decisions of the player, offering a personalized ending that varies from one session to another based on the player's performance.",
      "The ending scene serves as the culmination of the player's journey through the system, providing a conclusion to the storyline that reflects their performance across critical decision points. ",
      "This sequence is designed to challenge and educate players on fractions while advancing the plot, thereby keeping the educational content engaging and contextually relevant.",
      "The system sequence includes \"critical points\" where the storyline can diverge based on whether the player answers these pivotal questions correctly, adding an element of narrative depth and personalization to the gameplay experience.",
      "Additionally, the sequence customizes the storyline's progression based on the player's performance at critical junctures, offering a dynamic and personalized gaming experience.",
      "The introductory movie serves to immerse players into the game's universe, setting the stage for the storyline and providing critical information to assist users in solving fraction-related puzzles.",
      "Feedback is provided after each question to help players understand their performance and learn from their mistakes, reinforcing the educational goals of the game.",
      "After completing a predetermined set of questions, the player is directed to the concluding scene of the game, providing closure to the educational journey.",
      "This conclusion reflects the outcomes of key decisions made during the system, specifically at critical junctures that were influenced by the player's understanding and application of fractions.",
      "The output from this component consists of plot-based questions that incorporate fractions, tailored to both challenge the player's mathematical skills and advance the game's narrative."
    ]
  },
  {
    "text": "The primary outputs of the ending scene include the display of the player's total score accumulated throughout the system and a tailored narrative conclusion.",
    "id": [
      298,
      306,
      293,
      296,
      286,
      287,
      294,
      305,
      226,
      295
    ],
    "example": [
      "The ending scene serves as the culmination of the player's journey through the system, providing a conclusion to the storyline that reflects their performance across critical decision points. ",
      "The dynamic nature of the conclusion serves to emphasize the educational progress and decisions of the player, offering a personalized ending that varies from one session to another based on the player's performance.",
      "The system sequence includes \"critical points\" where the storyline can diverge based on whether the player answers these pivotal questions correctly, adding an element of narrative depth and personalization to the gameplay experience.",
      "Additionally, the sequence customizes the storyline's progression based on the player's performance at critical junctures, offering a dynamic and personalized gaming experience.",
      "The primary function of the system sequence is to engage players with a series of multiple-choice questions focused on fractions. These questions are integrated within a storyline that naturally follows the introductory narrative of the game.",
      "This sequence is designed to challenge and educate players on fractions while advancing the plot, thereby keeping the educational content engaging and contextually relevant.",
      "After completing a predetermined set of questions, the player is directed to the concluding scene of the game, providing closure to the educational journey.",
      "This conclusion reflects the outcomes of key decisions made during the system, specifically at critical junctures that were influenced by the player's understanding and application of fractions.",
      "The Space Fractions system will have an ending scene where the user's score is calculated and ranked, with an option to quit the system or try again.",
      "The output from this component consists of plot-based questions that incorporate fractions, tailored to both challenge the player's mathematical skills and advance the game's narrative."
    ]
  },
  {
    "text": "Administrators interact with the Question Updater through a user-friendly interface consisting of pulldown menus and text fields. ",
    "id": [
      308,
      311,
      312,
      666,
      368,
      1228,
      250,
      452,
      364,
      1240
    ],
    "example": [
      "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators.",
      "Each question is managed on a separate page within the tool, and navigation between questions is streamlined through the use of a button to progress from one question to the next, ensuring a smooth and organized content update process.",
      "Upon the completion of data entry for a question, the administrator will use a submission button to initiate the update process.",
      "The administrator shall have the ability to edit a user’s system access properties.",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
      "When the GUI application is initiated, the user shall be prompted for the following information, including User name and Password.",
      "As the system administrator, Claire can use the question updater to change any of the questions in the system.",
      "Typical action types in user interfaces include manipulating application data, performing searches, communication actions, such as opening a new e-mail window or starting a chat function, and presentation-related actions, such as sorting a list of search results.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "For each device command/control status request sent by the Remote GUI, the status returned from the network identifier will be displayed in a scrollable list on the GUI."
    ]
  },
  {
    "text": "MINISTRY OF HOME AFFAIRS GOVERNMENT OF INDIA  ",
    "id": [
      360,
      350,
      161,
      511,
      9,
      1207,
      1079,
      341,
      110,
      0
    ],
    "example": [
      "With a proper configuration, information such as act and sections, state specific data, castes, tribes, property information etc.",
      "Interfacing with the courts during the prosecution of cases is an integral part of the responsibilities of police personnel.",
      "SwRI shall provide APAF system maintenance.",
      "The deployment of the application will be at state level and will be configured and customized as per the state specific extensions.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "The map shall display interstates and state highways on the graphical map.",
      "The Tactical Control System shall comply with the Assistant Secretary of Defense (C3I) Joint Technical Architecture (JTA).",
      "E-GOVERNANCE MISSION MODE PROJECT (MMP) ",
      "HomeOwner has designated object-oriented development, using UML 2.0, as the preferred method for development of software for HomeOwner products.",
      "This document specifies the requirements for the development of a “Smart House”, called DigitalHome (DH), by the DigitalHomeOwner Division of HomeOwner Inc."
    ]
  },
  {
    "text": "The Functional Requirements Specifications (FRS) report provides the detailed description of the functionalities required for the first version of the CCTNS.",
    "id": [
      562,
      731,
      674,
      200,
      199,
      56,
      189,
      3,
      343,
      118
    ],
    "example": [
      "The remainder of this document contains a more detailed description of the Correlator Monitor and Control System as well as the primary requirements necessary to design and build the EVLA Correlator Monitor and Control System.",
      "The initial TCS task analysis will produce a system baseline which will be optimized by engineering analysis and operator evaluations.",
      "This TACTICAL CONTROL SYSTEM (TCS) - SYSTEM / SUBSYSTEM SPECIFICATION (SSS) - VERSION 1.0 identifies, specifies, and establishes the detailed system requirements for the Tactical control system as set forth by the OPERATIONAL REQUIREMENTS DOCUMENT FOR THE UNMANNED AERIAL VEHICLE (UAV) TACTICAL CONTROL SYSTEM (TCS) - VERSION 5.0.",
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document.",
      "Section three is a detailed requirements specification targeted toward technical designers.",
      "This section provides a description of the functional requirements.",
      "The SRS will include the details of the system's requirements, interface, design issues, and components.",
      "The DigitalHome Software Requirements Specification (SRS) is based on the DigitalHome Customer Need Statement.",
      "FUNCTIONAL REQUIREMENTS SPECIFICATION V1.0 (DRAFT) ",
      "The first step in defining the IDFS data sets is to identify the physical instruments that make up the ASPERA-3 experiment and any ancillary data necessary for scientific analysis."
    ]
  },
  {
    "text": "The Registration module acts as an interface between the police and citizens and it eases the approach, interaction and information exchange between police and complainants.",
    "id": [
      355,
      347,
      356,
      354,
      482,
      344,
      350,
      352,
      523,
      403
    ],
    "example": [
      "The Citizen Interface module of the CCTNS acts as a conduit for the information exchange between citizens and police units/personnel.",
      "The functionality of the CCTNS application is focused on providing value to the police personnel, especially the officers operating at the cutting edge and easing the day to day operations of the police function.",
      "Citizens can use it as a tool to get information or acknowledgements from police.",
      "It makes reporting easy for police by enabling them to execute different types of queries such as monthly reporting, RTI related etc.",
      "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient.",
      "The key guiding principle behind the functional design of CCTNS V1.0 is to focus on the critical functionality that provides value to the police personnel at the cutting edge which in turn can improve the outcomes in the areas of “Investigation of Crime” and “Detection of Criminals”.",
      "Interfacing with the courts during the prosecution of cases is an integral part of the responsibilities of police personnel.",
      "The Prosecution module of the CCTNS aids this interfacing by providing a platform to record entries of the court interactions.",
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines "
    ]
  },
  {
    "text": "The Investigation module of the CCTNS facilitates the investigation process and introduces operational efficiencies by automating most of the tasks that take place after initial entries are made during Registration.",
    "id": [
      347,
      382,
      358,
      376,
      500,
      378,
      370,
      395,
      311,
      384
    ],
    "example": [
      "The functionality of the CCTNS application is focused on providing value to the police personnel, especially the officers operating at the cutting edge and easing the day to day operations of the police function.",
      "The CCTNS system should be able to provide reports for actions on cases organised by workstation and (where technically appropriate) by network address.",
      "The Navigation module of the CCTNS provides role based landing pages which help in navigating through the CCTNS application.",
      "Once the audit trail functionality has been activated, the CCTNS system must track events without manual intervention, and store in the audit trail information about them.",
      "The CCTNS system must be able to perform a simple search within 5-8 seconds and a advanced search (multiple search criteria) within 10-15 seconds regardless of the storage capacity or number of cases in the CCTNS system.",
      "The CCTNS system must ensure that audit trail data is available for inspection on request, so that a specific event can be identified and all related data made accessible, and that this can be achieved by authorised external personnel who have little or no familiarity with the CCTNS system.",
      "This includes actions taken by users or Administrators, or actions initiated automatically by the CCTNS system as a result of system parameters.",
      "If the CCTNS system allows users to make unauthorised attempts to access cases, it must log these in the audit trail.",
      "Each question is managed on a separate page within the tool, and navigation between questions is streamlined through the use of a button to progress from one question to the next, ensuring a smooth and organized content update process.",
      "The requirements specify the requirements to control the user access to correspondences, files, and records and various functionalities provided within the CCTNS system."
    ]
  },
  {
    "text": "The Search module of the CCTNS gives police personnel the ability to execute a basic or advanced search on cases.",
    "id": [
      347,
      500,
      344,
      355,
      354,
      358,
      345,
      400,
      729,
      359
    ],
    "example": [
      "The functionality of the CCTNS application is focused on providing value to the police personnel, especially the officers operating at the cutting edge and easing the day to day operations of the police function.",
      "The CCTNS system must be able to perform a simple search within 5-8 seconds and a advanced search (multiple search criteria) within 10-15 seconds regardless of the storage capacity or number of cases in the CCTNS system.",
      "The key guiding principle behind the functional design of CCTNS V1.0 is to focus on the critical functionality that provides value to the police personnel at the cutting edge which in turn can improve the outcomes in the areas of “Investigation of Crime” and “Detection of Criminals”.",
      "The Citizen Interface module of the CCTNS acts as a conduit for the information exchange between citizens and police units/personnel.",
      "It makes reporting easy for police by enabling them to execute different types of queries such as monthly reporting, RTI related etc.",
      "The Navigation module of the CCTNS provides role based landing pages which help in navigating through the CCTNS application.",
      "CCTNS V1.0 functionality is designed to focus on delivering value to IOs, records room staff and citizens within the broad crime investigation area.",
      "The CCTNS system must be able to display several entities (cases, suspects) simultaneously.",
      "The operational capabilities to be performed by the system will be determined by task analysis in accordance with MIL STD 1388 Task 401 as a guide based on a thorough understanding of Outrider and Predator mission requirements.",
      "It shows information such as cases assigned, alerts, pending tasks etc hence helping police personnel to plan better and execute with greater efficiency."
    ]
  },
  {
    "text": "Using the search functionality, police personnel can search for a particular person, type of crime, modus operandi, property etc.",
    "id": [
      356,
      349,
      359,
      345,
      342,
      354,
      350,
      348,
      500,
      347
    ],
    "example": [
      "Citizens can use it as a tool to get information or acknowledgements from police.",
      "After a complaint is initiated, police initiates the investigation process.",
      "It shows information such as cases assigned, alerts, pending tasks etc hence helping police personnel to plan better and execute with greater efficiency.",
      "CCTNS V1.0 functionality is designed to focus on delivering value to IOs, records room staff and citizens within the broad crime investigation area.",
      "CRIME &amp; CRIMINAL TRACKING NETWORK AND SYSTEMS (CCTNS)",
      "It makes reporting easy for police by enabling them to execute different types of queries such as monthly reporting, RTI related etc.",
      "Interfacing with the courts during the prosecution of cases is an integral part of the responsibilities of police personnel.",
      "Citizens can register their complaints with police and then based on the evidence, facts and following investigation, police shall take the complaint forward.",
      "The CCTNS system must be able to perform a simple search within 5-8 seconds and a advanced search (multiple search criteria) within 10-15 seconds regardless of the storage capacity or number of cases in the CCTNS system.",
      "The functionality of the CCTNS application is focused on providing value to the police personnel, especially the officers operating at the cutting edge and easing the day to day operations of the police function."
    ]
  },
  {
    "text": "The police in turn can use it to respond to citizens with very little turnaround time.",
    "id": [
      356,
      354,
      347,
      349,
      348,
      359,
      350,
      357,
      507,
      516
    ],
    "example": [
      "Citizens can use it as a tool to get information or acknowledgements from police.",
      "It makes reporting easy for police by enabling them to execute different types of queries such as monthly reporting, RTI related etc.",
      "The functionality of the CCTNS application is focused on providing value to the police personnel, especially the officers operating at the cutting edge and easing the day to day operations of the police function.",
      "After a complaint is initiated, police initiates the investigation process.",
      "Citizens can register their complaints with police and then based on the evidence, facts and following investigation, police shall take the complaint forward.",
      "It shows information such as cases assigned, alerts, pending tasks etc hence helping police personnel to plan better and execute with greater efficiency.",
      "Interfacing with the courts during the prosecution of cases is an integral part of the responsibilities of police personnel.",
      "It improves overall productivity by helping citizens and police to cut short the drudgery of large amounts of paperwork.",
      "The CCTNS system be scaleable and must not have any features which would preclude use in small or large police stations, with varying numbers of cases handled.",
      "The CCTNS system should be designed to have satisfactory performance even in Police Stations connected on low-bandwidth "
    ]
  },
  {
    "text": "The Configuration module of the CCTNS helps keep the application configured according to the states’ requirements in addition to keeping data elements/rules up to date.",
    "id": [
      384,
      492,
      386,
      403,
      358,
      382,
      399,
      408,
      1170,
      536
    ],
    "example": [
      "The requirements specify the requirements to control the user access to correspondences, files, and records and various functionalities provided within the CCTNS system.",
      "The user interfaces of the CCTNS system should follow the guidelines specified under www.usability.gov ",
      "The CCTNS system should provide for role-based control for the functionality within the CCTNS system ",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "The Navigation module of the CCTNS provides role based landing pages which help in navigating through the CCTNS application.",
      "The CCTNS system should be able to provide reports for actions on cases organised by workstation and (where technically appropriate) by network address.",
      "The CCTNS system must employ a single set of user interface rules, or a small number of sets to provide a familiar and common look and feel for the application.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries."
    ]
  },
  {
    "text": "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
    "id": [
      363,
      368,
      412,
      364,
      403,
      367,
      450,
      410,
      434,
      585
    ],
    "example": [
      "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
      "Application user interfaces to meet its requirements and recommendations.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "The solution should enable the help-desk user to view the reports on the submitted defects or enhancement requests category-wise, status-wise, and age- wise.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "The user interfaces should be designed to make them user-intuitive.",
      "Acceptable opening / download times: Application pages should be designed and implemented so that there are acceptable opening times and download times for the expected range of technical contexts of use (e.g.",
      "Software tools will be provided to assist the user at all access levels from system wide configuration and control to a low level CMIB command line instruction."
    ]
  },
  {
    "text": "The word “unalterable” is to mean that the audit trail data cannot be modified in any way or deleted by any user.",
    "id": [
      374,
      371,
      372,
      373,
      1087,
      646,
      147,
      394,
      218,
      179
    ],
    "example": [
      "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about administrative parameters.",
      "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about all the actions (create/read/update/delete) that are taken upon the critical entities in the CCTNS system.",
      "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about the user initiating and or carrying out the action.",
      "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about the date and time of the event.",
      "The Tactical Control System software shall be non-proprietary and have unlimited data rights.",
      "All software application modules shall be debuggable.",
      "There are no security requirements associated with the APAF ground data system.",
      "If a user performs a quick or advanced search, the CCTNS system must never include in the search result list any record which the user does not have the right to access.",
      "The Space Fractions system will not be dependent on any other software and is not a component of another program.",
      "There are no installation-dependent requirements for the operation of the APAF data system."
    ]
  },
  {
    "text": "The user interfaces of the CCTNS system should comply with Standard ISO 9241.",
    "id": [
      492,
      524,
      403,
      512,
      518,
      386,
      538,
      513,
      539,
      408
    ],
    "example": [
      "The user interfaces of the CCTNS system should follow the guidelines specified under www.usability.gov ",
      "The CCTNS system should adopt standardized formats and common metadata elements ",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "The CCTNS systems should be designed with the following broad guidelines: ",
      "The CCTNS system should be developed on Open Standards ",
      "The CCTNS system should provide for role-based control for the functionality within the CCTNS system ",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should support multilingual interface ",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it."
    ]
  },
  {
    "text": "User interfaces should meet its requirements and recommendations.",
    "id": [
      412,
      403,
      429,
      410,
      492,
      363,
      434,
      475,
      484,
      432
    ],
    "example": [
      "Application user interfaces to meet its requirements and recommendations.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "Designing for input device independence: User interfaces should be designed to allow activation of controls by a variety of input devices.",
      "The user interfaces should be designed to make them user-intuitive.",
      "The user interfaces of the CCTNS system should follow the guidelines specified under www.usability.gov ",
      "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
      "Acceptable opening / download times: Application pages should be designed and implemented so that there are acceptable opening times and download times for the expected range of technical contexts of use (e.g.",
      "In addition, when designing multimedia information presentations, the design principles and recommendations described in ISO 14915-1 to ISO 14915-3 should be taken into account.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "Making user interfaces robust: User interfaces should be designed to be as robust as possible in the face of changing technology."
    ]
  },
  {
    "text": "Offering alternative access paths: Alternative access paths for navigating to a specific unit of content should be offered to support different navigation strategies.",
    "id": [
      487,
      417,
      482,
      448,
      323,
      484,
      485,
      416,
      430,
      478
    ],
    "example": [
      "Taking account of the users’ tasks and information needs: When providing different access paths or navigation structures for different user groups, the tasks and information needs of these user groups should be taken into consideration.",
      "Making navigation self-descriptive: Navigation should be designed to help users understand where they are, where they have been and where they can go next.",
      "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient.",
      "Using familiar terminology for navigation links: Navigation links — particularly links representing the main navigation structure — should be labelled with terms that are familiar to the user, based on his/her general knowledge, prior experience in the application domain or experience of using other systems.",
      "Each link corresponds to a different S2S project, allowing players to choose which external resources they wish to explore based on their interests or areas where they seek further understanding.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "individualization designing content and navigation differently for varying user groups or roles i.e.",
      "Providing text equivalents for non-text media objects: All non-text media objects, such as graphical images or video, should be provided with alternative equivalent textual descriptions and/or with equivalent text-based functionality.",
      "The ability to choose between different input devices for activating controls such as links, fields and buttons is important both for users who prefer a certain input mode, mobile users and users with disabilities.",
      "Providing a site map: A separate navigation overview such as a site map should be provided for application showing the structure of the site in an overview form."
    ]
  },
  {
    "text": "They also require additional user actions for closing unwanted windows.",
    "id": [
      424,
      423,
      639,
      1225,
      1226,
      581,
      381,
      451,
      653,
      638
    ],
    "example": [
      "Opening new windows can distract, confuse or impede users for a variety of reasons.",
      "Avoiding opening unnecessary windows: Additional windows such as new browser windows or pop-up windows should only be opened if this supports the user’s task.",
      "The software part of the EVLA Correlator Monitor and Control System shall be able to perform without total system restart due to internal failure between system maintenance windows.",
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "Should a CMIB subsystem fail and not respond to reboot requests or other self-heal attempts, an alert notice will be issued so appropriate personnel can affect a hardware repair.",
      "The CCTNS system must be able to capture and store violations (i.e.A user’s attempts to access a case to which he is denied access), and (where violations can validly be attempted) attempted violations, of access control mechanisms.",
      "Marking links opening new windows: Links that open new browser windows or pop-up windows should be clearly marked.",
      "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access.",
      "It will be capable of detecting, reporting on and automatically taking action to remedy or lessen the impact of the following types of abnormal conditions: processor hardware failure, operating system hangs or crashes, temperature or voltage deviations, computational performance below minimum specifications, computational error rates above maximum specification, internal communications failures."
    ]
  },
  {
    "text": "This is particularly important for frequently accessed pages or pages that are important for user navigation and exploration, such as the home page.",
    "id": [
      477,
      427,
      467,
      458,
      358,
      279,
      482,
      322,
      415,
      452
    ],
    "example": [
      "Linking back to the home page or landmark pages: Each page should contain a link leading to the home page of the application or to a landmark page that is easy to recognize for the user.",
      "This may be done by placing important information at the top and providing links to information that is further down the page.",
      "Frequently, however, different pages have different purposes and types of content.",
      "Longer pages can be more appropriate when users want to read the content without interruptions or when the page needs to match a paper counterpart.",
      "The Navigation module of the CCTNS provides role based landing pages which help in navigating through the CCTNS application.",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient.",
      "These links are presented within the system interface and lead to various World Wide Web documents.",
      "The application logo to be available on all pages as a link to the home page.",
      "Typical action types in user interfaces include manipulating application data, performing searches, communication actions, such as opening a new e-mail window or starting a chat function, and presentation-related actions, such as sorting a list of search results."
    ]
  },
  {
    "text": "Supporting text skimming: Fast skimming of text should be supported by the provision of clear links, bulleted lists, highlighted keywords, logical headings, and short phrases and sentences.",
    "id": [
      447,
      442,
      466,
      450,
      427,
      440,
      481,
      443,
      477,
      573
    ],
    "example": [
      "Avoiding link overload: Text pages containing large proportions of links should be formatted so that the presence of links does not impede the readability of the text.",
      "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points.",
      "Consistent page layout: Pages should be designed using consistent layout schemes, supporting the user in finding similar information at the same position on different pages.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "This may be done by placing important information at the top and providing links to information that is further down the page.",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "Placing navigation components consistently: Navigation components should be placed consistently on the pages or in the framesets in the pages of the application.",
      "Readability of text: Text presented on the pages should be readable taking into account the expected display characteristics and spatial arrangement.",
      "Linking back to the home page or landmark pages: Each page should contain a link leading to the home page of the application or to a landmark page that is easy to recognize for the user.",
      "Error and status messages will be provided in a concise time/location referenced format to upper system levels in a content controllable manner."
    ]
  },
  {
    "text": "Distinguishing navigation links from controls: Navigation links should be clearly distinguishable from controls activating some action.",
    "id": [
      448,
      479,
      445,
      417,
      449,
      481,
      451,
      420,
      429,
      422
    ],
    "example": [
      "Using familiar terminology for navigation links: Navigation links — particularly links representing the main navigation structure — should be labelled with terms that are familiar to the user, based on his/her general knowledge, prior experience in the application domain or experience of using other systems.",
      "Consistency between navigation components and content: If navigation components (or overviews) are shown in conjunction with associated content, consistency between the navigation component and the content shown should be maintained by indicating in the navigation component (e.g.",
      "Distinguishable within-page links: Within-page links should be clearly distinguishable from other links that lead to a different page.",
      "Making navigation self-descriptive: Navigation should be designed to help users understand where they are, where they have been and where they can go next.",
      "Using descriptive link labels: The target or purpose of a link should be directly indicated by its label, avoiding generic labels such as “go” or “click here” except where the purpose of the link is clear from its context on the page or the labels have commonly understood semantics in the particular application domain.",
      "Placing navigation components consistently: Navigation components should be placed consistently on the pages or in the framesets in the pages of the application.",
      "Marking links opening new windows: Links that open new browser windows or pop-up windows should be clearly marked.",
      "Minimizing navigation effort: The number of navigation steps needed to reach a certain piece of content should be minimized as long as different mental models, navigation strategies and tasks of the user are taken into account.",
      "Designing for input device independence: User interfaces should be designed to allow activation of controls by a variety of input devices.",
      "If a splash screen is used, a navigation option to skip it should be offered."
    ]
  },
  {
    "text": "While white space is an important means of visually organizing the different content elements on a page, if the distance between the blocks of information displayed becomes too large, rapid skimming of the page can be impeded.",
    "id": [
      455,
      447,
      467,
      427,
      443,
      458,
      462,
      468,
      456,
      442
    ],
    "example": [
      "Use of “white space”: “White space” on a page i.e.",
      "Avoiding link overload: Text pages containing large proportions of links should be formatted so that the presence of links does not impede the readability of the text.",
      "Frequently, however, different pages have different purposes and types of content.",
      "This may be done by placing important information at the top and providing links to information that is further down the page.",
      "Readability of text: Text presented on the pages should be readable taking into account the expected display characteristics and spatial arrangement.",
      "Longer pages can be more appropriate when users want to read the content without interruptions or when the page needs to match a paper counterpart.",
      "Using frames with care: If frames are used, care should be taken to avoid possible problems, for example, those involving the use of the back button, bookmarking of pages, or scrolling of information.",
      "In such cases, pages can usually be grouped in different categories, using one layout scheme for each category consistently.",
      "space filled only with the background color should be used in such a way that it does not impair the visual skimming of the page.",
      "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points."
    ]
  },
  {
    "text": "Short pages are generally more appropriate for homepages, navigation pages, or overview pages that need to be read quickly.",
    "id": [
      458,
      442,
      457,
      434,
      453,
      447,
      465,
      477,
      443,
      462
    ],
    "example": [
      "Longer pages can be more appropriate when users want to read the content without interruptions or when the page needs to match a paper counterpart.",
      "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points.",
      "Selecting appropriate page lengths The length of a page should be selected so as to support the primary purpose and use of the page.",
      "Acceptable opening / download times: Application pages should be designed and implemented so that there are acceptable opening times and download times for the expected range of technical contexts of use (e.g.",
      "Providing printable document versions: If a document is either too long, dispersed over several pages or in a specific layout that is not suitable for online reading, a printer-friendly version of the document should be provided that prints the content in a form acceptable to the user (e.g.",
      "Avoiding link overload: Text pages containing large proportions of links should be formatted so that the presence of links does not impede the readability of the text.",
      "Providing alternative text-only pages: When style sheets and/or frames are turned off it should be possible for the user to read and understand the page; alternatively, the user should be provided with an equivalent alternative text-only page.",
      "Linking back to the home page or landmark pages: Each page should contain a link leading to the home page of the application or to a landmark page that is easy to recognize for the user.",
      "Readability of text: Text presented on the pages should be readable taking into account the expected display characteristics and spatial arrangement.",
      "Using frames with care: If frames are used, care should be taken to avoid possible problems, for example, those involving the use of the back button, bookmarking of pages, or scrolling of information."
    ]
  },
  {
    "text": "Overall layout schemes apply to all pages and are preferable when all pages have a similar structure.",
    "id": [
      466,
      468,
      469,
      481,
      457,
      477,
      443,
      416,
      454,
      447
    ],
    "example": [
      "Consistent page layout: Pages should be designed using consistent layout schemes, supporting the user in finding similar information at the same position on different pages.",
      "In such cases, pages can usually be grouped in different categories, using one layout scheme for each category consistently.",
      "Placing title information consistently: Page titles should be placed in a consistent location on the different pages.",
      "Placing navigation components consistently: Navigation components should be placed consistently on the pages or in the framesets in the pages of the application.",
      "Selecting appropriate page lengths The length of a page should be selected so as to support the primary purpose and use of the page.",
      "Linking back to the home page or landmark pages: Each page should contain a link leading to the home page of the application or to a landmark page that is easy to recognize for the user.",
      "Readability of text: Text presented on the pages should be readable taking into account the expected display characteristics and spatial arrangement.",
      "Providing text equivalents for non-text media objects: All non-text media objects, such as graphical images or video, should be provided with alternative equivalent textual descriptions and/or with equivalent text-based functionality.",
      "in the expected layout, paper format, or orientation).",
      "Avoiding link overload: Text pages containing large proportions of links should be formatted so that the presence of links does not impede the readability of the text."
    ]
  },
  {
    "text": "The proposed functional architecture is modeled around centralized deployment to facilitate ease of maintenance and leverage advancement in open standards and web technologies.",
    "id": [
      1151,
      1157,
      543,
      27,
      520,
      694,
      509,
      1081,
      1085,
      1227
    ],
    "example": [
      "In order to create the Center-to-Center infrastructure, interfaces to the existing systems will be created.",
      "Systems will interface to the “cloud” using a project defined protocol.",
      "The CCTNS system should ensure high scalability and performance through leveraging Asynchronous HTTP socket capabilities of web server for scalability and performance.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "The CCTNS system should be developed for a centralized deployment and maintenance ",
      "The Tactical Control System will operate in an open architecture and be capable of being hosted on computers that are typically supported by the using Service.",
      "The core services, support layer and security and access control components can be deployed as standard components with necessary configuration changes.",
      "The Tactical Control System shall provide an open software architecture to be capable of supporting additional CSCIs, CSCs, and CSUs for future AVs, future payloads, and payload capabilities (e.g.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services.",
      "The remote Center Control GUI shall be designed to execute on a public network (e.g., Internet) and transmit equipment requests to the C-2-C software system."
    ]
  },
  {
    "text": "The 3 C’s (Core-Configuration-Customization) forms the guiding principle for the architecture.",
    "id": [
      1245,
      521,
      199,
      475,
      563,
      1078,
      517,
      1246,
      707,
      1148
    ],
    "example": [
      "The Center-to-Center shall be implemented in the C/C++ programming language.",
      "The CCTNS system should be developed to be deployed in a 3-tier datacenter architecture ",
      "Section three is a detailed requirements specification targeted toward technical designers.",
      "In addition, when designing multimedia information presentations, the design principles and recommendations described in ISO 14915-1 to ISO 14915-3 should be taken into account.",
      "The format of the document follows that outlined in the IEEE STD 830 document, IEEE The VLA Expansion Project Correlator Monitor and Control System is responsible for correlator configuration, real time monitor/control, and hardware testing/servicing.",
      "The Tactical Control System shall have software based on Defense Information Infrastructure/Common Operating Environment per Assistant Secretary of Defense for Command, Control, Communications, and Intelligence (ASD(C3I)) Joint Technical Architecture (JTA).",
      "The CCTNS system should be implemented using Service Oriented Architecture (SOA) and have a modular design ",
      "The Center-to-Center web interface shall be implemented using C/C++ and ESRI ARC IMS.",
      "The Tactical Control System will be connected with Common Operational Modeling, Planning, and Simulation Strategy (COMPASS)",
      "The Center-to-Center project will be implemented using the evolving ITS Traffic Management Data Dictionary (TMDD) standard, the message sets associated with TMDD, other ITS Data Elements and Message Sets."
    ]
  },
  {
    "text": "The functional architecture of the CCTNS solution is given in the figure below.",
    "id": [
      57,
      517,
      56,
      386,
      145,
      1114,
      4,
      522,
      1160,
      520
    ],
    "example": [
      "There is a DigitalHome Use Case Model in the Appendix, which provides an overview of the system functionality and shows the relationships between the DigitalHome System entities.",
      "The CCTNS system should be implemented using Service Oriented Architecture (SOA) and have a modular design ",
      "This section provides a description of the functional requirements.",
      "The CCTNS system should provide for role-based control for the functionality within the CCTNS system ",
      "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the internal interfaces.",
      "The Human Computer Interface (HCI) shall be designed and implemented in accordance with the Tactical Control System HCI Specification, Tactical Control System 108.[SSS462] ",
      "It is made up of a list of the principal features of the system.",
      "The CCTNS system should be designed to have a n-tier architecture with the presentation logic separated from the business logic that is again separated from the data-access logic ",
      "The following sections define the requirements for the Center-to-Center project.",
      "The CCTNS system should be developed for a centralized deployment and maintenance "
    ]
  },
  {
    "text": "The functional architecture is composed of 4 major components based on SOA principles.",
    "id": [
      517,
      361,
      4,
      508,
      56,
      562,
      1161,
      125,
      127,
      1080
    ],
    "example": [
      "The CCTNS system should be implemented using Service Oriented Architecture (SOA) and have a modular design ",
      "The functional requirements for each of the modules are provided as A1 to A7 in separate enclosures.",
      "It is made up of a list of the principal features of the system.",
      "Each of the components contains multiple services as defined by Service Definition.",
      "This section provides a description of the functional requirements.",
      "The remainder of this document contains a more detailed description of the Correlator Monitor and Control System as well as the primary requirements necessary to design and build the EVLA Correlator Monitor and Control System.",
      "Requirements are listed in separate sections and in table format for each functional area.",
      "Section 4 contains general information to aid in the understanding of this specification.",
      "The APAF ground data system requirements are categorized according to functional areas and are defined in the following sections in table format.",
      "This includes, but is not limited to, the language, the computer, database, architecture, and interoperability."
    ]
  },
  {
    "text": "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
    "id": [
      529,
      539,
      538,
      530,
      540,
      531,
      537,
      536,
      534,
      519
    ],
    "example": [
      "The CCTNS system should support SSL encrypted connections ",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should support secure virtual private network connections ",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The CCTNS system should use HTTPS as the communication protocol, i.e., HTTP over an encrypted secure socket layer (SSL) ",
      "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs.",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries.",
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting.",
      "The CCTNS system should be built on a common User Access and Authentication Service to ensure Single-Sign on for the end-user "
    ]
  },
  {
    "text": "The CCTNS system should ensure high standards of security and access control through do not allow hard delete and perform only soft tagging the row for deletion.",
    "id": [
      534,
      539,
      535,
      538,
      536,
      537,
      533,
      540,
      405,
      514
    ],
    "example": [
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through preventing SQL Injection.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries.",
      "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs.",
      "The CCTNS system should support selective encryption of the stored data.",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The CCTNS system must allow persistent defaults for data entry where desirable.",
      "The CCTNS system should be designed in manner that operational data is not lost in case of any failure of equipment or communication network."
    ]
  },
  {
    "text": "The primary goal of this document is to provide a complete and accurate list of requirements for the VLA Expansion Project Correlator Monitor and Control System.",
    "id": [
      176,
      562,
      557,
      564,
      570,
      563,
      645,
      200,
      56,
      781
    ],
    "example": [
      "The distribution mechanisms shall be clearly defined/described in the APAF Operation Procedures Document.",
      "The remainder of this document contains a more detailed description of the Correlator Monitor and Control System as well as the primary requirements necessary to design and build the EVLA Correlator Monitor and Control System.",
      "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
      "The Correlator Monitor and Control System exists as an integrated part of the overall VLA Expansion Project Monitor and Control Structure.",
      "The Correlator monitor subsystem will provide VLA Expansion Project system wide access to all correlator system states including the Monitor and Control System supervisor system state.",
      "The format of the document follows that outlined in the IEEE STD 830 document, IEEE The VLA Expansion Project Correlator Monitor and Control System is responsible for correlator configuration, real time monitor/control, and hardware testing/servicing.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document.",
      "This section provides a description of the functional requirements.",
      "The Tactical Control System Mission plan shall include all necessary information required to be interoperable with the service specific mission planning systems including the Tactical Aircraft Mission Planning System (TAMPS), Aviation Mission Planning System (AMPS), and Air Force Mission Support System (AFMSS)."
    ]
  },
  {
    "text": "The ability to attempt recovery from failure or hot-swapped hardware devices will be built into this system.",
    "id": [
      621,
      625,
      101,
      587,
      1085,
      99,
      639,
      1121,
      583,
      772
    ],
    "example": [
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible.",
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible.",
      "If the DigitalHome System fails (due to power loss, loss of internet access, or other software or hardware failure), the system recovery mechanism shall restore system data (configuration, default parameter settings, planning, and usage data) from the most recent backup.",
      "The ability of the Correlator System to achieve and maintain high reliability and uptime will be vitally dependent upon reliable operation and rapid diagnosis and repair of faults in the hardware and software systems.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services.",
      "The Digital Home System shall incorporate backup and recovery mechanisms.",
      "The software part of the EVLA Correlator Monitor and Control System shall be able to perform without total system restart due to internal failure between system maintenance windows.",
      "The Tactical Control System shall provide a capability for porting an off-the-shelf, complex control joystick with multiple toggle and multi-position switches as part of the Tactical Control System hardware suite.",
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software upgrades."
    ]
  },
  {
    "text": "Watchdog processes and the Master Correlator Control Computer will likewise monitor Correlator Power Control Computer health.",
    "id": [
      559,
      637,
      558,
      1040,
      583,
      770,
      772,
      628,
      566,
      959
    ],
    "example": [
      "The Correlator Monitor and Control System shall monitor correlator and correlator subsystem health and take corrective action autonomously to recover from hardware and computing system faults.",
      "The Correlator Monitor and Control System shall be self-monitoring.",
      "The Correlator Monitor and Control System shall process and transfer dynamic control data and monitor data.",
      "The Tactical Control System shall monitor the uplink and downlink to each UAV under its control.",
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct workstation and peripheral equipment maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software upgrades.",
      "The Correlator Monitor and Control System processors shall be capable of meeting all data processing deadlines and anticipated future requirements The Correlator Monitor and Control System processors shall be capable of responding to correlator hardware inputs in a deterministic fashion with sufficient performance to avoid data loss, corruption or overflows.",
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results."
    ]
  },
  {
    "text": "Due to the more hardware specific connections and controls of the Correlator Power Control Computer, actions taken by external system upon hard failures are TBD.",
    "id": [
      605,
      771,
      638,
      583,
      587,
      627,
      772,
      624,
      621,
      625
    ],
    "example": [
      "There shall be a redundant communication path between the Master Correlator Control Computer and Correlator Power Control Computer to provide for remote reboot in the event of a networking or computing failure.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform fault detection/location (FD/L).",
      "It will be capable of detecting, reporting on and automatically taking action to remedy or lessen the impact of the following types of abnormal conditions: processor hardware failure, operating system hangs or crashes, temperature or voltage deviations, computational performance below minimum specifications, computational error rates above maximum specification, internal communications failures.",
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "The ability of the Correlator System to achieve and maintain high reliability and uptime will be vitally dependent upon reliable operation and rapid diagnosis and repair of faults in the hardware and software systems.",
      "This requirement is to allow correlator power monitoring and control to continue in the event of an Monitor and Control System network failure.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software upgrades.",
      "The Correlator Power Control Computer shall be a high availability type general purpose computer capable of supporting a COTS operating system and have the ability to accept a large number of external hardware status signals either directly or through external interface hardware.",
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible.",
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible."
    ]
  },
  {
    "text": "Each computer system in the Correlator Monitor and Control System shall have a hardware based watchdog timer configured to reboot the EVLA Correlator Monitor and Control System in the case of a system hang.",
    "id": [
      559,
      641,
      639,
      54,
      640,
      637,
      668,
      627,
      642,
      617
    ],
    "example": [
      "The Correlator Monitor and Control System shall monitor correlator and correlator subsystem health and take corrective action autonomously to recover from hardware and computing system faults.",
      "The EVLA Correlator Monitor and Control System shall be able to continue processing of all correlator configuration/control events until the queues of parameters are exhausted and external communications are restored.",
      "The software part of the EVLA Correlator Monitor and Control System shall be able to perform without total system restart due to internal failure between system maintenance windows.",
      "The system shall include digital programmable power switches which shall be used to monitor the current state of an appliance (e.g., a coffee maker is off or on).",
      "The hardware part of the EVLA Correlator Monitor and Control System shall be able to perform indefinitely without complete loss of service, except in the event of total failure of primary and backup power.",
      "The Correlator Monitor and Control System shall be self-monitoring.",
      "The EVLA Correlator Monitor and Control System shall continue operations, although not Description necessarily at full capacity, on all unaffected resources during partial shutdowns for maintenance, repair and/or upgrade.",
      "This requirement is to allow correlator power monitoring and control to continue in the event of an Monitor and Control System network failure.",
      "The EVLA Correlator Monitor and Control System shall be able to sit at idle and resume operations with minimal delay.",
      "The UPS devices need the ability to signal the Correlator Monitor and Control System when a power outage has occurred and keep the Correlator Monitor and Control System apprised of time remaining on backup power."
    ]
  },
  {
    "text": "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
    "id": [
      624,
      620,
      566,
      1085,
      580,
      1081,
      628,
      1063,
      1064,
      700
    ],
    "example": [
      "The Correlator Power Control Computer shall be a high availability type general purpose computer capable of supporting a COTS operating system and have the ability to accept a large number of external hardware status signals either directly or through external interface hardware.",
      "The CMIB shall conform to both electrical and physical The CMIB shall contain 64 Mbytes or greater of SDRAM, IDE hard disk interface, minimum of one serial and one parallel interface, PCI/ISA buses, 100BaseT network interface, capacity to boot and run a generic COTS operating system in a near real-time environment from local non-volatile storage.",
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services.",
      "The Master Correlator Control Computer will accept external data feeds for models, time standards, fiber-link phase corrections and other required data to be packaged with control data delivered to the correlator hardware.",
      "The Tactical Control System shall provide an open software architecture to be capable of supporting additional CSCIs, CSCs, and CSUs for future AVs, future payloads, and payload capabilities (e.g.",
      "The Correlator Monitor and Control System processors shall be capable of meeting all data processing deadlines and anticipated future requirements The Correlator Monitor and Control System processors shall be capable of responding to correlator hardware inputs in a deterministic fashion with sufficient performance to avoid data loss, corruption or overflows.",
      "The Tactical Control System hardware shall allow for long range communications from one Tactical Control System to another [SSS375], data storage expansion [SSS376], access to other computers to share in processing capability [SSS377], and multiple external peripherals [SSS378].",
      "The Tactical Control System hardware shall support the data rate characteristics of the AV, data link and payload to ensure interoperability.",
      "The Tactical Control System hardware will permit long range communications from one to another, data storage expansion, access to other computers to share in processing capability, and multiple external peripherals."
    ]
  },
  {
    "text": "All messages passed between Correlator Monitor and Control System system layers shall have both UTC and wall clock time stamp information appropriate for the message type.",
    "id": [
      634,
      934,
      949,
      1203,
      573,
      633,
      631,
      897,
      956,
      558
    ],
    "example": [
      "Other message internal time stamps can be used as monitor/control parameters as deemed necessary.",
      "Where applicable, Tactical Control System data burst messages shall comply with Variable Message Formats.",
      "The Tactical Control System shall provide the capability to log all incoming and outgoing formatted tactical messages.",
      "DATEX/ASN shall be used to transmit the TMDD message sets.",
      "Error and status messages will be provided in a concise time/location referenced format to upper system levels in a content controllable manner.",
      "Error messages will be stamped with their discovery time, control messages will be stamped with their generation time.",
      "All system error and debug messages shall be categorized in a logical fashion such that message traffic can be filtered as to content, detail, and message rate.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
      "The Correlator Monitor and Control System shall process and transfer dynamic control data and monitor data."
    ]
  },
  {
    "text": "Software shall be provided that allows an authorized user full access to all messaging, monitor, and control traffic.",
    "id": [
      618,
      662,
      645,
      1229,
      660,
      561,
      635,
      585,
      666,
      597
    ],
    "example": [
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "A system administrator shall have unrestricted access to all aspects of the EVLA Correlator Monitor and Control System.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "The user shall be provided with the capability to select a network identifier for a device command/control request.",
      "All users of the EVLA Correlator Monitor and Control System shall login using some form of unique identification.",
      "The Correlator Monitor and Control System shall allow for easy system access to aid testing and debugging.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "Software tools will be provided to assist the user at all access levels from system wide configuration and control to a low level CMIB command line instruction.",
      "The administrator shall have the ability to edit a user’s system access properties.",
      "Full access is required with a high level of data integration to provide the user with a logical and coherent interface."
    ]
  },
  {
    "text": "I/O, communications, and processing hardware shall be easily expandable, reconfigurable, augmentable and replaceable to meet increasing data traffic and processing demands imposed by VLA Expansion Project science, Correlator changes, and availability of new hardware.",
    "id": [
      700,
      1063,
      27,
      1151,
      624,
      597,
      1062,
      643,
      577,
      565
    ],
    "example": [
      "The Tactical Control System hardware will permit long range communications from one to another, data storage expansion, access to other computers to share in processing capability, and multiple external peripherals.",
      "The Tactical Control System hardware shall allow for long range communications from one Tactical Control System to another [SSS375], data storage expansion [SSS376], access to other computers to share in processing capability [SSS377], and multiple external peripherals [SSS378].",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "In order to create the Center-to-Center infrastructure, interfaces to the existing systems will be created.",
      "The Correlator Power Control Computer shall be a high availability type general purpose computer capable of supporting a COTS operating system and have the ability to accept a large number of external hardware status signals either directly or through external interface hardware.",
      "Full access is required with a high level of data integration to provide the user with a logical and coherent interface.",
      "The hardware of the Tactical Control System shall be capable of being scaled as well as being modular to meet the varying needs of the Services.",
      "All system processing and interconnect hardware shall be readily accessible for maintenance, repair, replacement and reconfiguration.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
      "The Correlator Monitor and Control System will provide a level of abstraction to modularize the correlator system within the VLA Expansion Project environment."
    ]
  },
  {
    "text": "This could be done via a username and associated password scheme that would authenticate and authorize the user access to the EVLA Correlator Monitor and Control System and, if applicable, grant the user access to restricted or controlled parts of the EVLA Correlator Monitor and Control System.",
    "id": [
      663,
      592,
      1229,
      659,
      90,
      1170,
      364,
      664,
      1228,
      660
    ],
    "example": [
      "Each user shall have a set of system access properties that defines the user’s privileges within the EVLA Correlator Monitor and Control System.",
      "A few authorized individuals may be allowed access to parts of the EVLA Correlator Monitor and Control System that are usually considered restricted.",
      "The user shall be provided with the capability to select a network identifier for a device command/control request.",
      "Development, testing and maintenance personnel, on the other hand, require access to some parts of the EVLA Correlator Monitor and Control System, but not all, indicating that an access level is needed that allows privileges to be granted on a per-user and what-do-you-need-to-do basis.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices ",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The administrator shall have the ability to create and add a new user to the EVLA Correlator Monitor and Control System.",
      "When the GUI application is initiated, the user shall be prompted for the following information, including User name and Password.",
      "All users of the EVLA Correlator Monitor and Control System shall login using some form of unique identification."
    ]
  },
  {
    "text": "Systems operations should be given unrestricted access to all aspects of the EVLA Correlator Monitor and Control System and should have the authority to grant and revoke privileges on a per-user basis.",
    "id": [
      662,
      663,
      618,
      645,
      1065,
      572,
      660,
      561,
      626,
      643
    ],
    "example": [
      "A system administrator shall have unrestricted access to all aspects of the EVLA Correlator Monitor and Control System.",
      "Each user shall have a set of system access properties that defines the user’s privileges within the EVLA Correlator Monitor and Control System.",
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "For each OUTRIDER system, the Tactical Control System shall provide full independent computer redundancy.",
      "The Correlator Monitor and Control System will be a fully observable system with the only limits placed on information access being those imposed by hardware, bandwidth, and/or security restrictions.",
      "All users of the EVLA Correlator Monitor and Control System shall login using some form of unique identification.",
      "The Correlator Monitor and Control System shall allow for easy system access to aid testing and debugging.",
      "The Correlator Power Control Computer shall have all required disk and file system facilities installed locally such that the EVLA Correlator Monitor and Control System can boot and run in a stand-alone configuration.",
      "All system processing and interconnect hardware shall be readily accessible for maintenance, repair, replacement and reconfiguration."
    ]
  },
  {
    "text": "Complete and comprehensible hardware systems specifications and configuration information shall be readily available.",
    "id": [
      643,
      671,
      645,
      650,
      561,
      597,
      1087,
      335,
      655,
      618
    ],
    "example": [
      "All system processing and interconnect hardware shall be readily accessible for maintenance, repair, replacement and reconfiguration.",
      "Software system and application code shall be well documented and written in a generally familiar language or languages.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "Operating system software shall either have source code available or come with sufficient diagnostics and customer support.",
      "The Correlator Monitor and Control System shall allow for easy system access to aid testing and debugging.",
      "Full access is required with a high level of data integration to provide the user with a logical and coherent interface.",
      "The Tactical Control System software shall be non-proprietary and have unlimited data rights.",
      "The Space Fractions system will be as secure as the web browser that will run the product.",
      "All users of the Correlator Monitor and Control System must be uniquely identified.",
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins."
    ]
  },
  {
    "text": "The SSS further specifies the methods to be used to ensure that each requirement has been met.",
    "id": [
      123,
      189,
      200,
      554,
      499,
      126,
      176,
      56,
      731,
      729
    ],
    "example": [
      "Section 2 is an overview of the descriptions of requirement determination, qualification procedures, rationale, and traceability that are used in the identification and the definitions of the requirements.",
      "The SRS will include the details of the system's requirements, interface, design issues, and components.",
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document.",
      "The requirements contained in this document are numbered based on the section/subsection in which they appear.",
      "The CCTNS system must provide adequate response times for commonly performed functions under both standard and peak conditions ",
      "Each requirement shall be: assigned a project-unique identifier.",
      "The distribution mechanisms shall be clearly defined/described in the APAF Operation Procedures Document.",
      "This section provides a description of the functional requirements.",
      "The initial TCS task analysis will produce a system baseline which will be optimized by engineering analysis and operator evaluations.",
      "The operational capabilities to be performed by the system will be determined by task analysis in accordance with MIL STD 1388 Task 401 as a guide based on a thorough understanding of Outrider and Predator mission requirements."
    ]
  },
  {
    "text": "The Tactical Control System will also provide connectivity to specifically identified Command, Control, Communications, Computers, and ",
    "id": [
      972,
      882,
      1010,
      1005,
      970,
      880,
      1000,
      1063,
      887,
      1007
    ],
    "example": [
      "The Tactical Control System shall provide the system functionality to allow interfacing with external systems via a local area network.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall support a concurrent uplink and downlink capability.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide the capability to interface with equipment necessary to provide connectivity with standard DoD tactical (VHF, UHF, and UHF/VHF) radios, Mobile Subscriber Equipment, and military and commercial satellite communications equipment.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall provide interfaces with the respective UAV program-provided data links for command and control.",
      "The Tactical Control System hardware shall allow for long range communications from one Tactical Control System to another [SSS375], data storage expansion [SSS376], access to other computers to share in processing capability [SSS377], and multiple external peripherals [SSS378].",
      "The Tactical Control System shall support a LOS data link and SATCOM data link capability.",
      "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment."
    ]
  },
  {
    "text": "The Tactical Control System will provide a common Human-Computer Interface (HCI) for tactical airborne platforms to simplify user operations, training, and facilitate seamless integration into the Services’ joint C4I infrastructure across all levels of interaction.",
    "id": [
      1113,
      936,
      974,
      927,
      723,
      993,
      926,
      982,
      992,
      760
    ],
    "example": [
      "The Tactical Control System shall facilitate Human-Computer Interfaces (HCIs) that support operation of all system modes, functions, and capabilities.",
      "The Tactical Control System will have the capability to manage all operational C4I interfaces across all 5 levels of interaction.",
      "The Tactical Control System will be interoperable with C4I systems.",
      "The Tactical Control System shall have the functionality necessary to manage all aspects of C4I system interfaces to include receiving, processing, and transmitting tactical information to include but not limited to character based text messages, NITF 2.0 imagery files, and RS-170A video.",
      "The Tactical Control System system will be capable of controlling the Predator and Outrider AVs with a single control system, using existing military services standard hardware and software, and supporting interfaces with various C4I systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall be capable of entering DII-COE compliant (C4I) networks.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with CCTV.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "In the Normal Operations Mode the Tactical Control System shall support C4I systems interface."
    ]
  },
  {
    "text": "The software will provide a high resolution computer generated graphical user interface that enables a UAV operator trained on one system to control different types of UAVs or UAV payloads with a minimum of additional training.",
    "id": [
      1091,
      693,
      1084,
      636,
      1089,
      585,
      853,
      1086,
      1077,
      851
    ],
    "example": [
      "The Tactical Control System software shall provide a high-resolution, computer-generated graphical user interface that enables a UAV operator trained on one system to control different types of UAVs as well as UAV payloads with minimal additional training.",
      "The software will provide the UAV operator the necessary tools for computer related communications, mission tasking, mission planning, mission execution, data receipt, data processing, limited data exploitation, and data dissemination.",
      "The Tactical Control System software shall provide the UAV operator with the necessary tools for computer related communications, mission tasking, mission planning, mission execution, data receipt, data processing, and data dissemination.",
      "A Graphical User Interface shall be provided as an interface to the Correlator Monitor and Control System test software that allows for a convenient and configurable tool to access the Correlator Monitor and Control System remotely through the VCI.",
      "Training software is the software that provides the computer based training functionality for the system operator.",
      "Software tools will be provided to assist the user at all access levels from system wide configuration and control to a low level CMIB command line instruction.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, UAV navigation methods by sending the proper control commands to the UAV.",
      "Tactical Control System software shall provide a windows based graphic operator interface.",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, flight behaviors by sending the proper control commands to the UAV."
    ]
  },
  {
    "text": "The Tactical Control System will use the computing hardware specified by the service specific procurement contracts.",
    "id": [
      983,
      999,
      980,
      986,
      985,
      987,
      989,
      1051,
      993,
      979
    ],
    "example": [
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "These requirements pertain to the Tactical Control System computer hardware and software.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS."
    ]
  },
  {
    "text": "The individual armed services will identify Tactical Control System computing hardware, the desired level of Tactical Control System functionality, the battlefield C4I connectivity, and the particular type of air vehicle and payloads to be operated depending upon the deployment concept and area of operations.",
    "id": [
      793,
      1062,
      833,
      953,
      726,
      971,
      699,
      983,
      924,
      1052
    ],
    "example": [
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The hardware of the Tactical Control System shall be capable of being scaled as well as being modular to meet the varying needs of the Services.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall display which C4I systems are supported and online during a mission.",
      "The primary function of the Tactical Control System is to provide command and control of the payload, Air Vehicle (AV), data link, and other necessary support equipment in order to employ tactical UAVs to conduct reconnaissance, surveillance, target acquisition, and target identification missions.",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "The Tactical Control System hardware must be scaleable or modular to meet varying Service needs.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System shall have the functionality to determine the location of items of interest within the payload field of view, and express these locations in coordinates acceptable for military applications.",
      "The Tactical Control System data sensitivities shall be determined by the data sensitivities of the systems with which it interfaces, to including the air vehicles, payloads, and C4I systems."
    ]
  },
  {
    "text": "The Tactical Control System integration with C4I systems will be accomplished through development of interfaces that permit information exchange between the Tactical Control System and specified C4I systems.",
    "id": [
      974,
      766,
      926,
      1005,
      727,
      993,
      976,
      930,
      997,
      927
    ],
    "example": [
      "The Tactical Control System will be interoperable with C4I systems.",
      "In the Training Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Tactical Control System shall be capable of entering DII-COE compliant (C4I) networks.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System will interface with and export and disseminate payload data to military supported units via external (not part of TCS) tactical communications systems, and C4I systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "For external communications to C4I systems the Tactical Control System shall utilize the Universal Communication Processor as well as the Common Message Processor (CMP) Government Off The Shelf (GOTS) software capabilities of the DII/COE to communicate with C4I systems using Tactical Communication (TACOMM) messages.",
      "The Tactical Control System shall provide information to the C4I system, utilizing data obtained from drones (non-real-time trajectories, tactical points, and details), for use by C4I system operators. This information is transmitted via tactical data communication links and is available for engagement by appropriate weapon systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ETRAC.",
      "The Tactical Control System shall have the functionality necessary to manage all aspects of C4I system interfaces to include receiving, processing, and transmitting tactical information to include but not limited to character based text messages, NITF 2.0 imagery files, and RS-170A video."
    ]
  },
  {
    "text": "The Tactical Control System will be connected with Joint Deployable Intelligence Support System (JDISS)",
    "id": [
      988,
      713,
      712,
      979,
      714,
      887,
      708,
      996,
      993,
      983
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JDISS.",
      "The Tactical Control System will be connected with Joint Service Imagery Processing System – Air Force (JSIPS-AF)",
      "The Tactical Control System will be connected with Joint Maritime Command Information System (JMCIS)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS.",
      "The Tactical Control System will be connected with Joint Surveillance Target Attack Radar System (JSTARS) Ground Station Module/Common",
      "The Tactical Control System shall support a LOS data link and SATCOM data link capability.",
      "The Tactical Control System will be connected with Contingency Airborne Reconnaissance System (CARS)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with MIES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners."
    ]
  },
  {
    "text": "The Tactical Control System will be connected with Joint Service Imagery Processing System - Navy (JSIPS-N)",
    "id": [
      713,
      712,
      714,
      718,
      887,
      716,
      931,
      717,
      979,
      1005
    ],
    "example": [
      "The Tactical Control System will be connected with Joint Service Imagery Processing System – Air Force (JSIPS-AF)",
      "The Tactical Control System will be connected with Joint Maritime Command Information System (JMCIS)",
      "The Tactical Control System will be connected with Joint Surveillance Target Attack Radar System (JSTARS) Ground Station Module/Common",
      "The Tactical Control System will be connected with Air Force Mission Support System (AFMSS)",
      "The Tactical Control System shall support a LOS data link and SATCOM data link capability.",
      "The Tactical Control System will be connected with Modernized Imagery Exploitation System (MIES)",
      "The Tactical Control System shall have the capability to interoperate with a data server to receive, extract, and push intelligence data.",
      "The Tactical Control System will be connected with Army Mission Planning System (AMPS)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems."
    ]
  },
  {
    "text": "The Tactical Control System will export and disseminate UAV imagery products, tactical communication messages, as well as mission plans and target coordinates.",
    "id": [
      686,
      735,
      733,
      782,
      685,
      734,
      785,
      684,
      784,
      929
    ],
    "example": [
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
      "The Tactical Control System will provide receipt and transmission of secondary imagery and/or data from UAV.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems.",
      "The Tactical Control System will direct receipt of imagery and/or data from multiple UAV.",
      "The Tactical Control System will provide direct receipt of imagery and/or data from UAV.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System will receipt and transmission of secondary imagery and/or data from multiple UAV.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System shall be responsible for the presentation of payload products and target coordinates for the purpose of export and dissemination."
    ]
  },
  {
    "text": "The Tactical Control System will also receive, process, and display tasking orders, and operational information from Service specific mission planning systems.",
    "id": [
      971,
      969,
      983,
      833,
      782,
      1126,
      784,
      953,
      793,
      1124
    ],
    "example": [
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "The Tactical Control System will interface with external systems to conduct mission coordination and operations.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System shall display which C4I systems are supported and online during a mission.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall provide automated Tactical Control System system information, control options, and logical and simple operator guidance and support for immediate and adaptive responding to crisis situations."
    ]
  },
  {
    "text": "The Tactical Control System shall meet the applicable capability and characteristic criteria established by the Operational Requirements Document (ORD) CAF 003-90-I-A for the RQ-1A Predator Medium Altitude Endurance Unmanned Aerial Vehicle/System (MAE UAV) and the Close Range – Tactical Unmanned Aerial Vehicle (CR-TUAV).",
    "id": [
      846,
      842,
      793,
      1142,
      781,
      986,
      980,
      784,
      677,
      977
    ],
    "example": [
      "The Tactical Control System shall provide the necessary system capabilities required for AV flight control BLOS via uplink command to two MAE air vehicles.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall have an objective capability to be integrated and operated from tactical and command and control aircraft.",
      "The Tactical Control System Mission plan shall include all necessary information required to be interoperable with the service specific mission planning systems including the Tactical Aircraft Mission Planning System (TAMPS), Aviation Mission Planning System (AMPS), and Air Force Mission Support System (AFMSS).",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "These UAVs shall include the Tactical Unmanned Aerial Vehicle (TUAV) and the Medium Altitude and Endurance (MAE) UAV (henceforth referred to as Outrider and Predator respectively), their associated payloads, and other network communication systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ASAS."
    ]
  },
  {
    "text": "The Tactical Control System shall inform the operator if the operator attempts to execute a function prohibited as a result of the determined level of interaction.",
    "id": [
      1090,
      1098,
      1036,
      1101,
      1104,
      860,
      777,
      838,
      968,
      779
    ],
    "example": [
      "The Tactical Control System software shall restrict the operator(s) from exercising levels of interaction not achievable by the system.",
      "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
      "When performing a given task during mission execution, the operator shall be given appropriate warning messages from other concurrently-executing subsystem tasks.",
      "The Tactical Control System operator shall be required to enter an acknowledgment prior to disabling the display of critical warning flags for any AV, Payload, ADT, GDT, and Tactical Control System faults.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "Tactical Control System shall notify the operator when AV performance parameters are out of limits.",
      "The Tactical Control System shall allow an Authorized Operator to execute a software debug capability and view the resulting debug diagnostic information.",
      "The Tactical Control System will allow the operator to conduct targeting."
    ]
  },
  {
    "text": "The operator shall have the capability to command the system to the Shutdown State from all modes under the Operations State.",
    "id": [
      774,
      851,
      853,
      886,
      752,
      968,
      964,
      743,
      777,
      896
    ],
    "example": [
      "Upon the selection of a shutdown command the Tactical Control System shall enter the Shutdown State, which will cause the Tactical Control System to be placed in a condition where power can be removed without impacting operations as well as causing damage to the system, and from which restart of the system can be accomplished normally.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, flight behaviors by sending the proper control commands to the UAV.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, UAV navigation methods by sending the proper control commands to the UAV.",
      "The operator shall be able to manually override any automatic data terminal control mode selection if desired, except during Emission Control (EMCON) and Hazards of Electromagnetic Radiation to Ordnance (HERO) conditions.",
      "For recovery from abnormal termination, Tactical Control System shall prompt the operator to select the type of recovery to be executed: (1)Resume in the Same Modes And Data; (2)Resume in the Same Modes but Review and Modify the Command Data as Necessary; or, (3) Perform a Command Shutdown and Startup Via the Normal ",
      "The Tactical Control System shall allow an Authorized Operator to execute a software debug capability and view the resulting debug diagnostic information.",
      "The Tactical Control System shall provide the capability for Authorized Operators to modify all Tactical Control System programmable parameters.",
      "When the Tactical Control System Software is terminated normally the Tactical Control System shall enter the Normal Startup Mode of operation upon application of power.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "The operator shall be able to manually override the automatic mode selection of the selected data terminal, if desired."
    ]
  },
  {
    "text": "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct data link terminal maintenance.",
    "id": [
      770,
      769,
      772,
      768,
      771,
      1113,
      959,
      899,
      760,
      1114
    ],
    "example": [
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct workstation and peripheral equipment maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct payload maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software upgrades.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct AV maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform fault detection/location (FD/L).",
      "The Tactical Control System shall facilitate Human-Computer Interfaces (HCIs) that support operation of all system modes, functions, and capabilities.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "In the Normal Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Human Computer Interface (HCI) shall be designed and implemented in accordance with the Tactical Control System HCI Specification, Tactical Control System 108.[SSS462] "
    ]
  },
  {
    "text": "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring.",
    "id": [
      772,
      770,
      771,
      768,
      769,
      833,
      755,
      959,
      968,
      1036
    ],
    "example": [
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software upgrades.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct workstation and peripheral equipment maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform fault detection/location (FD/L).",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct AV maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct payload maintenance.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System hardware and software shall execute periodic Fault Detection/Location (FD/L) while in the Normal Operations Mode and Training Mode, to include a periodic determination of level of interaction.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall allow an Authorized Operator to execute a software debug capability and view the resulting debug diagnostic information.",
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction."
    ]
  },
  {
    "text": "Shutdown of the Tactical Control System shall include storage as well as deletion, as specified by the operator, of mission data files, shutdown of appropriate functions, shutdown of HCIs, and proper termination of all active interfaces.",
    "id": [
      938,
      752,
      774,
      744,
      941,
      738,
      743,
      939,
      1036,
      1110
    ],
    "example": [
      "The Tactical Control System shall establish digital communication with the C4I systems and terminate the communication upon completion.",
      "For recovery from abnormal termination, Tactical Control System shall prompt the operator to select the type of recovery to be executed: (1)Resume in the Same Modes And Data; (2)Resume in the Same Modes but Review and Modify the Command Data as Necessary; or, (3) Perform a Command Shutdown and Startup Via the Normal ",
      "Upon the selection of a shutdown command the Tactical Control System shall enter the Shutdown State, which will cause the Tactical Control System to be placed in a condition where power can be removed without impacting operations as well as causing damage to the system, and from which restart of the system can be accomplished normally.",
      "When the Tactical Control System software is halted due to an unplanned power interruption as well as abnormal program termination, then the Tactical Control System shall enter the Recovery Startup Mode upon application of power.",
      "The Tactical Control System shall establish analog communication with C4I systems and terminate the communication once it is completed.",
      "The states of operation of the Tactical Control System shall include Startup, Operation, and Shutdown.",
      "When the Tactical Control System Software is terminated normally the Tactical Control System shall enter the Normal Startup Mode of operation upon application of power.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate digital communication with peripheral devices.",
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
      "All Tactical Control System warning messages and HCI actions shall be archived for later review."
    ]
  },
  {
    "text": "The Tactical Control System shall have the functionality to allow the operator to generate a UAV mission plan.",
    "id": [
      776,
      782,
      785,
      784,
      777,
      815,
      833,
      735,
      737,
      778
    ],
    "example": [
      "The Tactical Control System will allow the operator to conduct mission planning.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
      "The Tactical Control System will provide capability to have full function and control of the UAV from takeoff to landing.",
      "The Tactical Control System will allow the operator to conduct payload product management. "
    ]
  },
  {
    "text": "The Tactical Control System shall have the functionality to receive and process UAV mission plans from service specific mission planning systems.",
    "id": [
      784,
      782,
      785,
      983,
      1000,
      793,
      735,
      803,
      971,
      831
    ],
    "example": [
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System shall provide interfaces with the respective UAV program-provided data links for command and control.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "The Tactical Control System shall provide the system functionality necessary to generate a payload plan."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of storing a minimum of 500 mission plans under unique names to allow for later retrieval.",
    "id": [
      1075,
      793,
      802,
      1027,
      795,
      784,
      732,
      950,
      785,
      809
    ],
    "example": [
      "The Tactical Control System shall be capable of providing a 50% spare memory storage capacity over delivered storage used.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall allow the operator to define the desired AV route in waypoint format, and shall provide the capability to include up to 500 waypoints in each flight route plan.",
      "The Tactical Control System shall provide a tape drive for storage and retrieval of Tactical Control System data.",
      "Tactical Control System shall provide the capability for the operator to retrieve a mission plan for viewing, modification, as well as deletion at the operator's discretion, and allow the operator to save the mission plan under a different name, for future retrieval.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System shall provide software capabilities and hardware configurations necessary to fulfill the operational tasking requirements across the 5 levels of interaction.",
      "The Tactical Control System shall prepare annotated as well as un-annotated analog imagery for transmission. ",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System flight route planner will be able to designate flight corridors and restricted airspace."
    ]
  },
  {
    "text": "The Tactical Control System shall allow the operator to set the LOL delay timer(s) during mission planning.",
    "id": [
      868,
      810,
      776,
      862,
      860,
      777,
      838,
      1036,
      797,
      877
    ],
    "example": [
      "Tactical Control System shall display a LOL timer to the operator initiating a LOL onset.",
      "The Tactical Control System shall present to the operator the estimated time of arrival and fuel status at each programmed waypoint of the proposed mission plan.",
      "The Tactical Control System will allow the operator to conduct mission planning.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "Tactical Control System shall notify the operator when AV performance parameters are out of limits.",
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
      "The Tactical Control System shall notify the operator of all discrepancies found during the mission plan check as well as indicate successful completion of the mission plan check.",
      "The Tactical Control System shall provide override of payload automated as well as preprogrammed inputs."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the capability to enter waypoint data in alphanumeric format.",
    "id": [
      820,
      800,
      912,
      967,
      882,
      951,
      1025,
      884,
      1004,
      946
    ],
    "example": [
      "The Tactical Control System shall provide the capability to display waypoint data in alphanumeric format.",
      "The Tactical Control System shall provide the capability to print waypoint data in alphanumeric format.",
      "The Tactical Control System shall have a built-in text entry capability including the ability to annotate textual information on imagery.",
      "The Tactical Control System shall be capable of importing map information via operator procedure and shall be capable of incorporating vector format and Compressed ADRG (CADRG) maps.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal.",
      "The Tactical Control System shall have the functionality to output digital message data and imagery to a hard copy printer.",
      "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission."
    ]
  },
  {
    "text": "AV specific components used to perform ground based closed loop command and control functions for Tactical Control System shall be initialized upon operator selection of a specific AV.",
    "id": [
      842,
      793,
      840,
      852,
      850,
      846,
      794,
      882,
      792,
      957
    ],
    "example": [
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "The Tactical Control System shall have the capability to command the AV to use the navigation methods inherent to the selected AV.",
      "The Tactical Control System shall allow the operator to command the flight behavior characteristics inherent to the selected AV.",
      "The Tactical Control System shall provide the necessary system capabilities required for AV flight control BLOS via uplink command to two MAE air vehicles.",
      "The Tactical Control System shall provide the system functionality necessary to upload a flight route plan and payload plan (if applicable) to the AV via the selected system data link as well as direct ground connection.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall allow the operator to enter as well as review mission plan parameters, including AV flight parameters, payload control parameters, data link control parameters, AV VCR control parameters (if applicable to the selected AV), and AV loiter patterns.",
      "Tactical Control System shall be capable of executing AV maintenance software and displaying appropriate status results."
    ]
  },
  {
    "text": "As and objective, the Tactical Control System shall be interoperable with the Integrity Beacon Landing System (IBLS), and the Common Automated Recovery System (CARS), both used by Outrider.",
    "id": [
      981,
      977,
      990,
      991,
      980,
      986,
      997,
      998,
      992,
      989
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with CARS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ASAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ETRAC.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with COMPASS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES."
    ]
  },
  {
    "text": "The Tactical Control System shall allow the operator to initiate the emergency recovery feature of the AV, if the AV has an emergency recovery feature.",
    "id": [
      848,
      962,
      840,
      838,
      749,
      860,
      859,
      823,
      1138,
      957
    ],
    "example": [
      "The Tactical Control System shall provide the capability to implement an emergency action plan, if supported by the AV, to control the AV during equipment failures.",
      "The Tactical Control System shall allow the operator to control and monitor the AV's FD/L, if required and provided by the Original Equipment Manufacturer (OEM).",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "Tactical Control System shall notify the operator when AV performance parameters are out of limits.",
      "The Tactical Control System in the Recovery Startup Mode shall provide the system functionality to resume the Operations ",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "As an objective, the Tactical Control System shall support an automatic launch and recovery system.",
      "The Tactical Control System shall display an icon indicating AV position when receiving downlink from the desired AV.",
      "For AV safety as well as mission-critical Warnings, the Tactical Control System HCI shall provide a default selection as well as an override option, along with a selection of adaptive responses, and the minimum information necessary to assist the operator in responding quickly and adaptively to the emergency.",
      "Tactical Control System shall be capable of executing AV maintenance software and displaying appropriate status results."
    ]
  },
  {
    "text": "Tactical Control System shall provide the capability to monitor the status of all AV subsystems reporting status.",
    "id": [
      837,
      957,
      870,
      1040,
      899,
      952,
      840,
      854,
      833,
      847
    ],
    "example": [
      "The Tactical Control System shall have the capability to control and monitor multiple types of AVs.",
      "Tactical Control System shall be capable of executing AV maintenance software and displaying appropriate status results.",
      "The Tactical Control System will have the capability to control and monitor the AV payload(s).",
      "The Tactical Control System shall monitor the uplink and downlink to each UAV under its control.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System shall have the functionality to monitor the status of all C4I interfaces, and display appropriate control information.",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall support operation of the AV via all flight modes, to include manual controls."
    ]
  },
  {
    "text": "The Tactical Control System shall provide a graphical user interface display for the purpose of controlling the payload.",
    "id": [
      890,
      803,
      832,
      849,
      826,
      1122,
      1129,
      1130,
      929,
      1123
    ],
    "example": [
      "The Tactical Control System shall provide an interactive display for the purpose of controlling the data link terminal.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall provide the capability to display the payload swath for the selected payload for planning purposes.",
      "The Tactical Control System shall provide interactive displays necessary to command the flight of an AV.",
      "The Tactical Control System shall display icons indicating Tactical Control System position and Ground Data Terminal (GDT) position.",
      "The Tactical Control System shall use graphical representations to convey information, such as system status, C4I links, and AV-GDT links.",
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control.",
      "The Tactical Control System HCI shall provide the capability to select and amplify an object and point on a map as well as payload screen.",
      "The Tactical Control System shall be responsible for the presentation of payload products and target coordinates for the purpose of export and dissemination.",
      "The Tactical Control System shall provide for multi-level information display tailoring by the operator."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
    "id": [
      894,
      897,
      884,
      900,
      901,
      858,
      880,
      882,
      856,
      1123
    ],
    "example": [
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver functions of the selected data terminal.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
      "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall provide the functionality to control the power, transmitter signal strength, and frequencies used by ADT for data link communication.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall provide the functionality to control the ADT antenna.",
      "The Tactical Control System shall provide for multi-level information display tailoring by the operator."
    ]
  },
  {
    "text": "Annotation includes operator generated comments as well as graphics which are superimposed on the imagery.",
    "id": [
      236,
      1222,
      452,
      912,
      956,
      825,
      1219,
      787,
      1240,
      575
    ],
    "example": [
      "At the main title screen, the user will be able to view a general help screen to reveal basic instructions on system play.",
      "The GUI shall allow the data about an incident to be modified.",
      "Typical action types in user interfaces include manipulating application data, performing searches, communication actions, such as opening a new e-mail window or starting a chat function, and presentation-related actions, such as sorting a list of search results.",
      "The Tactical Control System shall have a built-in text entry capability including the ability to annotate textual information on imagery.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
      "The Tactical Control System shall display an icon, in variable sizes, indicating target position and type at coordinates selected by the operator.",
      "The Incident GUI shall allow the user to input the following information for each incident.",
      "The Tactical Control System mission planning function shall provide a graphical user interface that gives the operator the ability to define waypoints on a map based display using a pointing device with full keyset redundancy.",
      "For each device command/control status request sent by the Remote GUI, the status returned from the network identifier will be displayed in a scrollable list on the GUI.",
      "The translation will provide the correlator with specific goal oriented hardware configuration tables to satisfy the configuration requested by the A second interface with a human GUI will also allow for configuration of the correlator hardware, preferably through the same table structures used above."
    ]
  },
  {
    "text": "Overlays consist of information obtained from external sources that is selected by the operator for presentation with the imagery.",
    "id": [
      1152,
      917,
      1230,
      915,
      1012,
      353,
      916,
      967,
      946,
      419
    ],
    "example": [
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "The Tactical Control System operator shall be able to select the content of the overlay information.",
      "Once an Center is selected, the user shall be able to select a DMS from a list and provide the following information, including Target DMS, Message to be displayed and Beacons On/Off.",
      "The Tactical Control System shall display live and recorded imagery data, with as well as without annotation and overlay, upon operator request.",
      "This interface shall allow the information from the data server to be made available to other components of the Tactical Control System.",
      "It also gives the user the ability to customize the results view by criminal/accused or by cases.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "The Tactical Control System shall be capable of importing map information via operator procedure and shall be capable of incorporating vector format and Compressed ADRG (CADRG) maps.",
      "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission.",
      "Showing users where they are: Each presentation segment (page or window) should provide the user with a clear and sufficient indication of where he or she is in the navigation structure and of the current segment position with respect to the overall structure."
    ]
  },
  {
    "text": "The Tactical Control System shall have the capability to select and deselect several types of cross hairs (or other similar ICON) to identify a selected point on a target.",
    "id": [
      1129,
      789,
      1141,
      1130,
      825,
      924,
      921,
      880,
      819,
      917
    ],
    "example": [
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control.",
      "As an objective, the Tactical Control System shall have the capability to import as well as create and modify map display overlays for fire support coordination measures [SSS547], airspace control measures [SSS548], and threat identification measures.",
      "The Tactical Control System HCI shall provide for the capability to automatically designate target locations from the payload screen onto the map screen.",
      "The Tactical Control System HCI shall provide the capability to select and amplify an object and point on a map as well as payload screen.",
      "The Tactical Control System shall display an icon, in variable sizes, indicating target position and type at coordinates selected by the operator.",
      "The Tactical Control System shall have the functionality to determine the location of items of interest within the payload field of view, and express these locations in coordinates acceptable for military applications.",
      "The Tactical Control System shall have the capability to display Near-Real Time (NRT) imagery to include, as a minimum, date/time group, target location coordinates when the target is in the center of the field of view, north seeking arrow, and AV position and heading.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall provide the capability to modify the maximum number of threats displayed, when de-clutter is selected.",
      "The Tactical Control System operator shall be able to select the content of the overlay information."
    ]
  },
  {
    "text": "RS170A video and digital imagery shall be routed to Tactical Control System functions and displayed upon operator request.",
    "id": [
      915,
      956,
      946,
      951,
      899,
      940,
      937,
      955,
      734,
      950
    ],
    "example": [
      "The Tactical Control System shall display live and recorded imagery data, with as well as without annotation and overlay, upon operator request.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
      "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System shall send and receive analog imagery in RS-170A format with as well as without overlay.",
      "The Tactical Control System shall send and receive annotated and un-annotated digital imagery.",
      "The Tactical Control System shall be equipped to view incoming and outgoing, both annotated and un-annotated analog imagery.",
      "The Tactical Control System will provide direct receipt of imagery and/or data from UAV.",
      "The Tactical Control System shall prepare annotated as well as un-annotated analog imagery for transmission. "
    ]
  },
  {
    "text": "The Tactical Control System shall provide the capability to capture frozen-frames of imagery and store these frozen images for further review and processing.",
    "id": [
      946,
      1025,
      951,
      955,
      916,
      950,
      881,
      751,
      937,
      956
    ],
    "example": [
      "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall be equipped to view incoming and outgoing, both annotated and un-annotated analog imagery.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "The Tactical Control System shall prepare annotated as well as un-annotated analog imagery for transmission. ",
      "The Tactical Control System shall provide the system functionality necessary to record data obtained via the data link.",
      "The Tactical Control System shall be capable of automatically recording system state data, interface communications and other information necessary to support event reconstruction.",
      "The Tactical Control System shall send and receive annotated and un-annotated digital imagery.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages."
    ]
  },
  {
    "text": "The Tactical Control System will have the functionality to determine target coordinates, and estimate target coordinate accuracy.",
    "id": [
      925,
      788,
      922,
      921,
      924,
      923,
      1141,
      779,
      998,
      880
    ],
    "example": [
      "The Tactical Control System shall have the functionality to develop an estimate of the error in computed target coordinates, and associate the error estimate with the appropriate target.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions on the map display.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions located on the payload imagery display.",
      "The Tactical Control System shall have the capability to display Near-Real Time (NRT) imagery to include, as a minimum, date/time group, target location coordinates when the target is in the center of the field of view, north seeking arrow, and AV position and heading.",
      "The Tactical Control System shall have the functionality to determine the location of items of interest within the payload field of view, and express these locations in coordinates acceptable for military applications.",
      "The Tactical Control System shall support a target location function where the operator can request the current ground location of the payload field-of-view center.",
      "The Tactical Control System HCI shall provide for the capability to automatically designate target locations from the payload screen onto the map screen.",
      "The Tactical Control System will allow the operator to conduct targeting.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with COMPASS.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal."
    ]
  },
  {
    "text": "The Tactical Control System shall have the capability to use cable to deliver live video imagery in multiple locations.",
    "id": [
      1020,
      916,
      861,
      841,
      982,
      880,
      733,
      684,
      915,
      1018
    ],
    "example": [
      "The Tactical Control System shall be able to route VCR recorded payload video to the C4I Interfaces.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "Tactical Control System shall provide the capability to monitor specific telemetry elements real-time, and record all telemetry elements for future review and processing.",
      "AV telemetry data shall be available to support other Tactical Control System functions as required.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with CCTV.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System will provide receipt and transmission of secondary imagery and/or data from UAV.",
      "The Tactical Control System will receipt and transmission of secondary imagery and/or data from multiple UAV.",
      "The Tactical Control System shall display live and recorded imagery data, with as well as without annotation and overlay, upon operator request.",
      "The Tactical Control System will provide an interface between the Tactical Control System and a video cassette recorder."
    ]
  },
  {
    "text": "The Tactical Control System shall send and receive tactical communication messages. ",
    "id": [
      944,
      945,
      954,
      949,
      1016,
      901,
      900,
      1011,
      858,
      1010
    ],
    "example": [
      "The Tactical Control System shall create tactical communications messages.",
      "The Tactical Control System shall be capable of reviewing incoming Tactical Communication Messages.",
      "The Tactical Control System shall have the capability to review all tactical communication messages received and transmitted.",
      "The Tactical Control System shall provide the capability to log all incoming and outgoing formatted tactical messages.",
      "The Tactical Control System shall incorporate an intercom system that provides verbal communicate in the situation where there are multiple operators.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall provide an internal interface for establishing communications with the Real Time Processor (RTP) within Tactical Control System.",
      "The Tactical Control System shall provide the functionality to control the power, transmitter signal strength, and frequencies used by ADT for data link communication.",
      "The Tactical Control System shall support a concurrent uplink and downlink capability."
    ]
  },
  {
    "text": "The Tactical Control System will have the functionality to process received C4I messages and to prepare C4I messages for transmission.",
    "id": [
      927,
      974,
      780,
      760,
      976,
      766,
      952,
      727,
      944,
      833
    ],
    "example": [
      "The Tactical Control System shall have the functionality necessary to manage all aspects of C4I system interfaces to include receiving, processing, and transmitting tactical information to include but not limited to character based text messages, NITF 2.0 imagery files, and RS-170A video.",
      "The Tactical Control System will be interoperable with C4I systems.",
      "The Tactical Control System will allow the operator to conduct C4I system interface.",
      "In the Normal Operations Mode the Tactical Control System shall support C4I systems interface.",
      "For external communications to C4I systems the Tactical Control System shall utilize the Universal Communication Processor as well as the Common Message Processor (CMP) Government Off The Shelf (GOTS) software capabilities of the DII/COE to communicate with C4I systems using Tactical Communication (TACOMM) messages.",
      "In the Training Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Tactical Control System shall have the functionality to monitor the status of all C4I interfaces, and display appropriate control information.",
      "The Tactical Control System will interface with and export and disseminate payload data to military supported units via external (not part of TCS) tactical communications systems, and C4I systems.",
      "The Tactical Control System shall create tactical communications messages.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission."
    ]
  },
  {
    "text": "The Tactical Control System shall have the capability to review incoming annotated as well as un-annotated digital imagery.",
    "id": [
      951,
      955,
      946,
      956,
      937,
      950,
      1025,
      916,
      912,
      880
    ],
    "example": [
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall be equipped to view incoming and outgoing, both annotated and un-annotated analog imagery.",
      "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
      "The Tactical Control System shall send and receive annotated and un-annotated digital imagery.",
      "The Tactical Control System shall prepare annotated as well as un-annotated analog imagery for transmission. ",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "The Tactical Control System shall have a built-in text entry capability including the ability to annotate textual information on imagery.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of monitoring the status of all incoming and outgoing tactical communication messages.",
    "id": [
      954,
      945,
      949,
      901,
      900,
      944,
      899,
      894,
      880,
      897
    ],
    "example": [
      "The Tactical Control System shall have the capability to review all tactical communication messages received and transmitted.",
      "The Tactical Control System shall be capable of reviewing incoming Tactical Communication Messages.",
      "The Tactical Control System shall provide the capability to log all incoming and outgoing formatted tactical messages.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall create tactical communications messages.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver functions of the selected data terminal.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal."
    ]
  },
  {
    "text": "Tactical Control System shall be capable of executing workstation and peripheral equipment maintenance software and displaying appropriate status results.",
    "id": [
      959,
      958,
      957,
      1126,
      899,
      901,
      884,
      900,
      751,
      1125
    ],
    "example": [
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "Tactical Control System shall be capable of executing payload maintenance software and displaying appropriate status results.",
      "Tactical Control System shall be capable of executing AV maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of automatically recording system state data, interface communications and other information necessary to support event reconstruction.",
      "The Tactical Control System shall provide maximum automated system software support to system status monitoring and alerting of the Tactical Control System operator when a preset system parameter goes under as well as over a set threshold."
    ]
  },
  {
    "text": "The Tactical Control System shall restrict operator access to this capability via password protection.",
    "id": [
      965,
      1090,
      653,
      1055,
      1054,
      1042,
      939,
      1031,
      746,
      1125
    ],
    "example": [
      "As a minimum, the Tactical Control System shall restrict Operator access to this capability via password protection.",
      "The Tactical Control System software shall restrict the operator(s) from exercising levels of interaction not achievable by the system.",
      "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access.",
      "All hardware, software, documentation, and sensitive information processed by Tactical Control System shall be physically protected, minimally at the level determined by the risk index computed in to prevent intentional as well as unintentional disclosure, destruction, and modification.",
      "The Tactical Control System shall be designed to protect its communication and data links against enemy Electronic Warfare (EW) threats, physical anti-radiation weaponry and physical destruction.",
      "The Tactical Control System design shall provide protection against injury to Tactical Control System operators and maintenance personnel.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate digital communication with peripheral devices.",
      "The Tactical Control System safety requirements are intended to eliminate as well as control potential hazards to equipment and personnel involved in the Tactical Control System.",
      "Levels of interaction higher than those achievable by a particular Tactical Control System configuration shall be prohibited.",
      "The Tactical Control System shall provide maximum automated system software support to system status monitoring and alerting of the Tactical Control System operator when a preset system parameter goes under as well as over a set threshold."
    ]
  },
  {
    "text": "As a minimum, the Tactical Control System will restrict Operator access to this capability via password protection.",
    "id": [
      965,
      1090,
      653,
      1055,
      961,
      818,
      1031,
      1042,
      939,
      1003
    ],
    "example": [
      "As a minimum, the Tactical Control System shall restrict Operator access to this capability via password protection.",
      "The Tactical Control System software shall restrict the operator(s) from exercising levels of interaction not achievable by the system.",
      "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access.",
      "All hardware, software, documentation, and sensitive information processed by Tactical Control System shall be physically protected, minimally at the level determined by the risk index computed in to prevent intentional as well as unintentional disclosure, destruction, and modification.",
      "As a minimum, Tactical Control System shall provide Startup FD/L for the operator workstation.",
      "A de-clutter capability shall be provided that allows the operator to display only a selected number of the most significant threats.",
      "The Tactical Control System safety requirements are intended to eliminate as well as control potential hazards to equipment and personnel involved in the Tactical Control System.",
      "The Tactical Control System design shall provide protection against injury to Tactical Control System operators and maintenance personnel.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate digital communication with peripheral devices.",
      "The Tactical Control System shall as a minimum, allow Operator(s) to print freeze-frame video, C4I Messages, Mission Plans, FD/L information, and current map display."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
    "id": [
      1005,
      986,
      990,
      991,
      980,
      999,
      993,
      882,
      989,
      1126
    ],
    "example": [
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
    "id": [
      979,
      980,
      986,
      990,
      991,
      989,
      999,
      993,
      988,
      992
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JDISS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
    "id": [
      986,
      980,
      993,
      999,
      989,
      990,
      991,
      992,
      985,
      995
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TBMCS."
    ]
  },
  {
    "text": "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
    "id": [
      1025,
      881,
      1024,
      946,
      1004,
      951,
      956,
      982,
      1005,
      916
    ],
    "example": [
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall provide the system functionality necessary to record data obtained via the data link.",
      "The Tactical Control System shall be able to access data storage devices.",
      "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission.",
      "The Tactical Control System shall have the functionality to output digital message data and imagery to a hard copy printer.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with CCTV.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable."
    ]
  },
  {
    "text": "The Tactical Control System shall have an interface to a source of current navigation information.",
    "id": [
      1005,
      854,
      880,
      803,
      1000,
      852,
      1126,
      890,
      815,
      998
    ],
    "example": [
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall provide interfaces with the respective UAV program-provided data links for command and control.",
      "The Tactical Control System shall have the capability to command the AV to use the navigation methods inherent to the selected AV.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System shall provide an interactive display for the purpose of controlling the data link terminal.",
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with COMPASS."
    ]
  },
  {
    "text": "This interface shall allow for addition of future AVs and will provide the generic architecture to ensure interoperability.",
    "id": [
      1009,
      1081,
      1246,
      1151,
      728,
      977,
      1152,
      990,
      991,
      611
    ],
    "example": [
      "The Tactical Control System shall implement an AV Standard Interface that will provide the proper data format to ensure communications with the selected AV.",
      "The Tactical Control System shall provide an open software architecture to be capable of supporting additional CSCIs, CSCs, and CSUs for future AVs, future payloads, and payload capabilities (e.g.",
      "The Center-to-Center web interface shall be implemented using C/C++ and ESRI ARC IMS.",
      "In order to create the Center-to-Center infrastructure, interfaces to the existing systems will be created.",
      "Communications procedures, formats, and interfaces will be interoperable with selected standard DoD C4I systems, architectures, and protocols.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ASAS.",
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "This identifier will be used to form a unique IP address for CMIB network addressing and allow carry over IP addressing for hot swap modules."
    ]
  },
  {
    "text": "The uplink and downlink information passed between the Tactical Control System and the AV shall be in accordance with the associated AV documentation.",
    "id": [
      835,
      899,
      882,
      841,
      881,
      1009,
      863,
      871,
      794,
      957
    ],
    "example": [
      "The Tactical Control System shall transmit command and control information to the AV via the uplink to the AV, and receive AV telemetry and payload information via downlink from the AV.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "AV telemetry data shall be available to support other Tactical Control System functions as required.",
      "The Tactical Control System shall provide the system functionality necessary to record data obtained via the data link.",
      "The Tactical Control System shall implement an AV Standard Interface that will provide the proper data format to ensure communications with the selected AV.",
      "The Tactical Control System shall display the AV status, to include but not be limited to the AV location and flight and avionics system status.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall provide the system functionality necessary to upload a flight route plan and payload plan (if applicable) to the AV via the selected system data link as well as direct ground connection.",
      "Tactical Control System shall be capable of executing AV maintenance software and displaying appropriate status results."
    ]
  },
  {
    "text": "The Tactical Control System design shall consider all safety requirements affecting design and performance except nuclear safety.",
    "id": [
      1031,
      1030,
      1038,
      1042,
      952,
      831,
      1054,
      954,
      1055,
      1043
    ],
    "example": [
      "The Tactical Control System safety requirements are intended to eliminate as well as control potential hazards to equipment and personnel involved in the Tactical Control System.",
      "All Tactical Control System internal data decisions will be left to the design and the requirement specifications for system components.",
      "The Tactical Control System shall be designed such that no single hardware failure results in an unsafe command to be transmitted to the air vehicle.",
      "The Tactical Control System design shall provide protection against injury to Tactical Control System operators and maintenance personnel.",
      "The Tactical Control System shall have the functionality to monitor the status of all C4I interfaces, and display appropriate control information.",
      "The Tactical Control System shall provide the system functionality necessary to generate a payload plan.",
      "The Tactical Control System shall be designed to protect its communication and data links against enemy Electronic Warfare (EW) threats, physical anti-radiation weaponry and physical destruction.",
      "The Tactical Control System shall have the capability to review all tactical communication messages received and transmitted.",
      "All hardware, software, documentation, and sensitive information processed by Tactical Control System shall be physically protected, minimally at the level determined by the risk index computed in to prevent intentional as well as unintentional disclosure, destruction, and modification.",
      "The system design shall use MIL-STD-2036, as a guide, with regard to personnel hazards, and MIL-STD-1472D, as a guide for safety from a human engineering viewpoint."
    ]
  },
  {
    "text": "The Tactical Control System shall comply with para 5.3 of MIL-STD 882C, “System Safety Program Requirements”, dated 19 January 1993 w/ Notice 1 dated 19 January 1996.",
    "id": [
      1047,
      674,
      1066,
      1079,
      987,
      1125,
      1124,
      1043,
      1048,
      1114
    ],
    "example": [
      "Therefore, as per DoD Regulation 5000.2-R, dated March 15, 1996, the Tactical Control System shall meet security requirements in accordance with DoD Directive 5200.28(D), “Security Requirements for Automated Information Systems” dated March 21, 1988.",
      "This TACTICAL CONTROL SYSTEM (TCS) - SYSTEM / SUBSYSTEM SPECIFICATION (SSS) - VERSION 1.0 identifies, specifies, and establishes the detailed system requirements for the Tactical control system as set forth by the OPERATIONAL REQUIREMENTS DOCUMENT FOR THE UNMANNED AERIAL VEHICLE (UAV) TACTICAL CONTROL SYSTEM (TCS) - VERSION 5.0.",
      "The Tactical Control System shall conform with the National Institute for Standard Technology (NIST) Federal Information Processing Standard (FIPS) Publication 151-2 (POSIX.1).",
      "The Tactical Control System shall comply with the Assistant Secretary of Defense (C3I) Joint Technical Architecture (JTA).",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide maximum automated system software support to system status monitoring and alerting of the Tactical Control System operator when a preset system parameter goes under as well as over a set threshold.",
      "The Tactical Control System shall provide automated Tactical Control System system information, control options, and logical and simple operator guidance and support for immediate and adaptive responding to crisis situations.",
      "The system design shall use MIL-STD-2036, as a guide, with regard to personnel hazards, and MIL-STD-1472D, as a guide for safety from a human engineering viewpoint.",
      "The Tactical Control System shall be accredited by the Designated Approving Authority prior to processing classified as well as sensitive unclassified data.",
      "The Human Computer Interface (HCI) shall be designed and implemented in accordance with the Tactical Control System HCI Specification, Tactical Control System 108.[SSS462] "
    ]
  },
  {
    "text": "The Tactical Control System shall be designed such that no single software error results in an unsafe command to be transmitted to the air vehicle.",
    "id": [
      1038,
      1033,
      959,
      884,
      854,
      737,
      757,
      958,
      954,
      964
    ],
    "example": [
      "The Tactical Control System shall be designed such that no single hardware failure results in an unsafe command to be transmitted to the air vehicle.",
      "The Tactical Control System shall provide adequate capability to allow the operator to operate each UAV within its certified operational flight envelope.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System will provide capability to have full function and control of the UAV from takeoff to landing.",
      "In the Normal Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "Tactical Control System shall be capable of executing payload maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall have the capability to review all tactical communication messages received and transmitted.",
      "The Tactical Control System shall provide the capability for Authorized Operators to modify all Tactical Control System programmable parameters."
    ]
  },
  {
    "text": "The Tactical Control System shall be approved for operation at the same level as the systems with which it interfaces.",
    "id": [
      999,
      993,
      989,
      990,
      991,
      992,
      980,
      986,
      985,
      1006
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall have an interface between the Tactical Control System and DoD standard power supply equipment."
    ]
  },
  {
    "text": "This section not applicable, therefore tailored out.",
    "id": [
      177,
      195,
      234,
      197,
      554,
      340,
      644,
      1161,
      56,
      754
    ],
    "example": [
      "This section identifies the requirements considered but not part of the APAF ground data system requirements.",
      "Section one is a brief overview of the product, including definitions and references.",
      "There is an option to skip the introduction, if desired.",
      "Section two is a general description of the product requirements from a user's perspective.",
      "The requirements contained in this document are numbered based on the section/subsection in which they appear.",
      "There are no additional requirements at this time.",
      "This excludes items that due to their physical location, are not practical to configure for ready access.",
      "Requirements are listed in separate sections and in table format for each functional area.",
      "This section provides a description of the functional requirements.",
      "The Operations State modes shall not exist concurrently."
    ]
  },
  {
    "text": "Training software shall be alterable without affecting the configuration of the operational software.",
    "id": [
      1088,
      648,
      1087,
      652,
      773,
      623,
      672,
      964,
      317,
      1089
    ],
    "example": [
      "The Tactical Control System’s operating system and executable software shall be re-programmable without hardware disassembly.",
      "All software processes shall be killable, restartable, debuggable and testable with minimal impact on normal system operations.",
      "The Tactical Control System software shall be non-proprietary and have unlimited data rights.",
      "Seamlessness shall be accomplished in a manner that is seamless, in that it does not affect hardware modules or software functionality that it meets at interfaces.",
      "Functions, except for software upgrade and software debug, under the Maintenance Operations Mode shall operate concurrently without precluding or excluding any of the other functions in accordance with allowable operations as determined by the appropriate levels of interaction.",
      "This should allow the correlator CMIBs to boot, configure, and run without any communication outside of the correlator Monitor and Control System network.",
      "Software shall be written in a style that is easily readable and using practices that allow for minimal confusion.",
      "The Tactical Control System shall provide the capability for Authorized Operators to modify all Tactical Control System programmable parameters.",
      "This system allows for real-time updates to the game's content without the need for system restarts or interruptions, enabling a seamless integration of new or revised educational material into the game sequence.",
      "Training software is the software that provides the computer based training functionality for the system operator."
    ]
  },
  {
    "text": "All Tactical Control System operator inputs shall be error checked such that any erroneous operator entry will not cause current processing to terminate.",
    "id": [
      947,
      797,
      798,
      1098,
      948,
      1036,
      1038,
      1125,
      1104,
      102
    ],
    "example": [
      "All digital messages received by the Tactical Control System shall be automatically checked for errors and corrected when possible.",
      "The Tactical Control System shall notify the operator of all discrepancies found during the mission plan check as well as indicate successful completion of the mission plan check.",
      "The Tactical Control System shall provide the capability to override validation faults after the fault is acknowledged by the operator.",
      "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
      "All erroneous messages that cannot be corrected by Tactical Control System shall be flagged to the operator.",
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
      "The Tactical Control System shall be designed such that no single hardware failure results in an unsafe command to be transmitted to the air vehicle.",
      "The Tactical Control System shall provide maximum automated system software support to system status monitoring and alerting of the Tactical Control System operator when a preset system parameter goes under as well as over a set threshold.",
      "The Tactical Control System operator shall be required to enter an acknowledgment prior to disabling the display of critical warning flags for any AV, Payload, ADT, GDT, and Tactical Control System faults.",
      "All DigitalHome operations shall incorporate exception handling so that the system responds to a user with a clear, descriptive message when an error or an exceptional condition occurs."
    ]
  },
  {
    "text": "The operational tasks to be performed concurrently by the operator during normal operation will be determined by appropriate task analysis and function allocation.",
    "id": [
      1101,
      730,
      755,
      773,
      761,
      767,
      731,
      853,
      777,
      860
    ],
    "example": [
      "When performing a given task during mission execution, the operator shall be given appropriate warning messages from other concurrently-executing subsystem tasks.",
      "Tasks will be evaluated and allocated based on operator skills and proficiencies.",
      "The Tactical Control System hardware and software shall execute periodic Fault Detection/Location (FD/L) while in the Normal Operations Mode and Training Mode, to include a periodic determination of level of interaction.",
      "Functions, except for software upgrade and software debug, under the Maintenance Operations Mode shall operate concurrently without precluding or excluding any of the other functions in accordance with allowable operations as determined by the appropriate levels of interaction.",
      "Functions under the Normal Operations Mode shall operate concurrently without precluding or excluding any of the other functions, in accordance with allowable operations as determined by the appropriate levels of interaction.",
      "Functions under the Training Operations Mode shall operate concurrently without precluding or excluding any of the other functions, in accordance with allowable operations as determined by the appropriate levels of interaction.",
      "The initial TCS task analysis will produce a system baseline which will be optimized by engineering analysis and operator evaluations.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, UAV navigation methods by sending the proper control commands to the UAV.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required."
    ]
  },
  {
    "text": "The Tactical Control System HCI shall provide for visual Warnings, Cautions, and Advisories to be displayed at or near the center of the field of view, i.e., within a 30o cone, of all monitors in a Tactical Control System system.",
    "id": [
      1137,
      1139,
      1116,
      880,
      1130,
      1135,
      1140,
      952,
      1141,
      1126
    ],
    "example": [
      "The Tactical Control System HCI shall provide for separation, grouping, and visual coding of multiple categories of alerts, to include Warnings, Cautions, and Advisories.",
      "The Tactical Control System HCI shall provide for on-screen information to include, as a minimum, overlays, headers, cursors, alphanumeric annotation, waypoints, crosshairs, designed to be visible against the complete spectrum of map and payload video backgrounds.",
      "The Tactical Control System shall provide the functionality to display all HCI elements on any available monitor on the Tactical Control System workstation.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System HCI shall provide the capability to select and amplify an object and point on a map as well as payload screen.",
      "The Tactical Control System HCI shall provide the capability to display operator definable “Lock Out” zones around waypoints, Launch and Recovery Point (LRP), as well as any selected point on the AV flight path.",
      "The Tactical Control System HCI shall provide continuously-available, on-screen control functions for time and missioncritical operations, to include as a minimum print, freeze, declassification, mark VCR, declutter, cease RF transmission.",
      "The Tactical Control System shall have the functionality to monitor the status of all C4I interfaces, and display appropriate control information.",
      "The Tactical Control System HCI shall provide for the capability to automatically designate target locations from the payload screen onto the map screen.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator."
    ]
  },
  {
    "text": "The Tactical Control System shall have an objective capability to be integrated and operated from ships.",
    "id": [
      1143,
      1144,
      1142,
      1059,
      880,
      852,
      837,
      1010,
      831,
      928
    ],
    "example": [
      "The Tactical Control System shall have an objective capability to be integrated and operated from submarines.",
      "The Tactical Control System shall have a capability to be integrated and operated from land based platforms.",
      "The Tactical Control System shall have an objective capability to be integrated and operated from tactical and command and control aircraft.",
      "The Tactical Control System shall be capable of operation within environments specified in the System/Subsystem Design Document for the land-based shelter and shipboard environments.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall have the capability to command the AV to use the navigation methods inherent to the selected AV.",
      "The Tactical Control System shall have the capability to control and monitor multiple types of AVs.",
      "The Tactical Control System shall support a concurrent uplink and downlink capability.",
      "The Tactical Control System shall provide the system functionality necessary to generate a payload plan.",
      "The Tactical Control System shall plan and conduct a mission."
    ]
  },
  {
    "text": "This Software Requirements Specification (SRS) provides the requirements for the Center-to-Center (C2C) Communications Network that is based on a Texas Department of Transportation (TxDOT) C2C project.",
    "id": [
      3,
      189,
      1146,
      187,
      674,
      724,
      1078,
      112,
      1081,
      1157
    ],
    "example": [
      "The DigitalHome Software Requirements Specification (SRS) is based on the DigitalHome Customer Need Statement.",
      "The SRS will include the details of the system's requirements, interface, design issues, and components.",
      "The TxDOT Center-to-Center project initially connected the DFW TxDOT Traffic Management Centers (TMCs).",
      "This is the Software Requirements Specification (SRS) for the \"Space Fractions\" system.",
      "This TACTICAL CONTROL SYSTEM (TCS) - SYSTEM / SUBSYSTEM SPECIFICATION (SSS) - VERSION 1.0 identifies, specifies, and establishes the detailed system requirements for the Tactical control system as set forth by the OPERATIONAL REQUIREMENTS DOCUMENT FOR THE UNMANNED AERIAL VEHICLE (UAV) TACTICAL CONTROL SYSTEM (TCS) - VERSION 5.0.",
      "The Tactical Control System shall consist of the Tactical Control System workstation Hardware Configuration Items (HWCIs), TCS Computer Software Configuration Items (CSCIs), and additional TCS Support HWCIs and CSCIs.",
      "The Tactical Control System shall have software based on Defense Information Infrastructure/Common Operating Environment per Assistant Secretary of Defense for Command, Control, Communications, and Intelligence (ASD(C3I)) Joint Technical Architecture (JTA).",
      "This Software Requirements Specification (SRS) identifies the requirements for the ASPERA-3 Processing and Archiving Facility (APAF) ground data system for the Mars Express mission.",
      "The Tactical Control System shall provide an open software architecture to be capable of supporting additional CSCIs, CSCs, and CSUs for future AVs, future payloads, and payload capabilities (e.g.",
      "Systems will interface to the “cloud” using a project defined protocol."
    ]
  },
  {
    "text": "The Center-to-Center project mnemonic uniquely identifies the Center-to-Center project to distinguish its requirements from the requirements of other ITS systems.",
    "id": [
      1162,
      1160,
      1151,
      1245,
      1146,
      556,
      1153,
      1155,
      1150,
      1246
    ],
    "example": [
      "The mnemonic for the Center-to-Center project is Center-to-Center.",
      "The following sections define the requirements for the Center-to-Center project.",
      "In order to create the Center-to-Center infrastructure, interfaces to the existing systems will be created.",
      "The Center-to-Center shall be implemented in the C/C++ programming language.",
      "The TxDOT Center-to-Center project initially connected the DFW TxDOT Traffic Management Centers (TMCs).",
      "It is the primary interface by which the correlator is configured, operated, and serviced.",
      "The Center-to-Center infrastructure is being created using a series of building blocks.",
      "The software is being designed so that multiple instances of a building block can be deployed by simply “configuring” the building block of operation within a specific agency.",
      "The Center-to-Center infrastructure must interconnect several dissimilar traffic management systems.",
      "The Center-to-Center web interface shall be implemented using C/C++ and ESRI ARC IMS."
    ]
  },
  {
    "text": "The Requirement Numbers are a combination of target Advanced Traffic Management System (ATMS) and sequential within a given functional area.",
    "id": [
      1163,
      1161,
      127,
      508,
      56,
      554,
      160,
      163,
      128,
      151
    ],
    "example": [
      "The Requirement Category Mnemonic is a two-letter mnemonic for each functional area.",
      "Requirements are listed in separate sections and in table format for each functional area.",
      "The APAF ground data system requirements are categorized according to functional areas and are defined in the following sections in table format.",
      "Each of the components contains multiple services as defined by Service Definition.",
      "This section provides a description of the functional requirements.",
      "The requirements contained in this document are numbered based on the section/subsection in which they appear.",
      "The mnemonic, LR, is used in the requirement identifiers to show that these requirements are Logistical ",
      "The APAF data system requirements for delivering the ASPERA-3 IDFS data, Mars Express Orbit/Attitude IDFS data, and software are described in the following table.",
      "The requirements associated with the functionality of the APAF ground data system are itemized in the table below.",
      "The requirements associated with computer resources are listed in the table below."
    ]
  },
  {
    "text": "The Center shall support the following status information about each Park and Ride Lot, including network identifier, park and ride lot identifier, park and ride lot name, location, status and capacity.",
    "id": [
      1186,
      1197,
      1171,
      1198,
      1196,
      1187,
      1177,
      1181,
      1194,
      1195
    ],
    "example": [
      "The Center shall support the following status information about each Parking Lot, including network identifier, parking lot identifier, parking lot name, location and status.",
      "The Center shall support the following status information about each Light/Commuter Location, including network identifier, link identifier, commuter or light rail identifier, commuter or light rail name, location and schedule adherence.",
      "The Center shall support the following status information about each LCS, including network identifier, LCS identifier, LCS name, Location and Status.",
      "The Center shall support the following status information about each Vehicle Priority, including vehicle identifier, network identifier, link identifier and intersection identifier.",
      "The Center shall support the following status information about each Light/Commuter Stop, including network identifier, link identifier, commuter or light rail stop identifier, commuter or light rail stop name, location and routes.",
      "The Center shall support the following status information about each School Zone, including network identifier, link identifier, school zone identifier and school zone name.",
      "The Center shall support the status information about each ramp meter, including network identifier, Ramp Meter identifier, Ramp Meter name, Location and Status.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the following status information about each Bus Stop, including network identifier, link identifier, relative link location, name and location.",
      "The Center shall support the following status information about each Bus Location, including network identifier, link identifier, bus identifier, bus name, location and schedule adherece."
    ]
  },
  {
    "text": "The Data Collector shall be designed to support the storage of TMDD data elements and message set information.",
    "id": [
      911,
      914,
      881,
      1148,
      1024,
      577,
      1147,
      1026,
      1025,
      1069
    ],
    "example": [
      "The NITF 2.0 imagery files generated by the Tactical Control System shall contain the necessary telemetry and support data to permit subsequent imagery exploitation by C4I systems.",
      "Payload telemetry data shall be available to support other Tactical Control System functions as required.",
      "The Tactical Control System shall provide the system functionality necessary to record data obtained via the data link.",
      "The Center-to-Center project will be implemented using the evolving ITS Traffic Management Data Dictionary (TMDD) standard, the message sets associated with TMDD, other ITS Data Elements and Message Sets.",
      "The Tactical Control System shall be able to access data storage devices.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
      "This Center-to-Center infrastructure implements a repository for traffic data and provides a mechanism to exchange device control information between TMCs.",
      "The Tactical Control System shall provide a CD drive for the retrieval of Tactical Control System data.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System computer system shall contain a CD-ROM drive that is compatible with National Imagery and Mapping Agency (NIMA), CD-ROM Digital Terrain Elevation Data (DTED), Digital Feature Analysis Data (DFAD), and embedded training media."
    ]
  },
  {
    "text": "The Incident GUI shall allow the user to enter incident or lane closure information without the use of an Center.",
    "id": [
      1225,
      1226,
      1223,
      1220,
      364,
      1219,
      1222,
      1228,
      17,
      219
    ],
    "example": [
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "The GUI shall allow a user to delete a previously entered incident.",
      "The Incident GUI shall allow the user to input the following information for each lane closure.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The Incident GUI shall allow the user to input the following information for each incident.",
      "The GUI shall allow the data about an incident to be modified.",
      "When the GUI application is initiated, the user shall be prompted for the following information, including User name and Password.",
      "Although the general user is not familiar with the technical features of the DigitalHome system, he/she is familiar with the use of a web interface and can perform simple web operations (logging in and logging out, browsing web pages, and submitting information and requests via a web interface).",
      "Since the Space Fractions system requires a Flash-supporting browser, the external interface will depend on the configuration of the browser."
    ]
  },
  {
    "text": "Once an Center is selected, the user shall be able to select a CCTV from a list and provide the following information.",
    "id": [
      1232,
      1174,
      1175,
      1173,
      1176,
      1230,
      1235,
      1218,
      1199,
      1238
    ],
    "example": [
      "Once an Center is selected, the user shall be able to issue a CCTV switching command, including Source (input) and Destination port (output).",
      "To support CCTV control in other centers, the Center shall be able to support the following CCTV control request, including network identifier, CCTV identifier, username, Password.",
      "To support video snapshots, the Center shall be able to support the status information, including network identifier, CCTV identifier, CCTV name and status.",
      "The Center shall provide the information status information about each CCTV, including network identifier, CCTV identifier, CCTV name, Location and Status.",
      "To support CCTV switching in other centers, the Center shall be able to support the following CCTV switching command, including network identifier, username, Password and video channel input identifier.",
      "Once an Center is selected, the user shall be able to select a DMS from a list and provide the following information, including Target DMS, Message to be displayed and Beacons On/Off.",
      "Once an Center is selected, the user shall be able to select a Traffic Signal from a list and provide the following information, including Target Traffic Signal and Plan.",
      "The map shall be capable of displaying the following for a CCTV.",
      "The Center shall support the following information about network device status, including network identifier, number of DMSs, number of LCSs, DMS status data, LCS status data and CCTV status data.",
      "Once an Center is selected, the user shall be able to select a Reversible Lane from a list and provide the following information, including Target Reversible Lane and Plan."
    ]
  },
  {
    "text": "In this mode the Center-to-Center receives data from all connected systems, including the Incident GUI, and combines the data into a single data store (database).",
    "id": [
      1147,
      1152,
      577,
      597,
      1012,
      566,
      556,
      599,
      544,
      943
    ],
    "example": [
      "This Center-to-Center infrastructure implements a repository for traffic data and provides a mechanism to exchange device control information between TMCs.",
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
      "Full access is required with a high level of data integration to provide the user with a logical and coherent interface.",
      "This interface shall allow the information from the data server to be made available to other components of the Tactical Control System.",
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "It is the primary interface by which the correlator is configured, operated, and serviced.",
      "It is assumed that all auxiliary data needed for real time update of correlator parameters will be provided directly by the VLA Expansion Project Monitor and Control System system or by dedicated servers.",
      "The CCTNS system should ensure high scalability and performance through hosting all the static content (documents, images) on the web server.",
      "Processing will include formatting, storing, routing, and display."
    ]
  }
]