[
  {
    "text": "The Smart House components consist of household devices (e.g., a heating and air conditioning unit, a security system, and small appliances and lighting units, etc.), sensors and controllers for the devices, communication links between the components, and a computer system, which will manage the components.",
    "id": [
      54,
      7,
      16,
      57,
      1,
      56,
      74,
      55,
      9,
      60
    ],
    "example": [
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "The general user is familiar with the layout of his/her home and the location of sensor and control devices (for temperature, for humidity, and for power to small appliances and lighting units).",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "A “Smart House” is a home management system that allows home residents to easily manage their daily lives by providing for a lifestyle that brings together security, environmental and energy management (temperature, humidity and lighting), entertainment, and communications.",
      "Each DigitalHome shall contain a master control device (the DigitalHome Gateway Device) that connects to the home’s broadband Internet connection, and uses wireless communication to send and receive communication between the DigitalHome system and the home devices and systems.",
      "The DigitalHome security system consists of contact sensors and a set security alarms.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "The DigitalHome web server communicates, through a home wireless gateway device, with the sensor and controller devices in the home.",
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA."
    ]
  },
  {
    "text": "Hence, the SRS is not intended as a comprehensive or complete specification of DigitalHome requirements.",
    "id": [
      2,
      177,
      179,
      1144,
      189,
      98,
      164,
      176,
      1157,
      17
    ],
    "example": [
      "The DigitalHome Software Requirements Specification (SRS) is based on the DigitalHome Customer Need Statement.",
      "This is the Software Requirements Specification (SRS) for the \"Space Fractions\" system.",
      "The SRS will include the details of the system's requirements, interface, design issues, and components.",
      "This Software Requirements Specification (SRS) provides the requirements for the Center-to-Center (C2C) Communications Network that is based on a Texas Department of Transportation (TxDOT) C2C project.",
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document.",
      "This Software Requirements Specification (SRS) identifies the requirements for the ASPERA-3 Processing and Archiving Facility (APAF) ground data system for the Mars Express mission.",
      "This section identifies the requirements considered but not part of the APAF ground data system requirements.",
      "There are no requirements of the APAF data system that need special treatment or consideration at this time.",
      "New systems that are deployed (based on the ITS standards) will not utilize the project defined protocol but will be moved “into” the cloud (because they themselves would be based on the ITS standards.",
      "Although the general user is not familiar with the technical features of the DigitalHome system, he/she is familiar with the use of a web interface and can perform simple web operations (logging in and logging out, browsing web pages, and submitting information and requests via a web interface)."
    ]
  },
  {
    "text": "A DigitalHome Technician is specially trained by DigitalHomeOwner to be familiar with the functionality, architecture, and operation of the DigitalHome system product.",
    "id": [
      22,
      21,
      1089,
      23,
      27,
      94,
      29,
      74,
      13,
      193
    ],
    "example": [
      "A DigitalHome Technician has experience with the type of hardware, software, and web services associated with a system like the DigitalHome system.",
      "A DigitalHome Technician is responsible for setting up and maintaining the configuration of a DigitalHome system.",
      "Training software is the software that provides the computer based training functionality for the system operator.",
      "A DigitalHome Technician will have rights beyond the DigitalHome General User, capable of setting up and making changes in the configuration of the system (e.g.,setting system parameters and establishing user accounts), and starting and stopping operation of the DigitalHome System.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "The DigitalHome system will be tested in a simulated environment.",
      "The DigitalHome security system consists of contact sensors and a set security alarms.",
      "The prototype DigitalHome software system will be situated in a simulated environment.",
      "Internet skills that will enable them to use this software."
    ]
  },
  {
    "text": "The “prototype” version of the DigitalHome System (as specified in this document) must be completed within twelve months of inception.",
    "id": [
      163,
      13,
      743,
      4,
      158,
      94,
      742,
      11,
      302,
      27
    ],
    "example": [
      "How the ASPERA-3 and MEX OA data and exactly what data sets are to be distributed to each Co-I shall be determined by the needs and resources available six months prior to MEX launch.",
      "The prototype DigitalHome software system will be situated in a simulated environment.",
      "Initialization of the Tactical Control System HWCIs shall include startup of HWCIs, download of software, startup of CSCIs, execution of Startup FD/L, and establishment of the state of readiness of all interfaces.",
      "This initial version of DigitalHome will be a limited prototype version, which will be used by HomeOwner management to make business decisions about the future commercial development of DigitalHomeOwner products and services.",
      "ASPERA-3 data shall be provided to NASA PDS no later than 6 months after acquisition.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "When executing in the Normal Startup Mode, the Tactical Control System shall provide the system functionality necessary to initialize the system to place it in the Operations State within 60 seconds from the time power is supplied and the Tactical Control System application is launched.",
      "The Digital Home High Level Requirements Definition is intended as a prototype, which will allow business decisions to be made about future development of a commercial product.",
      "This step is crucial for maintaining the quality and integrity of the system content. Once the data passes the validation process, the update for that specific question is finalized.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools."
    ]
  },
  {
    "text": "As part of the final project report the development team will describe their efforts to minimize costs, including price comparisons between DigitalHome elements and comparable/competitive elements.",
    "id": [
      28,
      26,
      4,
      323,
      6,
      94,
      27,
      11,
      672,
      108
    ],
    "example": [
      "Because of potential market competition for DigitalHome products, the cost of DigitalHome elements (sensors, controllers, server, tools, etc.), for this project should be minimized.",
      "The development team will use the development process specified by the Digital HomeOwner Inc.",
      "This initial version of DigitalHome will be a limited prototype version, which will be used by HomeOwner management to make business decisions about the future commercial development of DigitalHomeOwner products and services.",
      "Maintainability is a primary goal for this project.",
      "These document were prepared by the DigitalHomeOwner Division, in consultation with the Marketing Division of HomeOwner Inc.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "The Digital Home High Level Requirements Definition is intended as a prototype, which will allow business decisions to be made about future development of a commercial product.",
      "During Phase 2, Tactical Control System Low Rate Initial Production (LRIP) will commence.",
      "Each of the seven components described above will have an associated Software Design Document (SDD) that will define and fully describe all of the data products contained within each individual virtual instrument."
    ]
  },
  {
    "text": "The home web server will provide storage of DigitalHome plans and data.",
    "id": [
      40,
      39,
      38,
      55,
      9,
      8,
      1205,
      144,
      316,
      7
    ],
    "example": [
      "The home web server will provide ability to establish and maintain DigitalHome User Accounts.",
      "The home web server will provide interaction with and control of the DigitalHome elements.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "The DigitalHome web server communicates, through a home wireless gateway device, with the sensor and controller devices in the home.",
      "The user communicates through a personal web page on the DigitalHome web server or on a local home server.",
      "The Web Map application generates a map that can be displayed on an Internet WWW server.",
      "There shall be a web server for the APAF system for web-based displays and information change.",
      "However, the Space Fractions system will reside on the Internet so more than one user can access the product and download its content for use on their computer.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home."
    ]
  },
  {
    "text": "The home web server will provide backup service for user account information, user plans and a home database.",
    "id": [
      40,
      39,
      38,
      55,
      9,
      8,
      1205,
      295,
      217,
      220
    ],
    "example": [
      "The home web server will provide ability to establish and maintain DigitalHome User Accounts.",
      "The home web server will provide interaction with and control of the DigitalHome elements.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "The DigitalHome web server communicates, through a home wireless gateway device, with the sensor and controller devices in the home.",
      "The user communicates through a personal web page on the DigitalHome web server or on a local home server.",
      "The Web Map application generates a map that can be displayed on an Internet WWW server.",
      "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators.",
      "This information must be saved in a file on the web server where the Space Fractions system is hosted and will be easily edited through simplified administrative screens.",
      "The Space Fractions system will run on any Internet-accessible computer with a web browser that supports "
    ]
  },
  {
    "text": "The thermostat shall provide a reading of the current temperature in the space where the thermostat is located.",
    "id": [
      45,
      46,
      44,
      47,
      63,
      83,
      62,
      60,
      66,
      64
    ],
    "example": [
      "The controller part of thermostat shall provides a “set point” temperature that is used to control the flow of heat energy (by switching heating or cooling devices on or off as needed) to achieve the set point temperature.",
      "The sensor part of the thermostat has a sensitivity range between 14ºF and 104ºF (-10ºC and 40ºC).",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The humidistat shall provide a reading of the current humidity in the space where the humidistat is located.",
      "A single thermostat shall be placed in an enclosed space (e.g., a room in the house) for which the air temperature is to be controlled.",
      "The month report shall contain daily average, maximum (with time) and minimum (with time) values of temperature and humidity for each thermostat and humidistat, respectively.",
      "The thermostats may be controlled individually or collectively, so that temperature can be controlled at different levels in different home spaces.",
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "The system shall support Fahrenheit and Celsius temperature values.",
      "For each thermostat, up to twenty-four one hour settings per day for every day of the week can be scheduled."
    ]
  },
  {
    "text": "The system shall include digital programmable humidistats, which shall be used to monitor and regulate the humidity of an enclosed space.",
    "id": [
      44,
      57,
      48,
      54,
      73,
      47,
      68,
      60,
      75,
      74
    ],
    "example": [
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "The humidistat shall provide a “set point” humidity that is used to control humidifiers and dehumidifiers achieve the set point humidity.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "A DigitalHome system shall use wireless signals to communicate, through the master control unit, with the humidistats.",
      "The humidistat shall provide a reading of the current humidity in the space where the humidistat is located.",
      "A DigitalHome user shall be able to read the humidity at a humidistat position.",
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "A DigitalHome system shall be able to manage up to fifty door and window contact sensors.",
      "The DigitalHome security system consists of contact sensors and a set security alarms."
    ]
  },
  {
    "text": "The system shall include digital programmable power switches which shall be used to monitor the current state of an appliance (e.g., a coffee maker is off or on).",
    "id": [
      51,
      78,
      54,
      57,
      49,
      77,
      606,
      604,
      44,
      60
    ],
    "example": [
      "The system shall be able to use a power switch to change the state of the appliance (e.g., from “off” to “on”).",
      "The system shall be able to provide information about the state of a power switch (OFF or ON), indicating the whether an appliance connected to the power switch is OFF or ON.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "The system shall include magnetic alarm contact switches which shall be used to monitor entry through a door or window when the switch is active.",
      "The Appliance Manager shall be able to manage up to one hundred 115 volt, 10 amp power switches.",
      "Each computer system in the Correlator Monitor and Control System shall have a hardware based watchdog timer configured to reboot the EVLA Correlator Monitor and Control System in the case of a system hang.",
      "The UPS devices need the ability to signal the Correlator Monitor and Control System when a power outage has occurred and keep the Correlator Monitor and Control System apprised of time remaining on backup power.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA."
    ]
  },
  {
    "text": "A DigitalHome user shall be able to read the temperature at a thermostat position.",
    "id": [
      60,
      68,
      44,
      45,
      80,
      54,
      82,
      46,
      57,
      15
    ],
    "example": [
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "A DigitalHome user shall be able to read the humidity at a humidistat position.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The controller part of thermostat shall provides a “set point” temperature that is used to control the flow of heat energy (by switching heating or cooling devices on or off as needed) to achieve the set point temperature.",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices ",
      "The sensor part of the thermostat has a sensitivity range between 14ºF and 104ºF (-10ºC and 40ºC).",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home."
    ]
  },
  {
    "text": "A DigitalHome user shall be able to set the thermostat temperatures to between 60 °F and 80 °F, inclusive, at one degree increments.",
    "id": [
      60,
      45,
      80,
      44,
      68,
      71,
      54,
      82,
      62,
      46
    ],
    "example": [
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "The controller part of thermostat shall provides a “set point” temperature that is used to control the flow of heat energy (by switching heating or cooling devices on or off as needed) to achieve the set point temperature.",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "A DigitalHome user shall be able to read the humidity at a humidistat position.",
      "If a humdistat device allows a user to make a manual temperature setting, the setting shall remain in effect until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices ",
      "The thermostats may be controlled individually or collectively, so that temperature can be controlled at different levels in different home spaces.",
      "The sensor part of the thermostat has a sensitivity range between 14ºF and 104ºF (-10ºC and 40ºC)."
    ]
  },
  {
    "text": "If a thermostat device allows a user to make a manual temperature setting, the setting shall remain in effect until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
    "id": [
      71,
      79,
      45,
      64,
      81,
      80,
      83,
      66,
      44,
      794
    ],
    "example": [
      "If a humdistat device allows a user to make a manual temperature setting, the setting shall remain in effect until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "If a user changes the state of power switch device manually, the device shall remain in that state until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "The controller part of thermostat shall provides a “set point” temperature that is used to control the flow of heat energy (by switching heating or cooling devices on or off as needed) to achieve the set point temperature.",
      "For each thermostat, up to twenty-four one hour settings per day for every day of the week can be scheduled.",
      "For a given month and year, a user shall be able to create or modify a month plan that specifies for each day, for up to four daily time periods, the environmental parameter settings (temperature, humidity, contact sensors and power switches).",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "The month report shall contain daily average, maximum (with time) and minimum (with time) values of temperature and humidity for each thermostat and humidistat, respectively.",
      "The system shall support Fahrenheit and Celsius temperature values.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The Tactical Control System shall allow the operator to set the LOL delay timer(s) during mission planning."
    ]
  },
  {
    "text": "The system shall be compatible with a centralized HVAC (Heating, Ventilation and Air Conditioning) systems: gas, oil, electricity, solar, or a combination of two or more.",
    "id": [
      44,
      57,
      62,
      54,
      45,
      1072,
      1,
      694,
      1113,
      504
    ],
    "example": [
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "The thermostats may be controlled individually or collectively, so that temperature can be controlled at different levels in different home spaces.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "The controller part of thermostat shall provides a “set point” temperature that is used to control the flow of heat energy (by switching heating or cooling devices on or off as needed) to achieve the set point temperature.",
      "The Tactical Control System shall use standard electrical power sources available within the DoD family of ground mobile, airborne, and shipboard electrical power sources.",
      "A “Smart House” is a home management system that allows home residents to easily manage their daily lives by providing for a lifestyle that brings together security, environmental and energy management (temperature, humidity and lighting), entertainment, and communications.",
      "The Tactical Control System hardware must be scaleable or modular to meet varying Service needs.",
      "The Tactical Control System shall facilitate Human-Computer Interfaces (HCIs) that support operation of all system modes, functions, and capabilities.",
      "The core services, support layer and security and access control components can be deployed as standard components with necessary configuration changes."
    ]
  },
  {
    "text": "The DigitalHome programmable humidistat shall allow a user to monitor and control a home’s humidity from any location, using a web ready computer, cell phone, or PDA.",
    "id": [
      60,
      15,
      54,
      7,
      68,
      80,
      55,
      44,
      57,
      38
    ],
    "example": [
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "A DigitalHome user shall be able to read the humidity at a humidistat position.",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer."
    ]
  },
  {
    "text": "A DigitalHome user shall be able to set the humidity level for a humidistat, from 30% to 60%, inclusive a 1% increments.",
    "id": [
      68,
      80,
      48,
      47,
      60,
      81,
      1209,
      82,
      83,
      71
    ],
    "example": [
      "A DigitalHome user shall be able to read the humidity at a humidistat position.",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "The humidistat shall provide a “set point” humidity that is used to control humidifiers and dehumidifiers achieve the set point humidity.",
      "The humidistat shall provide a reading of the current humidity in the space where the humidistat is located.",
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "For a given month and year, a user shall be able to create or modify a month plan that specifies for each day, for up to four daily time periods, the environmental parameter settings (temperature, humidity, contact sensors and power switches).",
      "The map user shall be able to alter the current magnification (zoom level) of the map.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices ",
      "The month report shall contain daily average, maximum (with time) and minimum (with time) values of temperature and humidity for each thermostat and humidistat, respectively.",
      "If a humdistat device allows a user to make a manual temperature setting, the setting shall remain in effect until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period."
    ]
  },
  {
    "text": "A DigitalHome system shall be able to activate both light and sound alarms: one sound alarm and one light alarm subsystem, with multiple lights.",
    "id": [
      50,
      49,
      57,
      74,
      75,
      54,
      73,
      51,
      1107,
      78
    ],
    "example": [
      "The system shall include security sound and light alarms, which can be activated when DigitalHome senses a security breach from a magnetic contact.",
      "The system shall include magnetic alarm contact switches which shall be used to monitor entry through a door or window when the switch is active.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "The DigitalHome security system consists of contact sensors and a set security alarms.",
      "A DigitalHome system shall be able to manage up to fifty door and window contact sensors.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "A DigitalHome system shall use wireless signals to communicate, through the master control unit, with the humidistats.",
      "The system shall be able to use a power switch to change the state of the appliance (e.g., from “off” to “on”).",
      "In addition to displayed alert messages to the Tactical Control System operator, auditory alerts to include tones shall also be provided.",
      "The system shall be able to provide information about the state of a power switch (OFF or ON), indicating the whether an appliance connected to the power switch is OFF or ON."
    ]
  },
  {
    "text": "The DigitalHome programmable Appliance Manager shall provide for management of a home’s small appliances, including lighting units, by allowing a user to turn them on or off as desired.",
    "id": [
      54,
      7,
      80,
      60,
      77,
      51,
      15,
      82,
      16,
      55
    ],
    "example": [
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "The Appliance Manager shall be able to manage up to one hundred 115 volt, 10 amp power switches.",
      "The system shall be able to use a power switch to change the state of the appliance (e.g., from “off” to “on”).",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices ",
      "The general user is familiar with the layout of his/her home and the location of sensor and control devices (for temperature, for humidity, and for power to small appliances and lighting units).",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems."
    ]
  },
  {
    "text": "The system shall be able to change the state of a power switch (OFF to ON, or ON to OFF), in turn changing the state of an appliance connected to the power switch.",
    "id": [
      51,
      78,
      79,
      77,
      49,
      604,
      1007,
      54,
      1030,
      57
    ],
    "example": [
      "The system shall be able to use a power switch to change the state of the appliance (e.g., from “off” to “on”).",
      "The system shall be able to provide information about the state of a power switch (OFF or ON), indicating the whether an appliance connected to the power switch is OFF or ON.",
      "If a user changes the state of power switch device manually, the device shall remain in that state until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "The Appliance Manager shall be able to manage up to one hundred 115 volt, 10 amp power switches.",
      "The system shall include magnetic alarm contact switches which shall be used to monitor entry through a door or window when the switch is active.",
      "The UPS devices need the ability to signal the Correlator Monitor and Control System when a power outage has occurred and keep the Correlator Monitor and Control System apprised of time remaining on backup power.",
      "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "The Tactical Control System shall have an interface to an uninterruptible power supply.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches)."
    ]
  },
  {
    "text": "For a given month and year, in the past two years, DigitalHome shall be able to provide a report on the management and control of the home.",
    "id": [
      15,
      7,
      0,
      80,
      6,
      54,
      55,
      94,
      5,
      25
    ],
    "example": [
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "This document specifies the requirements for the development of a “Smart House”, called DigitalHome (DH), by the DigitalHomeOwner Division of HomeOwner Inc.",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "These document were prepared by the DigitalHomeOwner Division, in consultation with the Marketing Division of HomeOwner Inc.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "There is a supplementary document that provides additional detail and information about the DigitalHome requirements: the Digital Home Use Case Model.",
      "DigitalHomeOwner Director will provide management and communication support."
    ]
  },
  {
    "text": "The month report shall provide the day and time for which any security breaches occurred, that is, when the security alarms were activated.",
    "id": [
      76,
      81,
      83,
      488,
      750,
      862,
      792,
      1097,
      1103,
      50
    ],
    "example": [
      "When a security breach occurs and a contact sensor is set OPEN, the alarm system shall be activated.",
      "For a given month and year, a user shall be able to create or modify a month plan that specifies for each day, for up to four daily time periods, the environmental parameter settings (temperature, humidity, contact sensors and power switches).",
      "The month report shall contain daily average, maximum (with time) and minimum (with time) values of temperature and humidity for each thermostat and humidistat, respectively.",
      "The number of incidents of unplanned downtime for the CCTNS system must not exceed <x> per <rolling three month period>.",
      "The Tactical Control System hardware and software shall execute periodic Fault Detection/Location (FD/L) while in the Normal Operations Mode and Training Mode, to include a periodic determination of level of interaction.",
      "Tactical Control System shall display a LOL timer to the operator initiating a LOL onset.",
      "The Tactical Control System shall notify the operator of all discrepancies found during the mission plan check as well as indicate successful completion of the mission plan check.",
      "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
      "The Tactical Control System operator shall be required to enter an acknowledgment prior to disabling the display of critical warning flags for any AV, Payload, ADT, GDT, and Tactical Control System faults.",
      "The system shall include security sound and light alarms, which can be activated when DigitalHome senses a security breach from a magnetic contact."
    ]
  },
  {
    "text": "The month report shall provide a section that indicates the periods of time when the DigitalHome System was not in operation.",
    "id": [
      488,
      81,
      83,
      858,
      487,
      485,
      1119,
      624,
      738,
      79
    ],
    "example": [
      "The number of incidents of unplanned downtime for the CCTNS system must not exceed <x> per <rolling three month period>.",
      "For a given month and year, a user shall be able to create or modify a month plan that specifies for each day, for up to four daily time periods, the environmental parameter settings (temperature, humidity, contact sensors and power switches).",
      "The month report shall contain daily average, maximum (with time) and minimum (with time) values of temperature and humidity for each thermostat and humidistat, respectively.",
      "When the data link is interrupted, the Tactical Control System shall present the last known AV status values and the time at which the last values were reported.",
      "Unplanned downtime for the CCTNS system must not exceed <xx hours/minutes> per <rolling three month period>.",
      "The planned downtime for the CCTNS system must not exceed <xx> hours per <rolling three month period>.",
      "The shall provide the functionality to have a maximum delay time of 1 second from operator command to system acknowledgement and response.[SSS 559] ",
      "Other message internal time stamps can be used as monitor/control parameters as deemed necessary.",
      "When the Tactical Control System software is halted due to an unplanned power interruption as well as abnormal program termination, then the Tactical Control System shall enter the Recovery Startup Mode upon application of power.",
      "If a user changes the state of power switch device manually, the device shall remain in that state until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period."
    ]
  },
  {
    "text": "Displays of environmental conditions (temperature, humidity, contact sensors and power switches) shall be updated at least every two seconds.",
    "id": [
      44,
      57,
      1098,
      81,
      64,
      83,
      47,
      1134,
      45,
      68
    ],
    "example": [
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "The Tactical Control System shall have monitor(s) that allow reading of displays under direct sunlight and low light level environments.",
      "For a given month and year, a user shall be able to create or modify a month plan that specifies for each day, for up to four daily time periods, the environmental parameter settings (temperature, humidity, contact sensors and power switches).",
      "For each thermostat, up to twenty-four one hour settings per day for every day of the week can be scheduled.",
      "The month report shall contain daily average, maximum (with time) and minimum (with time) values of temperature and humidity for each thermostat and humidistat, respectively.",
      "The humidistat shall provide a reading of the current humidity in the space where the humidistat is located.",
      "The Tactical Control System HCI shall provide for visual Warnings, Cautions, and Advisories to be displayed at or near the center of the field of view, i.e., within a 30o cone, of all monitors in a Tactical Control System system.",
      "The controller part of thermostat shall provides a “set point” temperature that is used to control the flow of heat energy (by switching heating or cooling devices on or off as needed) to achieve the set point temperature.",
      "A DigitalHome user shall be able to read the humidity at a humidistat position."
    ]
  },
  {
    "text": "The Digital Home System shall incorporate backup and recovery mechanisms.",
    "id": [
      7,
      94,
      54,
      88,
      570,
      15,
      55,
      87,
      38,
      56
    ],
    "example": [
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "If the DigitalHome System fails (due to power loss, loss of internet access, or other software or hardware failure), the system recovery mechanism shall restore system data (configuration, default parameter settings, planning, and usage data) from the most recent backup.",
      "The ability to attempt recovery from failure or hot-swapped hardware devices will be built into this system.",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "The DigitalHome System will backup all system data (configuration, default parameter settings, planning, and usage data) on a daily basis, with the backup time set by the DigitalHome Technician at system set up.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer.",
      "Each DigitalHome shall contain a master control device (the DigitalHome Gateway Device) that connects to the home’s broadband Internet connection, and uses wireless communication to send and receive communication between the DigitalHome system and the home devices and systems."
    ]
  },
  {
    "text": "The DigitalHome web system shall provide for authentication and information encryption through a recognized reliable and effective security technology, such as Transport Layer Security.",
    "id": [
      526,
      531,
      532,
      530,
      74,
      566,
      523,
      50,
      522,
      521
    ],
    "example": [
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The DigitalHome security system consists of contact sensors and a set security alarms.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
      "The CCTNS system should support secure virtual private network connections ",
      "The system shall include security sound and light alarms, which can be activated when DigitalHome senses a security breach from a magnetic contact.",
      "The CCTNS system should support SSL encrypted connections ",
      "The CCTNS system should support multi-tier authentication where required "
    ]
  },
  {
    "text": "Although the product produced under this document will be a “prototype” version, all modules and components of this prototype version shall be designed and implemented in such a manner that it may be incorporated in a fully specified commercial version of the DigitalHome System.",
    "id": [
      11,
      4,
      27,
      13,
      108,
      688,
      639,
      1082,
      682,
      132
    ],
    "example": [
      "The Digital Home High Level Requirements Definition is intended as a prototype, which will allow business decisions to be made about future development of a commercial product.",
      "This initial version of DigitalHome will be a limited prototype version, which will be used by HomeOwner management to make business decisions about the future commercial development of DigitalHomeOwner products and services.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "The prototype DigitalHome software system will be situated in a simulated environment.",
      "Each of the seven components described above will have an associated Software Design Document (SDD) that will define and fully describe all of the data products contained within each individual virtual instrument.",
      "Software developed will be Defense Information Infrastructure / Common Operating Environment (DII/COE) compliant, non-proprietary, and the architectural standard for all future tactical UAVs.",
      "Operating system software shall either have source code available or come with sufficient diagnostics and customer support.",
      "The Tactical Control System core software shall be generically written to provide level one through level five interaction for both Outrider and Predator UAVs and establish the architecture for future tactical UAVs.",
      "Although developed as a total package, the Tactical Control System will be scaleable to meet the user's requirements for deployment.",
      "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the internal interfaces."
    ]
  },
  {
    "text": "Section 2 is an overview of the descriptions of requirement determination, qualification procedures, rationale, and traceability that are used in the identification and the definitions of the requirements.",
    "id": [
      52,
      545,
      186,
      1163,
      1160,
      187,
      112,
      185,
      184,
      148
    ],
    "example": [
      "This section provides a description of the functional requirements.",
      "The requirements contained in this document are numbered based on the section/subsection in which they appear.",
      "Section two is a general description of the product requirements from a user's perspective.",
      "The Requirement Category Mnemonic is a two-letter mnemonic for each functional area.",
      "Requirements are listed in separate sections and in table format for each functional area.",
      "This section includes information such as functional and data requirements, general constraints, and assumptions.",
      "Section 4 contains general information to aid in the understanding of this specification.",
      "The definitions section is intended to assist the technical designers as well as the client in clarifying the terms used throughout the document.",
      "Section one is a brief overview of the product, including definitions and references.",
      "The mnemonic, LR, is used in the requirement identifiers to show that these requirements are Logistical "
    ]
  },
  {
    "text": "The mnemonic, PR, is used in the requirement identifier to show that this requirement is a Privacy Requirement.",
    "id": [
      116,
      152,
      148,
      141,
      137,
      377,
      113,
      650,
      189,
      654
    ],
    "example": [
      "The mnemonic, FR, is used in the requirement identifiers to show that these requirements are Functional Requirements unless otherwise specified.",
      "The mnemonic, DR, is used in the requirement identifiers to show that these requirements are Delivery Requirements.",
      "The mnemonic, LR, is used in the requirement identifiers to show that these requirements are Logistical ",
      "The mnemonic, CR, is used in the requirement identifiers to show that these requirements are Computer resource Requirements.",
      "The requirement associated with the privacy of the APAF ground data system is in the table below.",
      "The requirements specify the requirements to control the user access to correspondences, files, and records and various functionalities provided within the CCTNS system.",
      "Each requirement shall be: assigned a project-unique identifier.",
      "Development, testing and maintenance personnel, on the other hand, require access to some parts of the EVLA Correlator Monitor and Control System, but not all, indicating that an access level is needed that allows privileges to be granted on a per-user and what-do-you-need-to-do basis.",
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document.",
      "Each user shall have a set of system access properties that defines the user’s privileges within the EVLA Correlator Monitor and Control System."
    ]
  },
  {
    "text": "ASPERA-3 IDFS data that are electronically distributed shall be provided to the ASPERA-3 Co-I’s within 24 hours of acquiring ASPERA-3 telemetry as long as the transmission and processing are error-free to support the ASPERA-3 team in meeting MEX mission goals and objectives ",
    "id": [
      154,
      153,
      128,
      123,
      104,
      117,
      129,
      161,
      130,
      121
    ],
    "example": [
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry that are electronically distributed shall be provided to the ASPERA-3 Co-I’s within 24 hours of acquiring ASPERA-3 and MEX OA telemetry as long as the transmission and processing are error-free to support the ASPERA-3 team in meeting MEX mission goals and objectives.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I's.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I’s.",
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be stored on a local SwRI archive for data availability and re-processing, and to support the ASPERA-3 team.",
      "The APAF data system acquires the telemetry data via NISN, processes the data into IDFS data sets, distributes the IDFS data sets to the ASPERA-3 team, provides web-based displays of the most current data for public view, stores the telemetry and IDFS data sets on a local SwRI archive, and submits the ASPERA-3 IDFS data sets to PDS for long-term archival.",
      "The APAF system shall acquire from ESOC the telemetry data of the ASPERA-3 Experiment and Mars Express Orbit/Attitude to automatically process the data on a daily basis.",
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "The ASPERA-3 and MEX OA telemetry data shall be stored on a local SwRI archive for data availability and re-processing."
    ]
  },
  {
    "text": "MEX OA IDFS data that are electronically distributed shall be provided to the ASPERA-3 Co-I’s within 24 hours of acquiring MEX OA telemetry as long as the transmission and processing are error-free to support the ASPERA-3 team in meeting MEX mission goals and objectives.",
    "id": [
      154,
      153,
      128,
      123,
      117,
      104,
      121,
      903,
      129,
      161
    ],
    "example": [
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry that are electronically distributed shall be provided to the ASPERA-3 Co-I’s within 24 hours of acquiring ASPERA-3 and MEX OA telemetry as long as the transmission and processing are error-free to support the ASPERA-3 team in meeting MEX mission goals and objectives.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I's.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I’s.",
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be stored on a local SwRI archive for data availability and re-processing, and to support the ASPERA-3 team.",
      "The APAF system shall acquire from ESOC the telemetry data of the ASPERA-3 Experiment and Mars Express Orbit/Attitude to automatically process the data on a daily basis.",
      "The APAF data system acquires the telemetry data via NISN, processes the data into IDFS data sets, distributes the IDFS data sets to the ASPERA-3 team, provides web-based displays of the most current data for public view, stores the telemetry and IDFS data sets on a local SwRI archive, and submits the ASPERA-3 IDFS data sets to PDS for long-term archival.",
      "The ASPERA-3 and MEX OA telemetry data shall be stored on a local SwRI archive for data availability and re-processing.",
      "The NITF 2.0 imagery files generated by the Tactical Control System shall contain the necessary telemetry and support data to permit subsequent imagery exploitation by C4I systems.",
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives."
    ]
  },
  {
    "text": "The distribution mechanisms shall be clearly defined/described in the APAF Operation Procedures Document.",
    "id": [
      543,
      175,
      167,
      776,
      173,
      1067,
      727,
      114,
      789,
      1056
    ],
    "example": [
      "The primary goal of this document is to provide a complete and accurate list of requirements for the VLA Expansion Project Correlator Monitor and Control System.",
      "In addition, the APAF Operations Procedures Document shall provide installation and operations procedures of the APAF system in enough detail where there are no training-related requirements for users and operators of the APAF data system.",
      "However, if any are identified, they shall be documented in the APAF Operations Procedures Document.",
      "The Tactical Control System Mission plan shall include all necessary information required to be interoperable with the service specific mission planning systems including the Tactical Aircraft Mission Planning System (TAMPS), Aviation Mission Planning System (AMPS), and Air Force Mission Support System (AFMSS).",
      "However, the APAF Operations Procedures Document will aid personnel in the operational use of the APAF system.",
      "The Tactical Control System shall conform with the National Institute for Standard Technology (NIST) Federal Information Processing Standard (FIPS) Publication 151-2 (POSIX.1).",
      "The Tactical Control System shall meet the applicable capability and characteristic criteria established by the Operational Requirements Document (ORD) CAF 003-90-I-A for the RQ-1A Predator Medium Altitude Endurance Unmanned Aerial Vehicle/System (MAE UAV) and the Close Range – Tactical Unmanned Aerial Vehicle (CR-TUAV).",
      "The APAF ground data system requirements are categorized according to functional areas and are defined in the following sections in table format.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall be approved for operation at the same level as the systems with which it interfaces."
    ]
  },
  {
    "text": "There are no identified requirements related to personnel that will use the software.",
    "id": [
      174,
      172,
      166,
      135,
      170,
      643,
      1088,
      176,
      208,
      164
    ],
    "example": [
      "Since the members of the SwRI software team are experienced with data system and IDFS processing software development, there are no training-related requirements for developers of the APAF data system.",
      "There are no requirements that constrain the design and implementation of the APAF software.",
      "There are no installation-dependent requirements for the operation of the APAF data system.",
      "There are no security requirements associated with the APAF ground data system.",
      "Although the APAF data system and associated software will be developed with the highest quality possible, there are no requirements concerned with software quality.",
      "Authorized users are expected to be restricted to software and hardware development, testing, maintenance and operations personnel.",
      "Training software shall be alterable without affecting the configuration of the operational software.",
      "There are no requirements of the APAF data system that need special treatment or consideration at this time.",
      "The Space Fractions system will not be dependent on any other software and is not a component of another program.",
      "This section identifies the requirements considered but not part of the APAF ground data system requirements."
    ]
  },
  {
    "text": "The product will be a web-based, interactive system.",
    "id": [
      1242,
      39,
      1205,
      1156,
      295,
      38,
      55,
      144,
      13,
      220
    ],
    "example": [
      "The web server application shall use ESRI's ARC Internet Map Server (ARC IMS) product for creating of map images.",
      "The home web server will provide interaction with and control of the DigitalHome elements.",
      "The Web Map application generates a map that can be displayed on an Internet WWW server.",
      "Systems will interface to the “cloud” using a project defined protocol.",
      "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "There shall be a web server for the APAF system for web-based displays and information change.",
      "The prototype DigitalHome software system will be situated in a simulated environment.",
      "The Space Fractions system will run on any Internet-accessible computer with a web browser that supports "
    ]
  },
  {
    "text": "We are also providing an umbrella for the past systems created.",
    "id": [
      423,
      212,
      143,
      182,
      1150,
      33,
      362,
      513,
      144,
      379
    ],
    "example": [
      "This encompasses being able to present content containing newer technologies by older user agents as well as designing content to be usable with future technologies.",
      "The umbrella will be a singular component, providing links to projects relating to fractions, decimals, and percents in a format accessible over the World Wide Web.",
      "There shall be a UNIX-based APAF system production computer with an archival system.",
      "The umbrella will be a web-based menu system allowing the user to choose between the systems.",
      "In order to create the Center-to-Center infrastructure, interfaces to the existing systems will be created.",
      "Although the system to be developed is a “proof of concept” system intended to help Homeowner Inc.",
      "This includes actions taken by users or Administrators, or actions initiated automatically by the CCTNS system as a result of system parameters.",
      "The CCTNS system should be developed for a centralized deployment and maintenance ",
      "There shall be a web server for the APAF system for web-based displays and information change.",
      "The CCTNS system should provide for role-based control for the functionality within the CCTNS system "
    ]
  },
  {
    "text": "Bobby has used computers since age five.",
    "id": [
      200,
      201,
      199,
      202,
      203,
      140,
      227,
      237,
      205,
      180
    ],
    "example": [
      "Bobby enjoys playing competitive sports and using computers, especially to play systems.",
      "Bobby particularly likes to play systems where Bobby can excel.",
      "Bobby is a sixth grade male student learning fractions who is very competitive.",
      "Bobby is only somewhat interested in learning about fractions.",
      "Claire is a sixth grade teacher who has computer skills.",
      "Computer resources include computer hardware, computer software, and computer communication.",
      "The information and interface will be effective so that Bobby will easily recognize what to do to start the system immediately and Alice will have no problems navigating through the help section to understand the rules and systemplay.",
      "This gives Bobby the competition he requires and allows Alice to have a unique experience the next time through the program.",
      "Claire has been teaching the sixth grade for six years now.",
      "The Space Fractions system is a learning tool created to help improve fraction-solving skills for sixth-grade students."
    ]
  },
  {
    "text": "The Space Fractions system will have an introductory movie to set up the storyline.",
    "id": [
      221,
      317,
      254,
      213,
      223,
      242,
      270,
      262,
      251,
      280
    ],
    "example": [
      "Upon starting the Space Fractions system, the user is taken through a brief introductory movie to provide background story and information that will help them complete the fraction questions.",
      "The Space Fractions system will consist of Flash movies linked together to form a web-based system: there will be a small introductory movie (~200KB), a main menu movie (~100KB), and a main system movie (1-2MB).",
      "The introductory movie serves to immerse players into the game's universe, setting the stage for the storyline and providing critical information to assist users in solving fraction-related puzzles.",
      "The Space Fractions system will have a series of fraction questions (testing arithmetic, equivalence, graphical interpretation, and improper versus proper fraction skills) that sequentially form a storyline related to the introduction.",
      "Otherwise, they will watch the movie to its completion and be taken to the main screen.",
      "The purpose of the Space Fractions system is to process player inputs during gameplay, specifically for calculating spaceship velocity adjustments based on fraction inputs. ",
      "If the player opts to start the Space Fractions system, the system transitions to the game sequence, where gameplay begins immediately. ",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "This adjusted velocity is applied to the game's physics engine to update the spaceship's speed in real-time.",
      "The system sequence includes \"critical points\" where the storyline can diverge based on whether the player answers these pivotal questions correctly, adding an element of narrative depth and personalization to the gameplay experience."
    ]
  },
  {
    "text": "The Space Fractions system will have a main menu, including a brief help section.",
    "id": [
      317,
      224,
      215,
      221,
      263,
      216,
      241,
      226,
      184,
      262
    ],
    "example": [
      "The Space Fractions system will consist of Flash movies linked together to form a web-based system: there will be a small introductory movie (~200KB), a main menu movie (~100KB), and a main system movie (1-2MB).",
      "At the main title screen, the user will be able to view a general help screen to reveal basic instructions on system play.",
      "In addition, a component accessible over the World Wide Web will allow the series of fraction questions to be updated by an administrator of the Space Fractions system.",
      "Upon starting the Space Fractions system, the user is taken through a brief introductory movie to provide background story and information that will help them complete the fraction questions.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "The administrator of the Space Fractions system may wish to design a custom system complete with custom fraction questions.",
      "The following table summarizes the external interface requirements for the Space Fractions system.",
      "To start the Space Fractions system, the user will click on the corresponding button.",
      "Section one is a brief overview of the product, including definitions and references.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings."
    ]
  },
  {
    "text": "Input will consist entirely of mouse clicks for the user to choose answer options and to set preferences.",
    "id": [
      256,
      288,
      231,
      269,
      244,
      267,
      259,
      889,
      226,
      268
    ],
    "example": [
      "The primary input for this component is the user's interaction in the form of a mouse click. ",
      "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
      "The user will be given a problem and then must click the correct solution.",
      "The output of interacting with the main menu is determined by the player's choice.",
      "The inputs will consist of fractions entered by the player using the game's interface. ",
      "The system remains in a passive listening state until an input is received in the form of a mouse click on one of the menu options.",
      "The system continuously listens for a mouse click event during the playback.",
      "The operator shall be able to manually override the automatic function selection of the selected data terminal, if desired.",
      "To start the Space Fractions system, the user will click on the corresponding button.",
      "This decision-making process ensures that the player's intent is accurately interpreted and the corresponding action is taken swiftly, maintaining a seamless transition from the menu to the player's selected activity."
    ]
  },
  {
    "text": "After the last question, the main character's adventure will come to an end.",
    "id": [
      235,
      285,
      281,
      214,
      294,
      291,
      293,
      287,
      262,
      280
    ],
    "example": [
      "The last scene will be determined by the user's response on certain critical questions that impact the story's plot, and an option to try again will be presented.",
      "The ending scene serves as the culmination of the player's journey through the system, providing a conclusion to the storyline that reflects their performance across critical decision points. ",
      "After completing a predetermined set of questions, the player is directed to the concluding scene of the game, providing closure to the educational journey.",
      "The Space Fractions system will have an ending scene where the user's score is calculated and ranked, with an option to quit the system or try again.",
      "Furthermore, this component offers a clear and direct pathway for the player to either revisit the game's content through the main menu or gracefully exit the game, thereby closing their current session.",
      "The primary outputs of the ending scene include the display of the player's total score accumulated throughout the system and a tailored narrative conclusion.",
      "The dynamic nature of the conclusion serves to emphasize the educational progress and decisions of the player, offering a personalized ending that varies from one session to another based on the player's performance.",
      "Additionally, it presents players with the option to either conclude their current session or navigate back to the main menu for further exploration or replay.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "The system sequence includes \"critical points\" where the storyline can diverge based on whether the player answers these pivotal questions correctly, adding an element of narrative depth and personalization to the gameplay experience."
    ]
  },
  {
    "text": "Upon correct submission of her password, she uses an intuitive web forms interface to update the system to her desiring.",
    "id": [
      240,
      19,
      1228,
      356,
      295,
      40,
      92,
      300,
      239,
      8
    ],
    "example": [
      "She navigates to the updater page, which asks for a password.",
      "For example, a Master User shall be able to add a user account or change the default parameter settings.",
      "When the GUI application is initiated, the user shall be prompted for the following information, including User name and Password.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators.",
      "The home web server will provide ability to establish and maintain DigitalHome User Accounts.",
      "Upon installation, a DigitalHome user account shall be established.",
      "Upon the completion of data entry for a question, the administrator will use a submission button to initiate the update process.",
      "As the system administrator, Claire can use the question updater to change any of the questions in the system.",
      "The user communicates through a personal web page on the DigitalHome web server or on a local home server."
    ]
  },
  {
    "text": "The output of this functional requirement is the visual and auditory presentation of the movie on the player's screen.",
    "id": [
      1022,
      219,
      223,
      262,
      1108,
      258,
      433,
      1107,
      254,
      291
    ],
    "example": [
      "An RS-170A video interface shall be provided for the system to output and input analog imagery and overlays to and from a Video Cassette Recorder (VCR) for recording and playback.",
      "Output will be sounds and animations through Flash movies to acknowledge success or failure in answering the fraction questions.",
      "Otherwise, they will watch the movie to its completion and be taken to the main screen.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "The volume of these auditory tones shall be adjustable by the operator via keyboard and trackball input to at least 20dB above the speech interference level at the operator’s ear.",
      "As soon as the player enters the introductory movie component, the movie begins to play automatically.",
      "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points.",
      "In addition to displayed alert messages to the Tactical Control System operator, auditory alerts to include tones shall also be provided.",
      "The introductory movie serves to immerse players into the game's universe, setting the stage for the storyline and providing critical information to assist users in solving fraction-related puzzles.",
      "The primary outputs of the ending scene include the display of the player's total score accumulated throughout the system and a tailored narrative conclusion."
    ]
  },
  {
    "text": "It offers a concise help section that guides players on how to engage with the game effectively and also includes links to both the primary game component and an external educational resource, the Denominators' web page.",
    "id": [
      266,
      296,
      224,
      264,
      305,
      263,
      307,
      360,
      442,
      471
    ],
    "example": [
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "Its primary function is to facilitate the updating and editing of questions within the system sequence, ensuring that the game's educational content remains current, accurate, and engaging for players. By providing an easy-to-use interface for content modification, this tool supports the game's adaptability and longevity in educational settings.",
      "At the main title screen, the user will be able to view a general help screen to reveal basic instructions on system play.",
      "This menu aims to equip players with the necessary knowledge to start playing and offer additional learning resources, thereby enriching the overall game experience.",
      "The Math Umbrella component is designed to serve as an educational resource hub within the system, providing players with easy access to a curated selection of external S2S projects that are specifically tailored to sixth graders. ",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "This component aims to extend the educational value of the system by integrating additional, topic-relevant resources that support and deepen the player's understanding of mathematics.",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "Linking back to the home page or landmark pages: Each page should contain a link leading to the home page of the application or to a landmark page that is easy to recognize for the user."
    ]
  },
  {
    "text": "Players interact with the main menu through mouse clicks on specific buttons.",
    "id": [
      288,
      269,
      265,
      263,
      256,
      266,
      287,
      262,
      224,
      246
    ],
    "example": [
      "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
      "The output of interacting with the main menu is determined by the player's choice.",
      "One button initiates the game, leading players directly into the gameplay experience.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "The primary input for this component is the user's interaction in the form of a mouse click. ",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "Additionally, it presents players with the option to either conclude their current session or navigate back to the main menu for further exploration or replay.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "At the main title screen, the user will be able to view a general help screen to reveal basic instructions on system play.",
      "The source of these inputs is the player's interaction with the game's user interface during specific gameplay moments that require velocity adjustment."
    ]
  },
  {
    "text": "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page.",
    "id": [
      271,
      234,
      269,
      288,
      287,
      266,
      246,
      362,
      262,
      263
    ],
    "example": [
      "Alternatively, if the player selects the option to visit the Denominators' web page, the system facilitates this redirection, opening the web page either within the game environment or in a separate browser window, depending on the game's design and platform capabilities.",
      "The systemplay will be dynamic and adaptive to provide different storylines based on the user's progress.",
      "The output of interacting with the main menu is determined by the player's choice.",
      "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
      "Additionally, it presents players with the option to either conclude their current session or navigate back to the main menu for further exploration or replay.",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "The source of these inputs is the player's interaction with the game's user interface during specific gameplay moments that require velocity adjustment.",
      "This includes actions taken by users or Administrators, or actions initiated automatically by the CCTNS system as a result of system parameters.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. "
    ]
  },
  {
    "text": "Upon reaching the ending scene, the system momentarily pauses to allow the player to make their choice between continuing their exploration of the game's content by returning to the main menu or concluding their session by exiting the game.",
    "id": [
      287,
      294,
      262,
      288,
      257,
      260,
      214,
      235,
      311,
      263
    ],
    "example": [
      "Additionally, it presents players with the option to either conclude their current session or navigate back to the main menu for further exploration or replay.",
      "Furthermore, this component offers a clear and direct pathway for the player to either revisit the game's content through the main menu or gracefully exit the game, thereby closing their current session.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
      "This action allows players the option to skip the introductory movie at any point, facilitating a direct transition to the main menu of the game for those who prefer to dive straight into gameplay or who are revisiting the game and already familiar with its storyline.",
      "If a click is detected, the movie is immediately terminated, and the system transitions the user to the game's main menu, bypassing the rest of the movie. If no click is registered, the movie plays in its entirety, after which the Space Fractions system automatically proceeds to the main menu.",
      "The Space Fractions system will have an ending scene where the user's score is calculated and ranked, with an option to quit the system or try again.",
      "The last scene will be determined by the user's response on certain critical questions that impact the story's plot, and an option to try again will be presented.",
      "Upon the player's selection of a link, the Math Umbrella component momentarily pauses to process this action.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. "
    ]
  },
  {
    "text": "This process is designed to be straightforward and user-friendly, ensuring a smooth transition to the player's chosen next step.",
    "id": [
      268,
      289,
      312,
      277,
      261,
      296,
      304,
      299,
      586,
      1248
    ],
    "example": [
      "This decision-making process ensures that the player's intent is accurately interpreted and the corresponding action is taken swiftly, maintaining a seamless transition from the menu to the player's selected activity.",
      "This simple, intuitive input method ensures that players of all ages and skill levels can easily make their selection without confusion or frustration.",
      "This ensures a smooth transition from the system to the external educational content, without disrupting the user's engagement or learning experience.",
      "This method ensures a straightforward and accessible approach for users to demonstrate their understanding and apply their knowledge of fractions.",
      "This process ensures a seamless experience, whether the player chooses to watch the movie or skip it.",
      "Its primary function is to facilitate the updating and editing of questions within the system sequence, ensuring that the game's educational content remains current, accurate, and engaging for players. By providing an easy-to-use interface for content modification, this tool supports the game's adaptability and longevity in educational settings.",
      "This system allows for real-time updates to the game's content without the need for system restarts or interruptions, enabling a seamless integration of new or revised educational material into the game sequence.",
      "Each question is managed on a separate page within the tool, and navigation between questions is streamlined through the use of a button to progress from one question to the next, ensuring a smooth and organized content update process.",
      "The ultimate ease of use and flexibility of the correlator is rooted in the Correlator Monitor and Control System software.",
      "The Center-to-Center shall be able to operate in normal mode."
    ]
  },
  {
    "text": "The successful update of a question results in the generation of a text file on the system server.",
    "id": [
      300,
      295,
      240,
      303,
      217,
      299,
      356,
      1239,
      431,
      1151
    ],
    "example": [
      "Upon the completion of data entry for a question, the administrator will use a submission button to initiate the update process.",
      "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators.",
      "She navigates to the updater page, which asks for a password.",
      "This file contains the updated question data, structured in a format that the system sequence can dynamically read and incorporate into the gameplay.",
      "This information must be saved in a file on the web server where the Space Fractions system is hosted and will be easily edited through simplified administrative screens.",
      "Each question is managed on a separate page within the tool, and navigation between questions is streamlined through the use of a button to progress from one question to the next, ensuring a smooth and organized content update process.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "For each device command/control status request sent by the Remote GUI, the status returned from the network identifier will be displayed in a scrollable list on the GUI.",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "The data from these interfaces will communicate with the existing system in a “system specific” format."
    ]
  },
  {
    "text": "The system is designed to detect and respond to the player's choice by initiating the process to open the selected S2S project.",
    "id": [
      271,
      310,
      295,
      263,
      92,
      356,
      231,
      18,
      290,
      38
    ],
    "example": [
      "Alternatively, if the player selects the option to visit the Denominators' web page, the system facilitates this redirection, opening the web page either within the game environment or in a separate browser window, depending on the game's design and platform capabilities.",
      "Each link corresponds to a different S2S project, allowing players to choose which external resources they wish to explore based on their interests or areas where they seek further understanding.",
      "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "Upon installation, a DigitalHome user account shall be established.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The user will be given a problem and then must click the correct solution.",
      "A Master user will be designated, who shall be able to change the configuration of the system.",
      "The component actively listens for the player's input and, upon selection, proceeds according to the player's decision.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer."
    ]
  },
  {
    "text": "This functionality facilitates a seamless integration of supplemental educational resources, ensuring that players have the opportunity to engage with a broader range of topics and materials at their own pace.",
    "id": [
      296,
      312,
      304,
      307,
      289,
      264,
      305,
      272,
      255,
      277
    ],
    "example": [
      "Its primary function is to facilitate the updating and editing of questions within the system sequence, ensuring that the game's educational content remains current, accurate, and engaging for players. By providing an easy-to-use interface for content modification, this tool supports the game's adaptability and longevity in educational settings.",
      "This ensures a smooth transition from the system to the external educational content, without disrupting the user's engagement or learning experience.",
      "This system allows for real-time updates to the game's content without the need for system restarts or interruptions, enabling a seamless integration of new or revised educational material into the game sequence.",
      "This component aims to extend the educational value of the system by integrating additional, topic-relevant resources that support and deepen the player's understanding of mathematics.",
      "This simple, intuitive input method ensures that players of all ages and skill levels can easily make their selection without confusion or frustration.",
      "This menu aims to equip players with the necessary knowledge to start playing and offer additional learning resources, thereby enriching the overall game experience.",
      "The Math Umbrella component is designed to serve as an educational resource hub within the system, providing players with easy access to a curated selection of external S2S projects that are specifically tailored to sixth graders. ",
      "This dual-path output allows for a customized experience that caters to the player's immediate preference, whether it be diving into the game or seeking additional information and resources.",
      "This engaging start is designed to enhance understanding and interest in the game's educational objectives.",
      "This method ensures a straightforward and accessible approach for users to demonstrate their understanding and apply their knowledge of fractions."
    ]
  },
  {
    "text": "Interfacing with the courts during the prosecution of cases is an integral part of the responsibilities of police personnel.",
    "id": [
      339,
      334,
      350,
      337,
      336,
      335,
      341,
      342,
      331,
      347
    ],
    "example": [
      "A designated constable from each police station constantly interfaces with the courts.",
      "The functionality of the CCTNS application is focused on providing value to the police personnel, especially the officers operating at the cutting edge and easing the day to day operations of the police function.",
      "It shows information such as cases assigned, alerts, pending tasks etc hence helping police personnel to plan better and execute with greater efficiency.",
      "After a complaint is initiated, police initiates the investigation process.",
      "The Registration module acts as an interface between the police and citizens and it eases the approach, interaction and information exchange between police and complainants.",
      "Citizens can register their complaints with police and then based on the evidence, facts and following investigation, police shall take the complaint forward.",
      "The Search module of the CCTNS gives police personnel the ability to execute a basic or advanced search on cases.",
      "Using the search functionality, police personnel can search for a particular person, type of crime, modus operandi, property etc.",
      "The key guiding principle behind the functional design of CCTNS V1.0 is to focus on the critical functionality that provides value to the police personnel at the cutting edge which in turn can improve the outcomes in the areas of “Investigation of Crime” and “Detection of Criminals”.",
      "The police in turn can use it to respond to citizens with very little turnaround time."
    ]
  },
  {
    "text": "The non-functional requirements specify the qualitative attributes such as user-friendliness and performance of the CCTNS system that are critical for the increased user-acceptance of the application.",
    "id": [
      393,
      476,
      518,
      360,
      397,
      535,
      477,
      391,
      356,
      512
    ],
    "example": [
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "User adaptation can also be important for making the user interface more accessible.",
      "The CCTNS system should be designed for access through browser-based systems and must impose minimal requirements on the client device ",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "The CCTNS system should ensure high scalability and performance through using of AJAX based technology to improve user experience.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "The CCTNS system must employ a single set of user interface rules, or a small number of sets to provide a familiar and common look and feel for the application.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The CCTNS system should be built on a common User Access and Authentication Service to ensure Single-Sign on for the end-user "
    ]
  },
  {
    "text": "These options are presented in order of increasing security.",
    "id": [
      813,
      739,
      409,
      1064,
      415,
      1048,
      1000,
      837,
      785,
      1080
    ],
    "example": [
      "The Tactical Control System shall provide the capability to modify the maximum number of threats displayed, when de-clutter is selected.",
      "During startup, the Tactical Control System shall determine which of the 5 levels of interaction are achievable by the Tactical Control System configuration.",
      "Offering alternative access paths: Alternative access paths for navigating to a specific unit of content should be offered to support different navigation strategies.",
      "The hardware of the Tactical Control System shall be capable of being scaled as well as being modular to meet the varying needs of the Services.",
      "They can superimpose the primary window, hiding relevant information.",
      "Risk levels and a program to manage the probability and severity of hazards shall also be developed.",
      "The Tactical Control System shall have provisions for simultaneously supporting both of the following external interfaces: ",
      "The Tactical Control System shall provide the capability to enter AV preset limits which, as a minimum, will include airspeed limits, altitude limits, and fuel limits.",
      "As an objective, the Tactical Control System shall have the capability to import as well as create and modify map display overlays for fire support coordination measures [SSS547], airspace control measures [SSS548], and threat identification measures.",
      "The Tactical Control System shall provide an open software architecture to be capable of supporting additional CSCIs, CSCs, and CSUs for future AVs, future payloads, and payload capabilities (e.g."
    ]
  },
  {
    "text": "The interfaces must be made customizable or user-configurable to the extent possible.(e.g., the displayed columns in the table, move, resize, modify the appearance).",
    "id": [
      398,
      397,
      1153,
      477,
      476,
      420,
      564,
      399,
      393,
      430
    ],
    "example": [
      "Customisation should include, but need not be limited to the following changes: menu contents; layout of screens; use of function keys; on-screen colours, fonts and font sizes; ",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "These building blocks allow the software to be utilized in a number of configurations (by simply altering the configuration parameters of the software).",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "User adaptation can also be important for making the user interface more accessible.",
      "Designing for input device independence: User interfaces should be designed to allow activation of controls by a variety of input devices.",
      "The translation will provide the correlator with specific goal oriented hardware configuration tables to satisfy the configuration requested by the A second interface with a human GUI will also allow for configuration of the correlator hardware, preferably through the same table structures used above.",
      "The user interfaces should be designed to make them user-intuitive.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "Using appropriate formats, units of measurement or currency: When designing user interfaces for use by diverse groups, input and output of information elements such as currency, units of measurement, temperatures, date and time, phone numbers, address or postal codes should be designed so that they are usable."
    ]
  },
  {
    "text": "Such configurations must be saved in the user profile.",
    "id": [
      481,
      217,
      356,
      482,
      209,
      19,
      397,
      393,
      358,
      82
    ],
    "example": [
      "Making user profiles evident: If predefined user profiles or user-specified profiles are used for individualizing or adapting content, the profile currently used should be made evident.",
      "This information must be saved in a file on the web server where the Space Fractions system is hosted and will be easily edited through simplified administrative screens.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "If profiles are used, it is important to provide users with information about this concept and its implications.",
      "Since the Space Fractions system requires a Flash-supporting browser, the external interface will depend on the configuration of the browser.",
      "For example, a Master User shall be able to add a user account or change the default parameter settings.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "The solution should enable the user to track the submitted defect or enhancement request.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices "
    ]
  },
  {
    "text": "The CCTNS system must provide End User and Administrator functions which are easy to use and intuitive throughout.",
    "id": [
      509,
      512,
      508,
      393,
      391,
      586,
      518,
      516,
      552,
      397
    ],
    "example": [
      "The CCTNS system should work even in an offline mode with the critical functionality ",
      "The CCTNS system should be built on a common User Access and Authentication Service to ensure Single-Sign on for the end-user ",
      "The CCTNS system should support multilingual interface ",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "The CCTNS system must employ a single set of user interface rules, or a small number of sets to provide a familiar and common look and feel for the application.",
      "The ultimate ease of use and flexibility of the correlator is rooted in the Correlator Monitor and Control System software.",
      "The CCTNS system should be designed for access through browser-based systems and must impose minimal requirements on the client device ",
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "The Correlator Monitor and Control System shall allow for easy system access to aid testing and debugging.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it."
    ]
  },
  {
    "text": "Application user interfaces to meet its requirements and recommendations.",
    "id": [
      403,
      360,
      354,
      355,
      393,
      477,
      424,
      356,
      576,
      295
    ],
    "example": [
      "User interfaces should meet its requirements and recommendations.",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
      "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
      "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "Acceptable opening / download times: Application pages should be designed and implemented so that there are acceptable opening times and download times for the expected range of technical contexts of use (e.g.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "Software tools will be provided to assist the user at all access levels from system wide configuration and control to a low level CMIB command line instruction.",
      "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators."
    ]
  },
  {
    "text": "Showing users where they are: Each presentation segment (page or window) should provide the user with a clear and sufficient indication of where he or she is in the navigation structure and of the current segment position with respect to the overall structure.",
    "id": [
      1234,
      407,
      1230,
      472,
      471,
      440,
      1091,
      474,
      1238,
      470
    ],
    "example": [
      "Once an Center is selected, the user shall be able to select a Traffic Signal from a list and provide the following information, including Target Traffic Signal and Plan.",
      "Making navigation self-descriptive: Navigation should be designed to help users understand where they are, where they have been and where they can go next.",
      "Once an Center is selected, the user shall be able to select a DMS from a list and provide the following information, including Target DMS, Message to be displayed and Beacons On/Off.",
      "Providing a site map: A separate navigation overview such as a site map should be provided for application showing the structure of the site in an overview form.",
      "Linking back to the home page or landmark pages: Each page should contain a link leading to the home page of the application or to a landmark page that is easy to recognize for the user.",
      "Using familiar terminology for navigation links: Navigation links — particularly links representing the main navigation structure — should be labelled with terms that are familiar to the user, based on his/her general knowledge, prior experience in the application domain or experience of using other systems.",
      "Each control console shall have a display windows that provides the aircraft position, Tactical Control System position, flight path, and waypoint graphics in the foreground, which are positioned in relation to a map displayed in the background.",
      "Placing navigation components consistently: Navigation components should be placed consistently on the pages or in the framesets in the pages of the application.",
      "Once an Center is selected, the user shall be able to select a Dynamic Lane from a list and provide the following information, including Target Dynamic Lane and Plan.",
      "Appropriate content presentation also plays a key role in accessibility."
    ]
  },
  {
    "text": "Making user interfaces robust: User interfaces should be designed to be as robust as possible in the face of changing technology.",
    "id": [
      399,
      476,
      420,
      393,
      403,
      475,
      535,
      477,
      397,
      423
    ],
    "example": [
      "The user interfaces should be designed to make them user-intuitive.",
      "User adaptation can also be important for making the user interface more accessible.",
      "Designing for input device independence: User interfaces should be designed to allow activation of controls by a variety of input devices.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "User interfaces should meet its requirements and recommendations.",
      "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient.",
      "The CCTNS system should ensure high scalability and performance through using of AJAX based technology to improve user experience.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "This encompasses being able to present content containing newer technologies by older user agents as well as designing content to be usable with future technologies."
    ]
  },
  {
    "text": "Consistent page layout: Pages should be designed using consistent layout schemes, supporting the user in finding similar information at the same position on different pages.",
    "id": [
      461,
      463,
      474,
      471,
      451,
      435,
      434,
      439,
      437,
      442
    ],
    "example": [
      "Overall layout schemes apply to all pages and are preferable when all pages have a similar structure.",
      "In such cases, pages can usually be grouped in different categories, using one layout scheme for each category consistently.",
      "Placing navigation components consistently: Navigation components should be placed consistently on the pages or in the framesets in the pages of the application.",
      "Linking back to the home page or landmark pages: Each page should contain a link leading to the home page of the application or to a landmark page that is easy to recognize for the user.",
      "Selecting appropriate page lengths The length of a page should be selected so as to support the primary purpose and use of the page.",
      "Readability of text: Text presented on the pages should be readable taking into account the expected display characteristics and spatial arrangement.",
      "Supporting text skimming: Fast skimming of text should be supported by the provision of clear links, bulleted lists, highlighted keywords, logical headings, and short phrases and sentences.",
      "Avoiding link overload: Text pages containing large proportions of links should be formatted so that the presence of links does not impede the readability of the text.",
      "Distinguishable within-page links: Within-page links should be clearly distinguishable from other links that lead to a different page.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand."
    ]
  },
  {
    "text": "Placing title information consistently: Page titles should be placed in a consistent location on the different pages.",
    "id": [
      474,
      463,
      451,
      435,
      461,
      434,
      441,
      437,
      471,
      433
    ],
    "example": [
      "Placing navigation components consistently: Navigation components should be placed consistently on the pages or in the framesets in the pages of the application.",
      "In such cases, pages can usually be grouped in different categories, using one layout scheme for each category consistently.",
      "Selecting appropriate page lengths The length of a page should be selected so as to support the primary purpose and use of the page.",
      "Readability of text: Text presented on the pages should be readable taking into account the expected display characteristics and spatial arrangement.",
      "Overall layout schemes apply to all pages and are preferable when all pages have a similar structure.",
      "Supporting text skimming: Fast skimming of text should be supported by the provision of clear links, bulleted lists, highlighted keywords, logical headings, and short phrases and sentences.",
      "Using descriptive link labels: The target or purpose of a link should be directly indicated by its label, avoiding generic labels such as “go” or “click here” except where the purpose of the link is clear from its context on the page or the labels have commonly understood semantics in the particular application domain.",
      "Distinguishable within-page links: Within-page links should be clearly distinguishable from other links that lead to a different page.",
      "Linking back to the home page or landmark pages: Each page should contain a link leading to the home page of the application or to a landmark page that is easy to recognize for the user.",
      "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points."
    ]
  },
  {
    "text": "Consistency between navigation components and content: If navigation components (or overviews) are shown in conjunction with associated content, consistency between the navigation component and the content shown should be maintained by indicating in the navigation component (e.g.",
    "id": [
      474,
      444,
      440,
      434,
      441,
      407,
      562,
      437,
      435,
      470
    ],
    "example": [
      "Placing navigation components consistently: Navigation components should be placed consistently on the pages or in the framesets in the pages of the application.",
      "Distinguishing navigation links from controls: Navigation links should be clearly distinguishable from controls activating some action.",
      "Using familiar terminology for navigation links: Navigation links — particularly links representing the main navigation structure — should be labelled with terms that are familiar to the user, based on his/her general knowledge, prior experience in the application domain or experience of using other systems.",
      "Supporting text skimming: Fast skimming of text should be supported by the provision of clear links, bulleted lists, highlighted keywords, logical headings, and short phrases and sentences.",
      "Using descriptive link labels: The target or purpose of a link should be directly indicated by its label, avoiding generic labels such as “go” or “click here” except where the purpose of the link is clear from its context on the page or the labels have commonly understood semantics in the particular application domain.",
      "Making navigation self-descriptive: Navigation should be designed to help users understand where they are, where they have been and where they can go next.",
      "Error and status messages will be provided in a concise time/location referenced format to upper system levels in a content controllable manner.",
      "Distinguishable within-page links: Within-page links should be clearly distinguishable from other links that lead to a different page.",
      "Readability of text: Text presented on the pages should be readable taking into account the expected display characteristics and spatial arrangement.",
      "Appropriate content presentation also plays a key role in accessibility."
    ]
  },
  {
    "text": "Taking account of the users’ tasks and information needs: When providing different access paths or navigation structures for different user groups, the tasks and information needs of these user groups should be taken into consideration.",
    "id": [
      479,
      475,
      421,
      477,
      407,
      430,
      409,
      403,
      482,
      442
    ],
    "example": [
      "such as employees of different levels, citizens etc, monitoring the user’s behaviour and adapting to the user’s goals that are inferred from the behaviour observed, recommending information that is potentially more relevant or interesting to the specific user, based on the behaviour of all users or a user group.",
      "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient.",
      "The ability to choose between different input devices for activating controls such as links, fields and buttons is important both for users who prefer a certain input mode, mobile users and users with disabilities.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "Making navigation self-descriptive: Navigation should be designed to help users understand where they are, where they have been and where they can go next.",
      "Using appropriate formats, units of measurement or currency: When designing user interfaces for use by diverse groups, input and output of information elements such as currency, units of measurement, temperatures, date and time, phone numbers, address or postal codes should be designed so that they are usable.",
      "Offering alternative access paths: Alternative access paths for navigating to a specific unit of content should be offered to support different navigation strategies.",
      "User interfaces should meet its requirements and recommendations.",
      "If profiles are used, it is important to provide users with information about this concept and its implications.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand."
    ]
  },
  {
    "text": "Allowing users to see and change profiles: If user-specified profiles are used, users should be able to see, modify and delete that profile on demand.",
    "id": [
      481,
      19,
      482,
      82,
      356,
      476,
      460,
      397,
      477,
      343
    ],
    "example": [
      "Making user profiles evident: If predefined user profiles or user-specified profiles are used for individualizing or adapting content, the profile currently used should be made evident.",
      "For example, a Master User shall be able to add a user account or change the default parameter settings.",
      "If profiles are used, it is important to provide users with information about this concept and its implications.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices ",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "User adaptation can also be important for making the user interface more accessible.",
      "Providing alternative text-only pages: When style sheets and/or frames are turned off it should be possible for the user to read and understand the page; alternatively, the user should be provided with an equivalent alternative text-only page.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "It also gives the user the ability to customize the results view by criminal/accused or by cases."
    ]
  },
  {
    "text": "The CCTNS system should be designed in manner that operational data is not lost in case of any failure of equipment or communication network.",
    "id": [
      530,
      531,
      513,
      526,
      509,
      527,
      523,
      532,
      529,
      533
    ],
    "example": [
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should be developed for a centralized deployment and maintenance ",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should work even in an offline mode with the critical functionality ",
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting.",
      "The CCTNS system should support secure virtual private network connections ",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries.",
      "The CCTNS system should ensure high standards of security and access control through do not allow hard delete and perform only soft tagging the row for deletion."
    ]
  },
  {
    "text": "The CCTNS system should be implemented using Service Oriented Architecture (SOA) and have a modular design ",
    "id": [
      513,
      507,
      514,
      379,
      400,
      499,
      516,
      508,
      483,
      511
    ],
    "example": [
      "The CCTNS system should be developed for a centralized deployment and maintenance ",
      "The CCTNS systems should be designed with the following broad guidelines: ",
      "The CCTNS system should be developed to be deployed in a 3-tier datacenter architecture ",
      "The CCTNS system should provide for role-based control for the functionality within the CCTNS system ",
      "The user interfaces of the CCTNS system should comply with Standard ISO 9241.",
      "The proposed functional architecture is modeled around centralized deployment to facilitate ease of maintenance and leverage advancement in open standards and web technologies.",
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "The CCTNS system should support multilingual interface ",
      "The user interfaces of the CCTNS system should follow the guidelines specified under www.usability.gov ",
      "The CCTNS system should be developed on Open Standards "
    ]
  },
  {
    "text": "The CCTNS system should use HTTPS as the communication protocol, i.e., HTTP over an encrypted secure socket layer (SSL) ",
    "id": [
      522,
      526,
      523,
      519,
      512,
      531,
      521,
      527,
      518,
      524
    ],
    "example": [
      "The CCTNS system should support SSL encrypted connections ",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should support secure virtual private network connections ",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "The CCTNS system should be built on a common User Access and Authentication Service to ensure Single-Sign on for the end-user ",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should support multi-tier authentication where required ",
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting.",
      "The CCTNS system should be designed for access through browser-based systems and must impose minimal requirements on the client device ",
      "The CCTNS system should run on multiple browsers."
    ]
  },
  {
    "text": "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs.",
    "id": [
      530,
      531,
      529,
      527,
      532,
      528,
      526,
      533,
      520,
      538
    ],
    "example": [
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries.",
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting.",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The CCTNS system should ensure high standards of security and access control through preventing SQL Injection.",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should ensure high standards of security and access control through do not allow hard delete and perform only soft tagging the row for deletion.",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The CCTNS system should ensure high scalability and performance through displaying of records on the screen in batches/paged manner. "
    ]
  },
  {
    "text": "The CCTNS system should ensure high scalability and performance through leveraging Asynchronous HTTP socket capabilities of web server for scalability and performance.",
    "id": [
      536,
      535,
      534,
      538,
      532,
      499,
      524,
      521,
      522,
      519
    ],
    "example": [
      "The CCTNS system should ensure high scalability and performance through hosting all the static content (documents, images) on the web server.",
      "The CCTNS system should ensure high scalability and performance through using of AJAX based technology to improve user experience.",
      "The CCTNS system should ensure high scalability and performance through using of cache for storing frequent data.",
      "The CCTNS system should ensure high scalability and performance through displaying of records on the screen in batches/paged manner. ",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The proposed functional architecture is modeled around centralized deployment to facilitate ease of maintenance and leverage advancement in open standards and web technologies.",
      "The CCTNS system should run on multiple browsers.",
      "The CCTNS system should support multi-tier authentication where required ",
      "The CCTNS system should support SSL encrypted connections ",
      "The CCTNS system must support multiple types of communication services for remote access "
    ]
  },
  {
    "text": "A hierarchical cache should be configured and used for caching of results of most frequently used searches.",
    "id": [
      217,
      541,
      434,
      534,
      524,
      537,
      426,
      492,
      564,
      418
    ],
    "example": [
      "This information must be saved in a file on the web server where the Space Fractions system is hosted and will be easily edited through simplified administrative screens.",
      "Database Indexes should be applied on the key columns used for searching.",
      "Supporting text skimming: Fast skimming of text should be supported by the provision of clear links, bulleted lists, highlighted keywords, logical headings, and short phrases and sentences.",
      "The CCTNS system should ensure high scalability and performance through using of cache for storing frequent data.",
      "The CCTNS system should run on multiple browsers.",
      "The search results should be fetched from the database in batches of 10 or 20 maximum as configured within the application.",
      "This is particularly important for frequently accessed pages or pages that are important for user navigation and exploration, such as the home page.",
      "In this context, performing a search means returning a result list.",
      "The translation will provide the correlator with specific goal oriented hardware configuration tables to satisfy the configuration requested by the A second interface with a human GUI will also allow for configuration of the correlator hardware, preferably through the same table structures used above.",
      "This may be done by placing important information at the top and providing links to information that is further down the page."
    ]
  },
  {
    "text": "The primary audience of this document includes, but is not limited to, project leaders, the designers and developers of the EVLA Correlator Monitor and Control System and the end user.",
    "id": [
      544,
      553,
      580,
      183,
      554,
      543,
      1079,
      469,
      185,
      423
    ],
    "example": [
      "The document may also be of interest to VLA Expansion Project project scientists and engineers or as a reference for individuals involved in similar projects with similar requirements.",
      "The remainder of this document contains a more detailed description of the Correlator Monitor and Control System as well as the primary requirements necessary to design and build the EVLA Correlator Monitor and Control System.",
      "These individuals are responsible for developing the software and will interact with the EVLA Correlator Monitor and Control System to ensure that it is functioning properly.",
      "This document is designed to provide information to both the client and the technical designers of the software.",
      "The format of the document follows that outlined in the IEEE STD 830 document, IEEE The VLA Expansion Project Correlator Monitor and Control System is responsible for correlator configuration, real time monitor/control, and hardware testing/servicing.",
      "The primary goal of this document is to provide a complete and accurate list of requirements for the VLA Expansion Project Correlator Monitor and Control System.",
      "This includes, but is not limited to, the language, the computer, database, architecture, and interoperability.",
      "In addition, when designing multimedia information presentations, the design principles and recommendations described in ISO 14915-1 to ISO 14915-3 should be taken into account.",
      "The definitions section is intended to assist the technical designers as well as the client in clarifying the terms used throughout the document.",
      "This encompasses being able to present content containing newer technologies by older user agents as well as designing content to be usable with future technologies."
    ]
  },
  {
    "text": "The Correlator Monitor and Control System will provide a level of abstraction to modularize the correlator system within the VLA Expansion Project environment.",
    "id": [
      555,
      559,
      548,
      554,
      626,
      563,
      546,
      590,
      1064,
      609
    ],
    "example": [
      "The Correlator Monitor and Control System exists as an integrated part of the overall VLA Expansion Project Monitor and Control Structure.",
      "The Correlator monitor subsystem will provide VLA Expansion Project system wide access to all correlator system states including the Monitor and Control System supervisor system state.",
      "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
      "The format of the document follows that outlined in the IEEE STD 830 document, IEEE The VLA Expansion Project Correlator Monitor and Control System is responsible for correlator configuration, real time monitor/control, and hardware testing/servicing.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "Correlator configurations and control instructions will be received from the VLA Expansion Project Monitor and Control System system in a form suitable for translation by the Master Correlator Control Computer.",
      "The Correlator Monitor and Control System provides the physical link between the WIDAR Correlator hardware and the VLA Expansion Project monitor and control system.",
      "It is assumed that the backend data processing and VLA Expansion Project Monitor and Control System systems will be capable of accepting output data rates generated by the Correlator Monitor and Control System.",
      "The hardware of the Tactical Control System shall be capable of being scaled as well as being modular to meet the varying needs of the Services.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system."
    ]
  },
  {
    "text": "The Master is expected to handle the bulk of the monitor or control interface with the outside world whereas the slaves will be only concerned with the correlator hardware systems under their direct control.",
    "id": [
      556,
      557,
      609,
      594,
      573,
      569,
      613,
      575,
      611,
      596
    ],
    "example": [
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "This topology will place the real-time computing requirements in the slave layer and the quasi real-time, network-chaotic loads into the master layer.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "The Master Correlator Control Computer-CMIB, Master Correlator Control Computer-Correlator Power Control Computer, and Master Correlator Control Computer-VLA Expansion Project Monitor and Control System networks shall be on separate physical interfaces.",
      "Watchdog processes and the Master Correlator Control Computer will likewise monitor Correlator Power Control Computer health.",
      "The Master Correlator Control Computer will accept external data feeds for models, time standards, fiber-link phase corrections and other required data to be packaged with control data delivered to the correlator hardware.",
      "The Correlator Power Control Computer shall be a high availability type general purpose computer capable of supporting a COTS operating system and have the ability to accept a large number of external hardware status signals either directly or through external interface hardware.",
      "All use of the Correlator Monitor and Control System will be through the VCI or Master Correlator Control Computer.",
      "The Master Correlator Control Computer shall have all required disk and file system facilities installed locally such that the EVLA Correlator Monitor and Control System can boot and run in a stand-alone configuration.",
      "Network routers/switches shall be employed at the Master Correlator Control Computer-VLA Expansion Project Monitor and Control System interface level to protect the Master Correlator Control Computer from unauthorized access and irrelevant network traffic."
    ]
  },
  {
    "text": "The CMIB subsystem will then be automatically restarted and configured back into the current operational environment.",
    "id": [
      737,
      744,
      742,
      736,
      767,
      87,
      738,
      571,
      768,
      745
    ],
    "example": [
      "When the Tactical Control System Software is terminated normally the Tactical Control System shall enter the Normal Startup Mode of operation upon application of power.",
      "The Tactical Control System in the Recovery Startup Mode shall provide the system functionality to resume the Operations ",
      "When executing in the Normal Startup Mode, the Tactical Control System shall provide the system functionality necessary to initialize the system to place it in the Operations State within 60 seconds from the time power is supplied and the Tactical Control System application is launched.",
      "The Tactical Control System will execute the particular startup mode which corresponds with the manner in which the Tactical Control System ",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring.",
      "The DigitalHome System will backup all system data (configuration, default parameter settings, planning, and usage data) on a daily basis, with the backup time set by the DigitalHome Technician at system set up.",
      "When the Tactical Control System software is halted due to an unplanned power interruption as well as abnormal program termination, then the Tactical Control System shall enter the Recovery Startup Mode upon application of power.",
      "Should a CMIB subsystem fail and not respond to reboot requests or other self-heal attempts, an alert notice will be issued so appropriate personnel can affect a hardware repair.",
      "Upon the selection of a shutdown command the Tactical Control System shall enter the Shutdown State, which will cause the Tactical Control System to be placed in a condition where power can be removed without impacting operations as well as causing damage to the system, and from which restart of the system can be accomplished normally.",
      "Recovery of the Tactical Control System HWCIs shall include startup of HWCIs, download of software, startup of CSCIs, and establishment of the state of readiness of all interfaces."
    ]
  },
  {
    "text": "The primary contact with array operations will be via status and error messages channeled through the Monitor and Control System.",
    "id": [
      893,
      951,
      869,
      894,
      872,
      729,
      674,
      855,
      852,
      549
    ],
    "example": [
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
      "The Tactical Control System shall receive, process, and present payload data to the operator so that the status of the payload can be determined.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall provide override of payload automated as well as preprogrammed inputs.",
      "The Tactical Control System will provide receipt and transmission of secondary imagery and/or data from UAV.",
      "The Tactical Control System will receipt and transmission of secondary imagery and/or data from multiple UAV.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Correlator Monitor and Control System shall process and transfer dynamic control data and monitor data."
    ]
  },
  {
    "text": "There shall be a redundant communication path between the Master Correlator Control Computer and Correlator Power Control Computer to provide for remote reboot in the event of a networking or computing failure.",
    "id": [
      572,
      596,
      556,
      574,
      616,
      763,
      610,
      614,
      603,
      767
    ],
    "example": [
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "Network routers/switches shall be employed at the Master Correlator Control Computer-VLA Expansion Project Monitor and Control System interface level to protect the Master Correlator Control Computer from unauthorized access and irrelevant network traffic.",
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "Due to the more hardware specific connections and controls of the Correlator Power Control Computer, actions taken by external system upon hard failures are TBD.",
      "This requirement is to allow correlator power monitoring and control to continue in the event of an Monitor and Control System network failure.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct data link terminal maintenance.",
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible.",
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible.",
      "Where applicable, all computers and peripherals shall be powered though UPS type devices with sufficient capacity for the computers to safely coordinate a system wide shutdown of the correlator hardware in the event of a prolonged power outage.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring."
    ]
  },
  {
    "text": "The CMIB shall be able to read back the contents of all writeable hardware control registers where meaningful.",
    "id": [
      608,
      609,
      569,
      599,
      617,
      613,
      572,
      534,
      591,
      549
    ],
    "example": [
      "The CMIB shall conform to both electrical and physical The CMIB shall contain 64 Mbytes or greater of SDRAM, IDE hard disk interface, minimum of one serial and one parallel interface, PCI/ISA buses, 100BaseT network interface, capacity to boot and run a generic COTS operating system in a near real-time environment from local non-volatile storage.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "The Master Correlator Control Computer will accept external data feeds for models, time standards, fiber-link phase corrections and other required data to be packaged with control data delivered to the correlator hardware.",
      "The CMIB shall be capable of reading a 16-bit identifier from the host correlator board.",
      "The Correlator Monitor and Control System processors shall be capable of meeting all data processing deadlines and anticipated future requirements The Correlator Monitor and Control System processors shall be capable of responding to correlator hardware inputs in a deterministic fashion with sufficient performance to avoid data loss, corruption or overflows.",
      "The Correlator Power Control Computer shall be a high availability type general purpose computer capable of supporting a COTS operating system and have the ability to accept a large number of external hardware status signals either directly or through external interface hardware.",
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "The CCTNS system should ensure high scalability and performance through using of cache for storing frequent data.",
      "The interface between the CMIB, Master Correlator Control Computer, and Correlator Power Control Computer shall be Ethernet of 100 Mbits/sec or better data rate.",
      "The Correlator Monitor and Control System shall process and transfer dynamic control data and monitor data."
    ]
  },
  {
    "text": "The CMIB shall have control of hardware warm boots such that an external command from the Master Correlator Control Computer to reboot the CMIB shall have an option to force a hardware warm boot.",
    "id": [
      608,
      609,
      601,
      572,
      606,
      613,
      612,
      569,
      556,
      610
    ],
    "example": [
      "The CMIB shall conform to both electrical and physical The CMIB shall contain 64 Mbytes or greater of SDRAM, IDE hard disk interface, minimum of one serial and one parallel interface, PCI/ISA buses, 100BaseT network interface, capacity to boot and run a generic COTS operating system in a near real-time environment from local non-volatile storage.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "It is desired that the state of the correlator hardware be available through interrogation across the CMIB bus for monitoring and fault tolerance.",
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "Each computer system in the Correlator Monitor and Control System shall have a hardware based watchdog timer configured to reboot the EVLA Correlator Monitor and Control System in the case of a system hang.",
      "The Correlator Power Control Computer shall be a high availability type general purpose computer capable of supporting a COTS operating system and have the ability to accept a large number of external hardware status signals either directly or through external interface hardware.",
      "This should allow the correlator CMIBs to boot, configure, and run without any communication outside of the correlator Monitor and Control System network.",
      "The Master Correlator Control Computer will accept external data feeds for models, time standards, fiber-link phase corrections and other required data to be packaged with control data delivered to the correlator hardware.",
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible."
    ]
  },
  {
    "text": "It will be capable of detecting, reporting on and automatically taking action to remedy or lessen the impact of the following types of abnormal conditions: processor hardware failure, operating system hangs or crashes, temperature or voltage deviations, computational performance below minimum specifications, computational error rates above maximum specification, internal communications failures.",
    "id": [
      550,
      574,
      765,
      571,
      750,
      767,
      570,
      1097,
      606,
      579
    ],
    "example": [
      "The Correlator Monitor and Control System shall monitor correlator and correlator subsystem health and take corrective action autonomously to recover from hardware and computing system faults.",
      "Due to the more hardware specific connections and controls of the Correlator Power Control Computer, actions taken by external system upon hard failures are TBD.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform fault detection/location (FD/L).",
      "Should a CMIB subsystem fail and not respond to reboot requests or other self-heal attempts, an alert notice will be issued so appropriate personnel can affect a hardware repair.",
      "The Tactical Control System hardware and software shall execute periodic Fault Detection/Location (FD/L) while in the Normal Operations Mode and Training Mode, to include a periodic determination of level of interaction.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring.",
      "The ability to attempt recovery from failure or hot-swapped hardware devices will be built into this system.",
      "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
      "Each computer system in the Correlator Monitor and Control System shall have a hardware based watchdog timer configured to reboot the EVLA Correlator Monitor and Control System in the case of a system hang.",
      "Engineers and technicians will need tools to inspect and monitor individual CMIB layer devices from remote locations and have the ability to fault trace to a specific hot-swappable subsystem."
    ]
  },
  {
    "text": "This excludes items that due to their physical location, are not practical to configure for ready access.",
    "id": [
      901,
      650,
      385,
      646,
      413,
      582,
      493,
      384,
      497,
      378
    ],
    "example": [
      "External storage can be utilized for this purpose.",
      "Development, testing and maintenance personnel, on the other hand, require access to some parts of the EVLA Correlator Monitor and Control System, but not all, indicating that an access level is needed that allows privileges to be granted on a per-user and what-do-you-need-to-do basis.",
      "Note that the requirement in the third option (i.e.the most stringent) implies that the CCTNS system must not include such cases in any count of search results; this level of security is normally appropriate for cases dealing with matters such as national security.",
      "If a user cannot be identified, they will not be given access.",
      "Avoiding opening unnecessary windows: Additional windows such as new browser windows or pop-up windows should only be opened if this supports the user’s task.",
      "A few authorized individuals may be allowed access to parts of the EVLA Correlator Monitor and Control System that are usually considered restricted.",
      "It does not include retrieving the records themselves.",
      "If a user requests access to, or searches for, a case which he does not have the right to access, the CCTNS system must provide one of the following responses (selectable at configuration time): display title and metadata;display the existence of a case but not its title or other metadata;do not display any case information or indicate its existence in any way.",
      "This requirement is intended to allow for cases where cases used infrequently are stored on slower media than more active records.",
      "The CCTNS system must allow the user to limit access to cases to specified users or user groups."
    ]
  },
  {
    "text": "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access.",
    "id": [
      596,
      966,
      960,
      527,
      962,
      1055,
      74,
      50,
      374,
      528
    ],
    "example": [
      "Network routers/switches shall be employed at the Master Correlator Control Computer-VLA Expansion Project Monitor and Control System interface level to protect the Master Correlator Control Computer from unauthorized access and irrelevant network traffic.",
      "As a minimum, the Tactical Control System will restrict Operator access to this capability via password protection.",
      "The Tactical Control System shall restrict operator access to this capability via password protection.",
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting.",
      "As a minimum, the Tactical Control System shall restrict Operator access to this capability via password protection.",
      "All hardware, software, documentation, and sensitive information processed by Tactical Control System shall be physically protected, minimally at the level determined by the risk index computed in to prevent intentional as well as unintentional disclosure, destruction, and modification.",
      "The DigitalHome security system consists of contact sensors and a set security alarms.",
      "The system shall include security sound and light alarms, which can be activated when DigitalHome senses a security breach from a magnetic contact.",
      "The CCTNS system must be able to capture and store violations (i.e.A user’s attempts to access a case to which he is denied access), and (where violations can validly be attempted) attempted violations, of access control mechanisms.",
      "The CCTNS system should ensure high standards of security and access control through preventing SQL Injection."
    ]
  },
  {
    "text": "Maximal practical use of available hot swappable devices and components shall be made.",
    "id": [
      633,
      661,
      566,
      660,
      27,
      41,
      509,
      640,
      603,
      153
    ],
    "example": [
      "All system processing and interconnect hardware shall be readily accessible for maintenance, repair, replacement and reconfiguration.",
      "Complete and comprehensible hardware systems specifications and configuration information shall be readily available.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
      "Replaceability modular design principles shall be employed to the maximum extent possible.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "The DigitalHome Gateway device shall provide communication with all the DigitalHome devices and shall connect with a broadband Internet connection.",
      "The CCTNS system should work even in an offline mode with the critical functionality ",
      "I/O, communications, and processing hardware shall be easily expandable, reconfigurable, augmentable and replaceable to meet increasing data traffic and processing demands imposed by VLA Expansion Project science, Correlator changes, and availability of new hardware.",
      "Where applicable, all computers and peripherals shall be powered though UPS type devices with sufficient capacity for the computers to safely coordinate a system wide shutdown of the correlator hardware in the event of a prolonged power outage.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I's."
    ]
  },
  {
    "text": "Software shall be written in a style that is easily readable and using practices that allow for minimal confusion.",
    "id": [
      662,
      586,
      442,
      391,
      552,
      277,
      399,
      27,
      639,
      641
    ],
    "example": [
      "Software system and application code shall be well documented and written in a generally familiar language or languages.",
      "The ultimate ease of use and flexibility of the correlator is rooted in the Correlator Monitor and Control System software.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "The CCTNS system must employ a single set of user interface rules, or a small number of sets to provide a familiar and common look and feel for the application.",
      "The Correlator Monitor and Control System shall allow for easy system access to aid testing and debugging.",
      "This method ensures a straightforward and accessible approach for users to demonstrate their understanding and apply their knowledge of fractions.",
      "The user interfaces should be designed to make them user-intuitive.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "Operating system software shall either have source code available or come with sufficient diagnostics and customer support.",
      "Transparency shall be accomplished in manner that is transparent to processing, communications and I/O software functions with the possible exception of recompilation of executables."
    ]
  },
  {
    "text": "Phase 1 is defined as the Program Definition and Risk Reduction phase, and Phase 2 is defined as the Engineering and Manufacturing Development phase in accordance with Department Of Defense Instruction (DODI) - 5000.2R.",
    "id": [
      1050,
      673,
      671,
      672,
      1059,
      759,
      1077,
      114,
      1052,
      725
    ],
    "example": [
      "Therefore, as per DoD Regulation 5000.2-R, dated March 15, 1996, the Tactical Control System shall meet security requirements in accordance with DoD Directive 5200.28(D), “Security Requirements for Automated Information Systems” dated March 21, 1988.",
      "Phase 1 will be a 24 month period and will demonstrate Level 1 through Level 5 interaction (as defined below) in an Incremental and Evolutionary strategy as described in accordance with MIL-STD-498.",
      "Design and development of the Tactical Control System will be conducted in two phases.",
      "During Phase 2, Tactical Control System Low Rate Initial Production (LRIP) will commence.",
      "A training program consisting of an initial security training and awareness briefing covering AIS security in general but also tailored to the Tactical Control System shall be developed.",
      "In the Training Operations Mode the Tactical Control System shall support target coordinate development.",
      "The Tactical Control System shall have software based on Defense Information Infrastructure/Common Operating Environment per Assistant Secretary of Defense for Command, Control, Communications, and Intelligence (ASD(C3I)) Joint Technical Architecture (JTA).",
      "The APAF ground data system requirements are categorized according to functional areas and are defined in the following sections in table format.",
      "Using risk assessment procedures defined in DoD 5200.28(D), a risk index and the minimum security requirements for Tactical Control System shall be determined.",
      "The operational capabilities to be performed by the system will be determined by task analysis in accordance with MIL STD 1388 Task 401 as a guide based on a thorough understanding of Outrider and Predator mission requirements."
    ]
  },
  {
    "text": "The Tactical Control System will be connected with Advanced Tomahawk Weapons Control Station (ATWCS).",
    "id": [
      700,
      710,
      708,
      993,
      698,
      709,
      707,
      992,
      1020,
      986
    ],
    "example": [
      "The Tactical Control System will be connected with Automated Target Hand-off System (ATHS)",
      "The Tactical Control System will be connected with Joint Surveillance Target Attack Radar System (JSTARS) Ground Station Module/Common",
      "The Tactical Control System will be connected with Joint Maritime Command Information System (JMCIS)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System will be connected with Advanced Field Artillery Tactical Data System (AFATDS).",
      "The Tactical Control System will be connected with Joint Service Imagery Processing System - Navy (JSIPS-N)",
      "The Tactical Control System will be connected with Joint Deployable Intelligence Support System (JDISS)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System will provide an interface between the Tactical Control System and a video cassette recorder.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS."
    ]
  },
  {
    "text": "The Tactical Control System will be connected with Joint Service Imagery Processing System – Air Force (JSIPS-AF)",
    "id": [
      709,
      713,
      710,
      882,
      707,
      714,
      698,
      712,
      978,
      706
    ],
    "example": [
      "The Tactical Control System will be connected with Joint Service Imagery Processing System - Navy (JSIPS-N)",
      "The Tactical Control System will be connected with Air Force Mission Support System (AFMSS)",
      "The Tactical Control System will be connected with Joint Surveillance Target Attack Radar System (JSTARS) Ground Station Module/Common",
      "The Tactical Control System shall support a LOS data link and SATCOM data link capability.",
      "The Tactical Control System will be connected with Joint Deployable Intelligence Support System (JDISS)",
      "The Tactical Control System will be connected with Tactical Aircraft Mission Planning System (TAMPS)",
      "The Tactical Control System will be connected with Advanced Field Artillery Tactical Data System (AFATDS).",
      "The Tactical Control System will be connected with Army Mission Planning System (AMPS)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System will be connected with Intelligence Analysis System (IAS)"
    ]
  },
  {
    "text": "The Tactical Control System will be connected with Ground Station (GSM/CGS)",
    "id": [
      976,
      680,
      710,
      713,
      882,
      968,
      875,
      1012,
      1013,
      967
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSTARS GSM.",
      "The Tactical Control System will also provide connectivity to specifically identified Command, Control, Communications, Computers, and ",
      "The Tactical Control System will be connected with Joint Surveillance Target Attack Radar System (JSTARS) Ground Station Module/Common",
      "The Tactical Control System will be connected with Air Force Mission Support System (AFMSS)",
      "The Tactical Control System shall support a LOS data link and SATCOM data link capability.",
      "The Tactical Control System shall provide the capability to interface with equipment necessary to provide connectivity with standard DoD tactical (VHF, UHF, and UHF/VHF) radios, Mobile Subscriber Equipment, and military and commercial satellite communications equipment.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall support a concurrent uplink and downlink capability.",
      "The Tactical Control System shall provide an internal interface for establishing communications with the Real Time Processor (RTP) within Tactical Control System.",
      "The Tactical Control System will interface with external systems to conduct mission coordination and operations."
    ]
  },
  {
    "text": "The Tactical Control System will interface with and export and disseminate payload data to military supported units via external (not part of TCS) tactical communications systems, and C4I systems.",
    "id": [
      922,
      696,
      974,
      865,
      936,
      866,
      1004,
      1017,
      972,
      826
    ],
    "example": [
      "The Tactical Control System shall provide information to the C4I system, utilizing data obtained from drones (non-real-time trajectories, tactical points, and details), for use by C4I system operators. This information is transmitted via tactical data communication links and is available for engagement by appropriate weapon systems.",
      "The Tactical Control System integration with C4I systems will be accomplished through development of interfaces that permit information exchange between the Tactical Control System and specified C4I systems.",
      "For external communications to C4I systems the Tactical Control System shall utilize the Universal Communication Processor as well as the Common Message Processor (CMP) Government Off The Shelf (GOTS) software capabilities of the DII/COE to communicate with C4I systems using Tactical Communication (TACOMM) messages.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System will have the functionality to process received C4I messages and to prepare C4I messages for transmission.",
      "The Tactical Control System shall provide the necessary system capabilities required for payload control beyond line of sight via uplink command of two air vehicles of the same type using sequential communication techniques.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide an internal interface for the SAR Processor in order to disseminate SAR information (to include imagery and telemetry) to other components of the Tactical Control System.",
      "The Tactical Control System will be interoperable with C4I systems.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission."
    ]
  },
  {
    "text": "The initial TCS task analysis will produce a system baseline which will be optimized by engineering analysis and operator evaluations.",
    "id": [
      725,
      1112,
      105,
      742,
      786,
      828,
      953,
      778,
      955,
      954
    ],
    "example": [
      "The operational capabilities to be performed by the system will be determined by task analysis in accordance with MIL STD 1388 Task 401 as a guide based on a thorough understanding of Outrider and Predator mission requirements.",
      "The operational tasks to be performed concurrently by the operator during normal operation will be determined by appropriate task analysis and function allocation.",
      "The first step in defining the IDFS data sets is to identify the physical instruments that make up the ASPERA-3 experiment and any ancillary data necessary for scientific analysis.",
      "When executing in the Normal Startup Mode, the Tactical Control System shall provide the system functionality necessary to initialize the system to place it in the Operations State within 60 seconds from the time power is supplied and the Tactical Control System application is launched.",
      "Upon completion of radar cross section analysis and characterization by the Government for each UAV type, Tactical Control System shall utilize a UAV signature versus threat lookup table (database) that identities the lethality of the threat to the UAV [SSS065], and shall provide the capability of displaying aircraft signature versus threat, before and during flight.",
      "AV specific components used to perform ground based closed loop command and control functions for Tactical Control System shall be initialized upon operator selection of a specific AV.",
      "Tactical Control System shall be capable of executing payload maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall facilitate automated processing of mission plan data received via C4I interfaces in order to extract the appropriate mission planning data.",
      "Tactical Control System shall be capable of executing workstation and peripheral equipment maintenance software and displaying appropriate status results.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results."
    ]
  },
  {
    "text": "The Tactical Control System will provide direct receipt of imagery and/or data from UAV.",
    "id": [
      729,
      675,
      730,
      674,
      676,
      905,
      718,
      1076,
      669,
      999
    ],
    "example": [
      "The Tactical Control System will provide receipt and transmission of secondary imagery and/or data from UAV.",
      "The Tactical Control System will direct receipt of imagery and/or data from multiple UAV.",
      "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
      "The Tactical Control System will receipt and transmission of secondary imagery and/or data from multiple UAV.",
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System shall be capable of receiving secondary HAE UAV payload imagery.",
      "The Tactical Control System will export and disseminate UAV imagery products, tactical communication messages, as well as mission plans and target coordinates.",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "Tactical Control System will also be capable of receiving and processing information from High Altitude and Endurance (HAE) UAVs, their associated payloads, future development UAVs and payloads.",
      "The Tactical Control System shall provide interfaces with the respective UAV program-provided data links for command and control."
    ]
  },
  {
    "text": "Upon application of power the Tactical Control System shall enter the Startup State.",
    "id": [
      737,
      736,
      742,
      768,
      744,
      738,
      733,
      957,
      1042,
      697
    ],
    "example": [
      "When the Tactical Control System Software is terminated normally the Tactical Control System shall enter the Normal Startup Mode of operation upon application of power.",
      "The Tactical Control System will execute the particular startup mode which corresponds with the manner in which the Tactical Control System ",
      "When executing in the Normal Startup Mode, the Tactical Control System shall provide the system functionality necessary to initialize the system to place it in the Operations State within 60 seconds from the time power is supplied and the Tactical Control System application is launched.",
      "Upon the selection of a shutdown command the Tactical Control System shall enter the Shutdown State, which will cause the Tactical Control System to be placed in a condition where power can be removed without impacting operations as well as causing damage to the system, and from which restart of the system can be accomplished normally.",
      "The Tactical Control System in the Recovery Startup Mode shall provide the system functionality to resume the Operations ",
      "When the Tactical Control System software is halted due to an unplanned power interruption as well as abnormal program termination, then the Tactical Control System shall enter the Recovery Startup Mode upon application of power.",
      "The states of operation of the Tactical Control System shall include Startup, Operation, and Shutdown.",
      "As a minimum, Tactical Control System shall provide Startup FD/L for the operator workstation.",
      "The Tactical Control System shall be capable of restoring power in sufficient time to avoid loss of air vehicle control during power outages.",
      "The Tactical Control System will be capable of entering DII/COE compliant networks."
    ]
  },
  {
    "text": "When in the Operations State the Tactical Control System shall be capable of operating in three modes: normal operations mode, training operations mode, and maintenance operations mode.",
    "id": [
      757,
      754,
      756,
      751,
      760,
      826,
      753,
      969,
      1139,
      733
    ],
    "example": [
      "In the Training Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "In the Normal Operations Mode the Tactical Control System shall support C4I systems interface.",
      "In the Training Operations Mode the Tactical Control System shall support mission planning.",
      "In the Normal Operations Mode the Tactical Control System shall support mission planning.",
      "In the Training Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "In the Normal Operations Mode the Tactical Control System shall support target coordinate development.",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "The Tactical Control System shall have an objective capability to be integrated and operated from tactical and command and control aircraft.",
      "The states of operation of the Tactical Control System shall include Startup, Operation, and Shutdown."
    ]
  },
  {
    "text": "In the Normal Operations Mode the Tactical Control System shall support mission control and monitoring.",
    "id": [
      751,
      757,
      756,
      753,
      921,
      771,
      967,
      752,
      826,
      969
    ],
    "example": [
      "In the Normal Operations Mode the Tactical Control System shall support mission planning.",
      "In the Training Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "In the Training Operations Mode the Tactical Control System shall support mission planning.",
      "In the Normal Operations Mode the Tactical Control System shall support target coordinate development.",
      "The Tactical Control System shall plan and conduct a mission.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "The Tactical Control System will interface with external systems to conduct mission coordination and operations.",
      "In the Normal Operations Mode the Tactical Control System shall support payload product management.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification)."
    ]
  },
  {
    "text": "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct payload maintenance.",
    "id": [
      763,
      764,
      767,
      762,
      766,
      765,
      826,
      953,
      1063,
      872
    ],
    "example": [
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct data link terminal maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct workstation and peripheral equipment maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct AV maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software upgrades.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform fault detection/location (FD/L).",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "Tactical Control System shall be capable of executing payload maintenance software and displaying appropriate status results.",
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System shall provide override of payload automated as well as preprogrammed inputs."
    ]
  },
  {
    "text": "Functions, except for software upgrade and software debug, under the Maintenance Operations Mode shall operate concurrently without precluding or excluding any of the other functions in accordance with allowable operations as determined by the appropriate levels of interaction.",
    "id": [
      755,
      761,
      637,
      659,
      1112,
      1088,
      630,
      1251,
      1087,
      750
    ],
    "example": [
      "Functions under the Normal Operations Mode shall operate concurrently without precluding or excluding any of the other functions, in accordance with allowable operations as determined by the appropriate levels of interaction.",
      "Functions under the Training Operations Mode shall operate concurrently without precluding or excluding any of the other functions, in accordance with allowable operations as determined by the appropriate levels of interaction.",
      "All software processes shall be killable, restartable, debuggable and testable with minimal impact on normal system operations.",
      "The EVLA Correlator Monitor and Control System shall continue operations, although not Description necessarily at full capacity, on all unaffected resources during partial shutdowns for maintenance, repair and/or upgrade.",
      "The operational tasks to be performed concurrently by the operator during normal operation will be determined by appropriate task analysis and function allocation.",
      "Training software shall be alterable without affecting the configuration of the operational software.",
      "The hardware part of the EVLA Correlator Monitor and Control System shall be able to perform indefinitely without complete loss of service, except in the event of total failure of primary and backup power.",
      "In this mode, the Center-to-Center performs normal mode operations and also logs activities.",
      "The Tactical Control System’s operating system and executable software shall be re-programmable without hardware disassembly.",
      "The Tactical Control System hardware and software shall execute periodic Fault Detection/Location (FD/L) while in the Normal Operations Mode and Training Mode, to include a periodic determination of level of interaction."
    ]
  },
  {
    "text": "There shall be no modes of operation in the shutdown state.",
    "id": [
      769,
      749,
      932,
      768,
      635,
      738,
      748,
      14,
      30,
      934
    ],
    "example": [
      "Shutdown of the Tactical Control System shall include storage as well as deletion, as specified by the operator, of mission data files, shutdown of appropriate functions, shutdown of HCIs, and proper termination of all active interfaces.",
      "The operator shall have the capability to command the system to the Shutdown State from all modes under the Operations State.",
      "The Tactical Control System shall establish digital communication with the C4I systems and terminate the communication upon completion.",
      "Upon the selection of a shutdown command the Tactical Control System shall enter the Shutdown State, which will cause the Tactical Control System to be placed in a condition where power can be removed without impacting operations as well as causing damage to the system, and from which restart of the system can be accomplished normally.",
      "All software application modules shall be debuggable.",
      "When the Tactical Control System software is halted due to an unplanned power interruption as well as abnormal program termination, then the Tactical Control System shall enter the Recovery Startup Mode upon application of power.",
      "The Operations State modes shall not exist concurrently.",
      "There will be no actual physical home and all sensors and controllers will be simulated.",
      "There will be no actual physical home and all sensors and controllers will be simulated.",
      "The Tactical Control System shall establish analog communication with C4I systems and terminate the communication once it is completed."
    ]
  },
  {
    "text": "The Tactical Control System will allow the operator to conduct C4I system interface.",
    "id": [
      754,
      760,
      771,
      770,
      972,
      936,
      826,
      922,
      970,
      947
    ],
    "example": [
      "In the Normal Operations Mode the Tactical Control System shall support C4I systems interface.",
      "In the Training Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "The Tactical Control System will allow the operator to conduct mission planning.",
      "The Tactical Control System will be interoperable with C4I systems.",
      "The Tactical Control System will have the functionality to process received C4I messages and to prepare C4I messages for transmission.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall provide information to the C4I system, utilizing data obtained from drones (non-real-time trajectories, tactical points, and details), for use by C4I system operators. This information is transmitted via tactical data communication links and is available for engagement by appropriate weapon systems.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall have the functionality to monitor the status of all C4I interfaces, and display appropriate control information."
    ]
  },
  {
    "text": "The Tactical Control System shall automatically check the validity of the intended mission plan prior to being uploaded including altitude constraints, payload constraints, data link range constraints, airspace restrictions, fuel limitations, threat constraints, data link terrain masking effects, and Loss of Link (LOL) Plan.",
    "id": [
      873,
      788,
      855,
      789,
      1038,
      806,
      792,
      824,
      775,
      825
    ],
    "example": [
      "Tactical Control System shall provide the capability to monitor payload adherence to the uplinked mission plan.",
      "The Tactical Control System shall allow the operator to enter as well as review mission plan parameters, including AV flight parameters, payload control parameters, data link control parameters, AV VCR control parameters (if applicable to the selected AV), and AV loiter patterns.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "For mission planning, the Tactical Control System shall provide terrain avoidance warning and minimum reception altitude calculations for line of sight flights.",
      "The Tactical Control System shall present to the operator the estimated time of arrival and fuel status at each programmed waypoint of the proposed mission plan.",
      "The Tactical Control System shall notify the operator of all discrepancies found during the mission plan check as well as indicate successful completion of the mission plan check.",
      "The Tactical Control System shall provide the system functionality necessary to generate a payload plan.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from service specific mission planning systems.",
      "The Tactical Control System shall provide the capability to display the payload swath for the selected payload for planning purposes."
    ]
  },
  {
    "text": "The Tactical Control System flight route planner will calculate the minimum data link reception altitude for line-of-sight flights.",
    "id": [
      1038,
      803,
      801,
      861,
      805,
      810,
      895,
      804,
      806,
      798
    ],
    "example": [
      "For mission planning, the Tactical Control System shall provide terrain avoidance warning and minimum reception altitude calculations for line of sight flights.",
      "The Tactical Control System flight route planner will provide terrain avoidance warnings for line-of-sight flights. ",
      "The Tactical Control System flight route planner will calculate the weight and balance data for takeoff.",
      "The Tactical Control System shall compute the estimated position of the AV during Loss of Link (LOL) based upon the last known AV position and anticipated flight path based on current flight mode (e.g. flight route plan mode, emergency flight route plan mode, maintain current heading mode).",
      "The Tactical Control System flight route planner will be able to designate flight corridors and restricted airspace.",
      "The Tactical Control System shall provide the capability to create waypoints that define the desired flight path, define AV Altitude and Airspeed associated with the waypoint.",
      "The Tactical Control System shall be capable of presenting to the operator a visual depiction of the minimum and maximum data link operational ranges.",
      "The Tactical Control System flight route planner will provide payload search area information, such as visual acuity range due to atmospheric conditions, diurnal transition periods for thermal imagery, and lunar and solar terrain shadowing.",
      "The Tactical Control System shall present to the operator the estimated time of arrival and fuel status at each programmed waypoint of the proposed mission plan.",
      "The Tactical Control System shall allow the operator to define the desired AV route in waypoint format, and shall provide the capability to include up to 500 waypoints in each flight route plan."
    ]
  },
  {
    "text": "The flight route plan, as a minimum, shall provide the necessary AV commands to autonomously execute a programmed flight and return to a designated recovery area.",
    "id": [
      797,
      808,
      828,
      855,
      835,
      788,
      823,
      843,
      781,
      833
    ],
    "example": [
      "The Flight Route Plan, as a minimum, shall include AV flight path information, Loss of Link plan, AV VCR control tasking (if applicable to the selected AV), and data link control information.",
      "The Tactical Control System shall analyze the flight route plan selected for uplink to determine that the flight constraints of the AV and the limitation of the data link are not violated prior to transmission of the flight route plan to the AV.",
      "AV specific components used to perform ground based closed loop command and control functions for Tactical Control System shall be initialized upon operator selection of a specific AV.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System shall allow the operator to enter as well as review mission plan parameters, including AV flight parameters, payload control parameters, data link control parameters, AV VCR control parameters (if applicable to the selected AV), and AV loiter patterns.",
      "The Tactical Control System shall be able to generate payload planning information to be uplinked to the AV separate from a flight route plan.",
      "The Tactical Control System shall allow the operator to command the flight behavior characteristics inherent to the selected AV.",
      "A Mission Plan shall include a Flight Route Plan for a selected AV, a Payload Plan for the selected payload, and a Communications Plan.",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
    "id": [
      799,
      774,
      770,
      842,
      783,
      816,
      885,
      815,
      895,
      843
    ],
    "example": [
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall have the functionality to allow the operator to generate a UAV mission plan.",
      "The Tactical Control System will allow the operator to conduct mission planning.",
      "The Tactical Control System shall provide interactive displays necessary to command the flight of an AV.",
      "The Tactical Control System mission planning function shall provide a graphical user interface that gives the operator the ability to define waypoints on a map based display using a pointing device with full keyset redundancy.",
      "The Tactical Control System shall provide the operator with a clearly indicated map scale.",
      "The Tactical Control System shall provide an interactive display for the purpose of controlling the data link terminal.",
      "The Tactical Control System shall have the capability to load a map onto the display, to zoom in and out, to scroll, to print, and to clear a map on the map display.",
      "The Tactical Control System shall be capable of presenting to the operator a visual depiction of the minimum and maximum data link operational ranges.",
      "The Tactical Control System shall allow the operator to command the flight behavior characteristics inherent to the selected AV."
    ]
  },
  {
    "text": "The Tactical Control System shall display an icon, in variable sizes, indicating target position and type at coordinates selected by the operator.",
    "id": [
      1126,
      820,
      819,
      1101,
      911,
      1138,
      811,
      915,
      818,
      783
    ],
    "example": [
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control.",
      "The Tactical Control System shall display an icon indicating Launch, Handover, and Recovery site (when applicable).",
      "The Tactical Control System shall display icons indicating Tactical Control System position and Ground Data Terminal (GDT) position.",
      "Tactical Control System Warning messages shall be color coded and flashed based on mission criticality.",
      "The Tactical Control System shall have the capability to select and deselect several types of cross hairs (or other similar ICON) to identify a selected point on a target.",
      "The Tactical Control System HCI shall provide for the capability to automatically designate target locations from the payload screen onto the map screen.",
      "The Tactical Control System shall provide the capability of displaying overlays each containing 100 simultaneous icons of known fire support coordination zones, airspace control zones, threat systems, and displaying the threat engagement envelopes with associated radar terrain masking for those threats.",
      "The Tactical Control System shall have the capability to display Near-Real Time (NRT) imagery to include, as a minimum, date/time group, target location coordinates when the target is in the center of the field of view, north seeking arrow, and AV position and heading.",
      "The Tactical Control System shall display an icon indicating payload center field of view and footprint when receiving downlink from the desired AV.",
      "The Tactical Control System mission planning function shall provide a graphical user interface that gives the operator the ability to define waypoints on a map based display using a pointing device with full keyset redundancy."
    ]
  },
  {
    "text": "The Tactical Control System shall have the capability to control and monitor multiple types of AVs.",
    "id": [
      864,
      833,
      856,
      865,
      835,
      826,
      875,
      846,
      836,
      780
    ],
    "example": [
      "The Tactical Control System will have the capability to control and monitor the AV payload(s).",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "Tactical Control System shall provide the capability to monitor the status of all AV subsystems reporting status.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System shall provide the capability to fully control and display the AV's Identification Friend or Foe ",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems."
    ]
  },
  {
    "text": "The Tactical Control System shall have the capability to command the AV to use the navigation methods inherent to the selected AV.",
    "id": [
      833,
      835,
      877,
      865,
      864,
      839,
      843,
      829,
      780,
      777
    ],
    "example": [
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System will have the capability to control and monitor the AV payload(s).",
      "The Tactical Control System shall provide the necessary system capabilities required for AV flight control BLOS via uplink command to two MAE air vehicles.",
      "The Tactical Control System shall allow the operator to command the flight behavior characteristics inherent to the selected AV.",
      "The Tactical Control System shall transmit command and control information to the AV via the uplink to the AV, and receive AV telemetry and payload information via downlink from the AV.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the functionality to control the power, transmitter signal strength, and frequencies used by ADT for data link communication.",
    "id": [
      890,
      848,
      968,
      925,
      894,
      875,
      1007,
      877,
      846,
      680
    ],
    "example": [
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "The Tactical Control System shall provide the functionality to control the ADT antenna.",
      "The Tactical Control System shall provide the capability to interface with equipment necessary to provide connectivity with standard DoD tactical (VHF, UHF, and UHF/VHF) radios, Mobile Subscriber Equipment, and military and commercial satellite communications equipment.",
      "The Tactical Control System shall have the ability to interface with Service specific ground and airborne Ultra High Frequency (UHF), Very High Frequency (VHF), UHF/VHF, and High Frequency (HF) radios for digital message transmission while using the same radios for record traffic.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System will also provide connectivity to specifically identified Command, Control, Communications, Computers, and "
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver functions of the selected data terminal.",
    "id": [
      890,
      879,
      894,
      970,
      875,
      877,
      949,
      848,
      846,
      870
    ],
    "example": [
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall be capable of monitoring the status of all incoming and outgoing tactical communication messages.",
      "The Tactical Control System shall provide the functionality to control the ADT antenna.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System shall permit the operator to control the payload using all methods supported by the payload installed in the selected AV."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
    "id": [
      890,
      879,
      894,
      949,
      875,
      848,
      877,
      970,
      846,
      854
    ],
    "example": [
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring the status of all incoming and outgoing tactical communication messages.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall provide the functionality to control the ADT antenna.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "Tactical Control System shall provide the capability to monitor specific telemetry elements real-time, and record all telemetry elements for future review and processing."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
    "id": [
      894,
      890,
      893,
      949,
      939,
      875,
      869,
      854,
      846,
      954
    ],
    "example": [
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System shall be capable of monitoring the status of all incoming and outgoing tactical communication messages.",
      "The Tactical Control System shall be capable of reviewing incoming Tactical Communication Messages.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall receive, process, and present payload data to the operator so that the status of the payload can be determined.",
      "Tactical Control System shall provide the capability to monitor specific telemetry elements real-time, and record all telemetry elements for future review and processing.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results."
    ]
  },
  {
    "text": "The Tactical Control System shall have the functionality to process payload product data from Electro Optical (EO), Infrared (IR), and Synthetic Aperture Radar (SAR) payloads.",
    "id": [
      1063,
      1076,
      669,
      1017,
      896,
      1005,
      906,
      1026,
      676,
      865
    ],
    "example": [
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "Tactical Control System will also be capable of receiving and processing information from High Altitude and Endurance (HAE) UAVs, their associated payloads, future development UAVs and payloads.",
      "The Tactical Control System shall provide an internal interface for the SAR Processor in order to disseminate SAR information (to include imagery and telemetry) to other components of the Tactical Control System.",
      "The Tactical Control System will have the functionality necessary to manage all aspects of payload product handling to include receiving, processing, displaying, and performing limited exploitation.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "Payload telemetry data shall be available to support other Tactical Control System functions as required.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
    "id": [
      875,
      950,
      675,
      946,
      951,
      865,
      940,
      1063,
      674,
      1005
    ],
    "example": [
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall be equipped to view incoming and outgoing, both annotated and un-annotated analog imagery.",
      "The Tactical Control System will direct receipt of imagery and/or data from multiple UAV.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission.",
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System will receipt and transmission of secondary imagery and/or data from multiple UAV.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems."
    ]
  },
  {
    "text": "The Tactical Control System shall have the functionality to conduct limited exploitation, to include voice and textual reporting for spot and mission objectives, on the payload product data.",
    "id": [
      896,
      772,
      1076,
      730,
      823,
      865,
      869,
      676,
      1063,
      729
    ],
    "example": [
      "The Tactical Control System will have the functionality necessary to manage all aspects of payload product handling to include receiving, processing, displaying, and performing limited exploitation.",
      "The Tactical Control System will allow the operator to conduct payload product management. ",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
      "The Tactical Control System shall be able to generate payload planning information to be uplinked to the AV separate from a flight route plan.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall receive, process, and present payload data to the operator so that the status of the payload can be determined.",
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System will provide receipt and transmission of secondary imagery and/or data from UAV."
    ]
  },
  {
    "text": "Limited exploitation, as a minimum, will include image enhancement and annotation.",
    "id": [
      898,
      551,
      812,
      913,
      1002,
      685,
      641,
      318,
      1024,
      909
    ],
    "example": [
      "This functionality, as a minimum, shall include: formatting, storing, internally routing, and recording the video [SSS190]; creating and storing a freeze frame of the video [SSS191]; retrieving and displaying the video [SSS192]; printing a hard copy of freeze frame video [SSS193]; and processing digital imagery for export and dissemination [SSS194].",
      "The Correlator Monitor and Control System shall perform limited amounts of real-time data processing and probing such as providing tools to collect and display auto correlation products.",
      "A de-clutter capability shall be provided that allows the operator to display only a selected number of the most significant threats.",
      "The image enhancement capability shall include contrast, brightness, edge enhancement, and sharpness.",
      "The Tactical Control System shall as a minimum, allow Operator(s) to print freeze-frame video, C4I Messages, Mission Plans, FD/L information, and current map display.",
      "The software will provide the UAV operator the necessary tools for computer related communications, mission tasking, mission planning, mission execution, data receipt, data processing, limited data exploitation, and data dissemination.",
      "Transparency shall be accomplished in manner that is transparent to processing, communications and I/O software functions with the possible exception of recompilation of executables.",
      "Due to the relatively small size of the introductory and main menu movies, they can be downloaded in approximately one minute with a modem connection.",
      "The Tactical Control System shall, as a minimum, allow the Operator(s) to print freeze-frame video, C4I Messages, Mission Plans, FD/L information, and current map display to an internal printer.",
      "Overlays consist of information obtained from external sources that is selected by the operator for presentation with the imagery."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions located on the payload imagery display.",
    "id": [
      784,
      918,
      916,
      915,
      825,
      917,
      1138,
      799,
      905,
      895
    ],
    "example": [
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions on the map display.",
      "The Tactical Control System shall have the functionality to determine the location of items of interest within the payload field of view, and express these locations in coordinates acceptable for military applications.",
      "The Tactical Control System will have the functionality to determine target coordinates, and estimate target coordinate accuracy.",
      "The Tactical Control System shall have the capability to display Near-Real Time (NRT) imagery to include, as a minimum, date/time group, target location coordinates when the target is in the center of the field of view, north seeking arrow, and AV position and heading.",
      "The Tactical Control System shall provide the capability to display the payload swath for the selected payload for planning purposes.",
      "The Tactical Control System shall support a target location function where the operator can request the current ground location of the payload field-of-view center.",
      "The Tactical Control System HCI shall provide for the capability to automatically designate target locations from the payload screen onto the map screen.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall be capable of receiving secondary HAE UAV payload imagery.",
      "The Tactical Control System shall be capable of presenting to the operator a visual depiction of the minimum and maximum data link operational ranges."
    ]
  },
  {
    "text": "The Tactical Control System shall have the functionality necessary to manage all aspects of C4I system interfaces to include receiving, processing, and transmitting tactical information to include but not limited to character based text messages, NITF 2.0 imagery files, and RS-170A video.",
    "id": [
      947,
      1113,
      987,
      936,
      970,
      1063,
      1005,
      896,
      1026,
      1065
    ],
    "example": [
      "The Tactical Control System shall have the functionality to monitor the status of all C4I interfaces, and display appropriate control information.",
      "The Tactical Control System shall facilitate Human-Computer Interfaces (HCIs) that support operation of all system modes, functions, and capabilities.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System will have the functionality to process received C4I messages and to prepare C4I messages for transmission.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "The Tactical Control System will have the functionality necessary to manage all aspects of payload product handling to include receiving, processing, displaying, and performing limited exploitation.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System hardware shall allow for long range communications from one Tactical Control System to another [SSS375], data storage expansion [SSS376], access to other computers to share in processing capability [SSS377], and multiple external peripherals [SSS378]."
    ]
  },
  {
    "text": "The Tactical Control System shall be responsible for the presentation of payload products and target coordinates for the purpose of export and dissemination.",
    "id": [
      825,
      718,
      871,
      896,
      918,
      824,
      730,
      758,
      777,
      785
    ],
    "example": [
      "The Tactical Control System shall provide the capability to display the payload swath for the selected payload for planning purposes.",
      "The Tactical Control System will export and disseminate UAV imagery products, tactical communication messages, as well as mission plans and target coordinates.",
      "The Tactical Control System shall provide a graphical user interface display for the purpose of controlling the payload.",
      "The Tactical Control System will have the functionality necessary to manage all aspects of payload product handling to include receiving, processing, displaying, and performing limited exploitation.",
      "The Tactical Control System shall have the functionality to determine the location of items of interest within the payload field of view, and express these locations in coordinates acceptable for military applications.",
      "The Tactical Control System shall provide the system functionality necessary to generate a payload plan.",
      "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
      "In the Training Operations Mode the Tactical Control System shall support payload product Mmanagement.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems.",
      "As an objective, the Tactical Control System shall have the capability to import as well as create and modify map display overlays for fire support coordination measures [SSS547], airspace control measures [SSS548], and threat identification measures."
    ]
  },
  {
    "text": "The Tactical Control System shall send and receive analog imagery in RS-170A format with as well as without overlay.",
    "id": [
      907,
      946,
      931,
      950,
      951,
      912,
      940,
      945,
      928,
      941
    ],
    "example": [
      "The Tactical Control System shall display live and recorded imagery data, with as well as without annotation and overlay, upon operator request.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall send and receive annotated and un-annotated digital imagery.",
      "The Tactical Control System shall be equipped to view incoming and outgoing, both annotated and un-annotated analog imagery.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
      "RS170A video and digital imagery shall be routed to Tactical Control System functions and displayed upon operator request.",
      "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission.",
      "The Tactical Control System shall prepare annotated as well as un-annotated analog imagery for transmission. ",
      "The Tactical Control System shall export and disseminate formatted NITF 2.0 files, digital imagery, RS-170A video (with as well as without overlay), and tactical communication messages.",
      "The Tactical Control System shall have the capability to review incoming annotated as well as un-annotated digital imagery."
    ]
  },
  {
    "text": "The Tactical Control System shall have the capability to review all tactical communication messages received and transmitted.",
    "id": [
      949,
      939,
      944,
      894,
      930,
      938,
      875,
      951,
      854,
      856
    ],
    "example": [
      "The Tactical Control System shall be capable of monitoring the status of all incoming and outgoing tactical communication messages.",
      "The Tactical Control System shall be capable of reviewing incoming Tactical Communication Messages.",
      "The Tactical Control System shall provide the capability to log all incoming and outgoing formatted tactical messages.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall send and receive tactical communication messages. ",
      "The Tactical Control System shall create tactical communications messages.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
      "Tactical Control System shall provide the capability to monitor specific telemetry elements real-time, and record all telemetry elements for future review and processing.",
      "Tactical Control System shall provide the capability to monitor the status of all AV subsystems reporting status."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the system functionality to allow interfacing with external systems via a local area network.",
    "id": [
      680,
      970,
      1004,
      987,
      1012,
      1007,
      993,
      998,
      989,
      985
    ],
    "example": [
      "The Tactical Control System will also provide connectivity to specifically identified Command, Control, Communications, Computers, and ",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall support a concurrent uplink and downlink capability.",
      "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Trojan Spirit II.",
    "id": [
      979,
      990,
      991,
      998,
      985,
      988,
      989,
      978,
      986,
      993
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JDISS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS."
    ]
  },
  {
    "text": "The Tactical Control System shall implement an AV Standard Interface that will provide the proper data format to ensure communications with the selected AV.",
    "id": [
      877,
      829,
      790,
      1011,
      789,
      834,
      865,
      800,
      836,
      902
    ],
    "example": [
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall transmit command and control information to the AV via the uplink to the AV, and receive AV telemetry and payload information via downlink from the AV.",
      "The Tactical Control System shall provide the system functionality necessary to upload a flight route plan and payload plan (if applicable) to the AV via the selected system data link as well as direct ground connection.",
      "The uplink and downlink information passed between the Tactical Control System and the AV shall be in accordance with the associated AV documentation.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "AV telemetry data shall be available to support other Tactical Control System functions as required.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall provide the capability to enter waypoint data in alphanumeric format.",
      "The Tactical Control System shall provide the capability to fully control and display the AV's Identification Friend or Foe ",
      "The Tactical Control System shall be in compliance with Common Imagery Ground Surface Station (CIGSS), United States Imagery Standards (USIS), Video Working Group Standards Architecture, National Imagery Transmission Format (NITF) Version 2.0, and Global Command Control Systems (GCCS) when processing payload imagery data."
    ]
  },
  {
    "text": "The Tactical Control System shall allow the Operator(s) to fully control the VCR via the Tactical Control System Display input device(s).",
    "id": [
      1115,
      958,
      833,
      1021,
      981,
      875,
      1123,
      907,
      984,
      836
    ],
    "example": [
      "The Tactical Control System shall provide the functionality to display all HCI elements on any available monitor on the Tactical Control System workstation.",
      "The Tactical Control System shall allow the operator to control and monitor the AV's FD/L, if required and provided by the Original Equipment Manufacturer (OEM).",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "The Tactical Control System shall be able to route VCR recorded payload video to the C4I Interfaces.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with CCTV.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System shall display live and recorded imagery data, with as well as without annotation and overlay, upon operator request.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the capability to fully control and display the AV's Identification Friend or Foe "
    ]
  },
  {
    "text": "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
    "id": [
      1097,
      1103,
      855,
      771,
      852,
      792,
      793,
      770,
      1100,
      1037
    ],
    "example": [
      "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
      "The Tactical Control System operator shall be required to enter an acknowledgment prior to disabling the display of critical warning flags for any AV, Payload, ADT, GDT, and Tactical Control System faults.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System shall notify the operator of all discrepancies found during the mission plan check as well as indicate successful completion of the mission plan check.",
      "The Tactical Control System shall provide the capability to override validation faults after the fault is acknowledged by the operator.",
      "The Tactical Control System will allow the operator to conduct mission planning.",
      "When performing a given task during mission execution, the operator shall be given appropriate warning messages from other concurrently-executing subsystem tasks.",
      "Appropriate cautions and warnings shall be provided to the operator if the air vehicle deviates into unsafe flight regime."
    ]
  },
  {
    "text": "The inputs to this procedure are the clearance or authorization of the Tactical Control System users and the sensitivities of the data that the Tactical Control System processes, stores or transfers.",
    "id": [
      1051,
      1123,
      893,
      872,
      789,
      877,
      719,
      876,
      1004,
      970
    ],
    "example": [
      "The Tactical Control System shall be accredited by the Designated Approving Authority prior to processing classified as well as sensitive unclassified data.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System shall provide override of payload automated as well as preprogrammed inputs.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System will also receive, process, and display tasking orders, and operational information from Service specific mission planning systems.",
      "The Tactical Control System shall provide the system functionality necessary to record data obtained via the data link.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal."
    ]
  },
  {
    "text": "These requirements pertain to the Tactical Control System computer hardware and software.",
    "id": [
      679,
      692,
      684,
      987,
      985,
      979,
      990,
      991,
      728,
      986
    ],
    "example": [
      "The Tactical Control System consists of the software, software-related hardware and the extra ground support hardware necessary for the control of the Outrider, and the Predator UAV, and future tactical UAVs.",
      "The Tactical Control System will use the computing hardware specified by the service specific procurement contracts.",
      "The major focus of the Tactical Control System program is software.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide software capabilities and hardware configurations necessary to fulfill the operational tasking requirements across the 5 levels of interaction.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS."
    ]
  },
  {
    "text": "The Tactical Control System data sensitivities shall be determined by the data sensitivities of the systems with which it interfaces, to including the air vehicles, payloads, and C4I systems.",
    "id": [
      846,
      1004,
      789,
      999,
      876,
      865,
      877,
      922,
      824,
      970
    ],
    "example": [
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall provide interfaces with the respective UAV program-provided data links for command and control.",
      "The Tactical Control System shall provide the system functionality necessary to record data obtained via the data link.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall provide information to the C4I system, utilizing data obtained from drones (non-real-time trajectories, tactical points, and details), for use by C4I system operators. This information is transmitted via tactical data communication links and is available for engagement by appropriate weapon systems.",
      "The Tactical Control System shall provide the system functionality necessary to generate a payload plan.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal."
    ]
  },
  {
    "text": "The Tactical Control System hardware shall support the data rate characteristics of the AV, data link and payload to ensure interoperability.",
    "id": [
      1068,
      1063,
      902,
      877,
      876,
      1076,
      987,
      873,
      970,
      998
    ],
    "example": [
      "The Tactical Control System shall have sufficient throughput to support the processing requirements of the selected data link.",
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System shall be in compliance with Common Imagery Ground Surface Station (CIGSS), United States Imagery Standards (USIS), Video Working Group Standards Architecture, National Imagery Transmission Format (NITF) Version 2.0, and Global Command Control Systems (GCCS) when processing payload imagery data.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall provide the system functionality necessary to record data obtained via the data link.",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "Tactical Control System shall provide the capability to monitor payload adherence to the uplinked mission plan.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG."
    ]
  },
  {
    "text": "The Tactical Control System shall have an uninterrupted power supply for critical phases (landing and takeoff as a minimum) of mission execution.",
    "id": [
      1030,
      1073,
      751,
      770,
      1040,
      794,
      787,
      826,
      771,
      957
    ],
    "example": [
      "The Tactical Control System shall have an interface to an uninterruptible power supply.",
      "The Tactical Control System shall be capable of restoring power in sufficient time to avoid loss of critical mission data and loss of air vehicle control during power outages.",
      "In the Normal Operations Mode the Tactical Control System shall support mission planning.",
      "The Tactical Control System will allow the operator to conduct mission planning.",
      "The Tactical Control System shall be designed such that no single hardware failure results in an unsafe command to be transmitted to the air vehicle.",
      "The Tactical Control System shall allow the operator to set the LOL delay timer(s) during mission planning.",
      "The Tactical Control System shall permit dynamic mission and payload retasking during all phases of operational mission execution.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "As a minimum, Tactical Control System shall provide Startup FD/L for the operator workstation."
    ]
  },
  {
    "text": "The Tactical Control System throughput shall not exceed 50% of the throughput capability delivered over any 10 second period, and as an objective throughput shall not exceed 25% of throughput capability delivered over any 10 second period.",
    "id": [
      1068,
      1041,
      1040,
      902,
      567,
      1012,
      856,
      873,
      752,
      896
    ],
    "example": [
      "The Tactical Control System shall have sufficient throughput to support the processing requirements of the selected data link.",
      "The Tactical Control System shall be designed such that no single software error results in an unsafe command to be transmitted to the air vehicle.",
      "The Tactical Control System shall be designed such that no single hardware failure results in an unsafe command to be transmitted to the air vehicle.",
      "The Tactical Control System shall be in compliance with Common Imagery Ground Surface Station (CIGSS), United States Imagery Standards (USIS), Video Working Group Standards Architecture, National Imagery Transmission Format (NITF) Version 2.0, and Global Command Control Systems (GCCS) when processing payload imagery data.",
      "Ancillary monitor data including system health, error messages and configuration echoes will be spooled such that temporary loss of network communication with the VLA Expansion Project Monitor and Control System network will not result in loss of monitor data.",
      "The Tactical Control System shall support a concurrent uplink and downlink capability.",
      "Tactical Control System shall provide the capability to monitor the status of all AV subsystems reporting status.",
      "Tactical Control System shall provide the capability to monitor payload adherence to the uplinked mission plan.",
      "In the Normal Operations Mode the Tactical Control System shall support payload product management.",
      "The Tactical Control System will have the functionality necessary to manage all aspects of payload product handling to include receiving, processing, displaying, and performing limited exploitation."
    ]
  },
  {
    "text": "The Tactical Control System software shall provide a high-resolution, computer-generated graphical user interface that enables a UAV operator trained on one system to control different types of UAVs as well as UAV payloads with minimal additional training.",
    "id": [
      686,
      1083,
      774,
      685,
      1076,
      1085,
      779,
      679,
      826,
      990
    ],
    "example": [
      "The software will provide a high resolution computer generated graphical user interface that enables a UAV operator trained on one system to control different types of UAVs or UAV payloads with a minimum of additional training.",
      "The Tactical Control System software shall provide the UAV operator with the necessary tools for computer related communications, mission tasking, mission planning, mission execution, data receipt, data processing, and data dissemination.",
      "The Tactical Control System shall have the functionality to allow the operator to generate a UAV mission plan.",
      "The software will provide the UAV operator the necessary tools for computer related communications, mission tasking, mission planning, mission execution, data receipt, data processing, limited data exploitation, and data dissemination.",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "Tactical Control System software shall provide a windows based graphic operator interface.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System consists of the software, software-related hardware and the extra ground support hardware necessary for the control of the Outrider, and the Predator UAV, and future tactical UAVs.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS."
    ]
  },
  {
    "text": "The HCI shall prompt the operator for a valid input.",
    "id": [
      889,
      892,
      891,
      845,
      844,
      1232,
      1229,
      1135,
      852,
      910
    ],
    "example": [
      "The operator shall be able to manually override the automatic function selection of the selected data terminal, if desired.",
      "The operator shall be able to manually override the automatic frequency selection if desired.",
      "The operator shall be able to manually override the automatic mode selection of the selected data terminal, if desired.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, UAV navigation methods by sending the proper control commands to the UAV.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, flight behaviors by sending the proper control commands to the UAV.",
      "Once an Center is selected, the user shall be able to issue a CCTV switching command, including Source (input) and Destination port (output).",
      "The user shall be provided with the capability to select a network identifier for a device command/control request.",
      "For AV safety as well as mission-critical Warnings, the Tactical Control System HCI shall provide a default selection as well as an override option, along with a selection of adaptive responses, and the minimum information necessary to assist the operator in responding quickly and adaptively to the emergency.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System operator shall be able to select the content of the overlay information."
    ]
  },
  {
    "text": "The Human Computer Interface (HCI) shall be designed and implemented in accordance with the Tactical Control System HCI Specification, Tactical Control System 108.[SSS462] ",
    "id": [
      1113,
      683,
      987,
      947,
      1099,
      763,
      990,
      991,
      696,
      764
    ],
    "example": [
      "The Tactical Control System shall facilitate Human-Computer Interfaces (HCIs) that support operation of all system modes, functions, and capabilities.",
      "The Tactical Control System will provide a common Human-Computer Interface (HCI) for tactical airborne platforms to simplify user operations, training, and facilitate seamless integration into the Services’ joint C4I infrastructure across all levels of interaction.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall have the functionality to monitor the status of all C4I interfaces, and display appropriate control information.",
      "The Tactical Control System HCI shall be a Graphical User Interface (GUI) based on X-windows and Motif.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct data link terminal maintenance.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System integration with C4I systems will be accomplished through development of interfaces that permit information exchange between the Tactical Control System and specified C4I systems.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct workstation and peripheral equipment maintenance."
    ]
  },
  {
    "text": "The Tactical Control System shall provide a capability for porting an off-the-shelf, complex control joystick with multiple toggle and multi-position switches as part of the Tactical Control System hardware suite.",
    "id": [
      986,
      979,
      984,
      989,
      990,
      991,
      993,
      998,
      980,
      985
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with CARS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide for multi-level information display tailoring by the operator.",
    "id": [
      885,
      1123,
      1126,
      875,
      1118,
      910,
      970,
      895,
      890,
      799
    ],
    "example": [
      "The Tactical Control System shall provide an interactive display for the purpose of controlling the data link terminal.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall provide access to the DII Style Manager so that pointing device characteristics can be modified.",
      "The Tactical Control System operator shall be able to select the content of the overlay information.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall be capable of presenting to the operator a visual depiction of the minimum and maximum data link operational ranges.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically."
    ]
  },
  {
    "text": "The Tactical Control System HCI shall provide coarse and fine payload control capabilities directly on the payload screen.",
    "id": [
      1127,
      1130,
      825,
      1136,
      864,
      871,
      1138,
      1076,
      1063,
      896
    ],
    "example": [
      "The Tactical Control System HCI shall provide the capability to select and amplify an object and point on a map as well as payload screen.",
      "The Tactical Control System HCI shall provide the capability to lock onto and hold a coordinate point on the payload imagery window.",
      "The Tactical Control System shall provide the capability to display the payload swath for the selected payload for planning purposes.",
      "The Tactical Control System HCI shall provide for on-screen information to include, as a minimum, overlays, headers, cursors, alphanumeric annotation, waypoints, crosshairs, designed to be visible against the complete spectrum of map and payload video backgrounds.",
      "The Tactical Control System will have the capability to control and monitor the AV payload(s).",
      "The Tactical Control System shall provide a graphical user interface display for the purpose of controlling the payload.",
      "The Tactical Control System HCI shall provide for the capability to automatically designate target locations from the payload screen onto the map screen.",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System will have the functionality necessary to manage all aspects of payload product handling to include receiving, processing, displaying, and performing limited exploitation."
    ]
  },
  {
    "text": "The Center shall provide the link information, including link identifier, link name and link type.",
    "id": [
      1165,
      1168,
      1166,
      1190,
      1167,
      1187,
      1193,
      1192,
      1198,
      1169
    ],
    "example": [
      "For each roadway network it maintains, the Center shall provide the network name and link data information.",
      "The Center shall support the information about each lane closure, including network identifier, lane closure id, closure description.",
      "The Center shall provide the node information, including node identifier, node name and node type description.",
      "The Center shall support the following status information about each Dynamic Lane, including network identifier, link identifier, dynamic lane identifier, dynamic lane name and failure state.",
      "The Center shall support the information about each incident, including network identifier, incident description and roadway.",
      "The Center shall support the following status information about each School Zone, including network identifier, link identifier, school zone identifier and school zone name.",
      "The Center shall support the following status information about each Bus Location, including network identifier, link identifier, bus identifier, bus name, location and schedule adherece.",
      "The Center shall support the following status information about each Bus Stop, including network identifier, link identifier, relative link location, name and location.",
      "The Center shall support the following information about network device status, including network identifier, number of DMSs, number of LCSs, DMS status data, LCS status data and CCTV status data.",
      "The Center shall provide the following status information about each DMS, including network identifier, DMS identifier, DMS name."
    ]
  },
  {
    "text": "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
    "id": [
      1190,
      1181,
      1197,
      1168,
      1193,
      1195,
      1169,
      1192,
      1171,
      1194
    ],
    "example": [
      "The Center shall support the following status information about each Dynamic Lane, including network identifier, link identifier, dynamic lane identifier, dynamic lane name and failure state.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the following status information about each Vehicle Priority, including vehicle identifier, network identifier, link identifier and intersection identifier.",
      "The Center shall support the information about each lane closure, including network identifier, lane closure id, closure description.",
      "The Center shall support the following status information about each Bus Location, including network identifier, link identifier, bus identifier, bus name, location and schedule adherece.",
      "The Center shall support the following status information about each Light/Commuter Location, including network identifier, link identifier, commuter or light rail identifier, commuter or light rail name, location and schedule adherence.",
      "The Center shall provide the following status information about each DMS, including network identifier, DMS identifier, DMS name.",
      "The Center shall support the following status information about each Bus Stop, including network identifier, link identifier, relative link location, name and location.",
      "The Center shall support the following status information about each LCS, including network identifier, LCS identifier, LCS name, Location and Status.",
      "The Center shall support the following status information about each Light/Commuter Stop, including network identifier, link identifier, commuter or light rail stop identifier, commuter or light rail stop name, location and routes."
    ]
  },
  {
    "text": "To support Reversible Lane control in other centers, the Center shall be able to support the following device control command for a Reversible Lane, including network identifier, reversible lane identifier, username, password, plan and duration.",
    "id": [
      1191,
      1185,
      1182,
      1170,
      1172,
      1188,
      1178,
      1180,
      1190,
      1168
    ],
    "example": [
      "To support Dynamic Lane control in other centers, the Center shall be able to support the following device control command for a Dynamic Lane, including network identifier, dynamic lane identifier, username, password and lane plan.",
      "To support HOV Lane control in other centers, the Center shall be able to support the following device control command for a HOV Lane, including network identifier, HOV Lane identifier, username, password and lane plan.",
      "To support Traffic Signal control in other centers, the Center shall be able to support the following device control command for a Traffic Signal, including network identifier, traffic signal identifier, username, password and traffic signal plan identifier.",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "To support LCS control in other centers, the Center shall be able to support the following device control command for a LCS, including network identifier, LCS identifier, username and Password.",
      "To support School Zone control in other centers, the Center shall be able to support the following device control command for a School Zone, including network identifier, school zone identifier, username, password and plan.",
      "To support Ramp Meter control in other centers, the Center shall be able to support the following device control command for a ramp meter, including network identifier, Ramp Meter identifier, username, password and plan.",
      "To support HAR control in other centers, the Center shall be able to support the following device control command for a HAR, including network identifier, HAR identifier, username, password and message.",
      "The Center shall support the following status information about each Dynamic Lane, including network identifier, link identifier, dynamic lane identifier, dynamic lane name and failure state.",
      "The Center shall support the information about each lane closure, including network identifier, lane closure id, closure description."
    ]
  },
  {
    "text": "The map user shall be able to pan the map in each of the following directions: North, South, East or West.",
    "id": [
      1209,
      1215,
      1210,
      1216,
      1207,
      815,
      1237,
      1091,
      1234,
      1238
    ],
    "example": [
      "The map user shall be able to alter the current magnification (zoom level) of the map.",
      "The map shall be capable of displaying the following for a DMS.",
      "Each link displayed on the map shall be color coded to provide a graphical depiction of speeds.",
      "The map shall be capable of displaying the following for a LCS.",
      "The map shall display interstates and state highways on the graphical map.",
      "The Tactical Control System shall have the capability to load a map onto the display, to zoom in and out, to scroll, to print, and to clear a map on the map display.",
      "Once an Center is selected, the user shall be able to select a Reversible Lane from a list and provide the following information, including Target Reversible Lane and Plan.",
      "Each control console shall have a display windows that provides the aircraft position, Tactical Control System position, flight path, and waypoint graphics in the foreground, which are positioned in relation to a map displayed in the background.",
      "Once an Center is selected, the user shall be able to select a Traffic Signal from a list and provide the following information, including Target Traffic Signal and Plan.",
      "Once an Center is selected, the user shall be able to select a Dynamic Lane from a list and provide the following information, including Target Dynamic Lane and Plan."
    ]
  },
  {
    "text": "Once an Center is selected, the user shall be able to select a Ramp Meter from a list and provide the following information, including Target Ramp Meter and Plan.",
    "id": [
      1237,
      1238,
      1234,
      1178,
      1177,
      1231,
      1236,
      1230,
      1235,
      1186
    ],
    "example": [
      "Once an Center is selected, the user shall be able to select a Reversible Lane from a list and provide the following information, including Target Reversible Lane and Plan.",
      "Once an Center is selected, the user shall be able to select a Dynamic Lane from a list and provide the following information, including Target Dynamic Lane and Plan.",
      "Once an Center is selected, the user shall be able to select a Traffic Signal from a list and provide the following information, including Target Traffic Signal and Plan.",
      "To support Ramp Meter control in other centers, the Center shall be able to support the following device control command for a ramp meter, including network identifier, Ramp Meter identifier, username, password and plan.",
      "The Center shall support the status information about each ramp meter, including network identifier, Ramp Meter identifier, Ramp Meter name, Location and Status.",
      "Once an Center is selected, the user shall be able to select a LCS from a list and provide the following information, including Target LCS and Assignment of lane arrows.",
      "Once an Center is selected, the user shall be able to select a School Zone from a list and provide the following information, including Target School Zone and Plan.",
      "Once an Center is selected, the user shall be able to select a DMS from a list and provide the following information, including Target DMS, Message to be displayed and Beacons On/Off.",
      "Once an Center is selected, the user shall be able to select a HOV from a list and provide the following information, including Target HOV and Plan.",
      "The Center shall support the following status information about each Parking Lot, including network identifier, parking lot identifier, parking lot name, location and status."
    ]
  },
  {
    "text": "Once an Center is selected, the user shall be able to select a HAR from a list and provide the following information, including Target HAR and Text to be sent to the HAR.",
    "id": [
      1230,
      1231,
      1234,
      1235,
      1179,
      1238,
      1237,
      1180,
      1236,
      1233
    ],
    "example": [
      "Once an Center is selected, the user shall be able to select a DMS from a list and provide the following information, including Target DMS, Message to be displayed and Beacons On/Off.",
      "Once an Center is selected, the user shall be able to select a LCS from a list and provide the following information, including Target LCS and Assignment of lane arrows.",
      "Once an Center is selected, the user shall be able to select a Traffic Signal from a list and provide the following information, including Target Traffic Signal and Plan.",
      "Once an Center is selected, the user shall be able to select a HOV from a list and provide the following information, including Target HOV and Plan.",
      "The Center shall support the following status information about each HAR, including network identifier, HAR identifier, HAR name, location and status.",
      "Once an Center is selected, the user shall be able to select a Dynamic Lane from a list and provide the following information, including Target Dynamic Lane and Plan.",
      "Once an Center is selected, the user shall be able to select a Reversible Lane from a list and provide the following information, including Target Reversible Lane and Plan.",
      "To support HAR control in other centers, the Center shall be able to support the following device control command for a HAR, including network identifier, HAR identifier, username, password and message.",
      "Once an Center is selected, the user shall be able to select a School Zone from a list and provide the following information, including Target School Zone and Plan.",
      "Once an Center is selected, the user shall be able to select a CCTV from a list and provide the following information."
    ]
  }
]