[
  {
    "text": "The DigitalHome Software Requirements Specification (SRS) is based on the DigitalHome Customer Need Statement.",
    "id": [
      195,
      1150,
      208,
      116,
      4,
      202,
      341,
      196,
      412,
      120
    ],
    "example": [
      "This is the Software Requirements Specification (SRS) for the \"Space Fractions\" system.",
      "This Software Requirements Specification (SRS) provides the requirements for the Center-to-Center (C2C) Communications Network that is based on a Texas Department of Transportation (TxDOT) C2C project.",
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document.",
      "This Software Requirements Specification (SRS) identifies the requirements for the ASPERA-3 Processing and Archiving Facility (APAF) ground data system for the Mars Express mission.",
      "Hence, the SRS is not intended as a comprehensive or complete specification of DigitalHome requirements.",
      "This document is designed to provide information to both the client and the technical designers of the software.",
      "The Functional Requirements Specifications (FRS) report provides the detailed description of the functionalities required for the first version of the CCTNS.",
      "The purpose of the document is to describe the purpose and functionality of the software product requested by Ms. Andrea Brooks of Pecan Springs Elementary School.",
      "Application user interfaces to meet its requirements and recommendations.",
      "These data products will be put into a form known as the Instrument Data File Set (IDFS)."
    ]
  },
  {
    "text": "This initial version of DigitalHome will be a limited prototype version, which will be used by HomeOwner management to make business decisions about the future commercial development of DigitalHomeOwner products and services.",
    "id": [
      10,
      12,
      112,
      27,
      0,
      6,
      24,
      28,
      198,
      35
    ],
    "example": [
      "The Digital Home High Level Requirements Definition is intended as a prototype, which will allow business decisions to be made about future development of a commercial product.",
      "The prototype DigitalHome software system will be situated in a simulated environment.",
      "Although the product produced under this document will be a “prototype” version, all modules and components of this prototype version shall be designed and implemented in such a manner that it may be incorporated in a fully specified commercial version of the DigitalHome System.",
      "The development team will use the development process specified by the Digital HomeOwner Inc.",
      "This document specifies the requirements for the development of a “Smart House”, called DigitalHome (DH), by the DigitalHomeOwner Division of HomeOwner Inc.",
      "These document were prepared by the DigitalHomeOwner Division, in consultation with the Marketing Division of HomeOwner Inc.",
      "The “prototype” version of the DigitalHome System (as specified in this document) must be completed within twelve months of inception.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "The product will be a web-based, interactive system.",
      "Although the system to be developed is a “proof of concept” system intended to help Homeowner Inc."
    ]
  },
  {
    "text": "The product is based on the Digital Home High Level Requirements Definition.",
    "id": [
      10,
      0,
      5,
      28,
      7,
      6,
      22,
      112,
      198,
      208
    ],
    "example": [
      "The Digital Home High Level Requirements Definition is intended as a prototype, which will allow business decisions to be made about future development of a commercial product.",
      "This document specifies the requirements for the development of a “Smart House”, called DigitalHome (DH), by the DigitalHomeOwner Division of HomeOwner Inc.",
      "There is a supplementary document that provides additional detail and information about the DigitalHome requirements: the Digital Home Use Case Model.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "These document were prepared by the DigitalHomeOwner Division, in consultation with the Marketing Division of HomeOwner Inc.",
      "A DigitalHome Technician is specially trained by DigitalHomeOwner to be familiar with the functionality, architecture, and operation of the DigitalHome system product.",
      "Although the product produced under this document will be a “prototype” version, all modules and components of this prototype version shall be designed and implemented in such a manner that it may be incorporated in a fully specified commercial version of the DigitalHome System.",
      "The product will be a web-based, interactive system.",
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document."
    ]
  },
  {
    "text": "To make marketing and development decisions, the following sections describe operational environment concerns and constraints.",
    "id": [
      206,
      57,
      1161,
      1162,
      205,
      489,
      208,
      563,
      154,
      162
    ],
    "example": [
      "This section includes information such as functional and data requirements, general constraints, and assumptions.",
      "This section provides a description of the functional requirements.",
      "The following sections define the requirements for the Center-to-Center project.",
      "Requirements are listed in separate sections and in table format for each functional area.",
      "Section two is a general description of the product requirements from a user's perspective.",
      "Taking account of the users’ tasks and information needs: When providing different access paths or navigation structures for different user groups, the tasks and information needs of these user groups should be taken into consideration.",
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document.",
      "The remainder of this document contains a more detailed description of the Correlator Monitor and Control System as well as the primary requirements necessary to design and build the EVLA Correlator Monitor and Control System.",
      "The requirements associated with computer resources are listed in the table below.",
      "The mnemonic, LR, is used in the requirement identifiers to show that these requirements are Logistical "
    ]
  },
  {
    "text": "The system shall include security sound and light alarms, which can be activated when DigitalHome senses a security breach from a magnetic contact.",
    "id": [
      83,
      86,
      85,
      54,
      61,
      109,
      654,
      1062,
      47,
      59
    ],
    "example": [
      "The DigitalHome security system consists of contact sensors and a set security alarms.",
      "When a security breach occurs and a contact sensor is set OPEN, the alarm system shall be activated.",
      "A DigitalHome system shall be able to activate both light and sound alarms: one sound alarm and one light alarm subsystem, with multiple lights.",
      "The system shall include magnetic alarm contact switches which shall be used to monitor entry through a door or window when the switch is active.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "The DigitalHome web system shall provide for authentication and information encryption through a recognized reliable and effective security technology, such as Transport Layer Security.",
      "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access.",
      "The Tactical Control System shall be designed to protect its communication and data links against enemy Electronic Warfare (EW) threats, physical anti-radiation weaponry and physical destruction.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances."
    ]
  },
  {
    "text": "Each DigitalHome shall contain a master control device (the DigitalHome Gateway Device) that connects to the home’s broadband Internet connection, and uses wireless communication to send and receive communication between the DigitalHome system and the home devices and systems.",
    "id": [
      44,
      82,
      60,
      9,
      45,
      14,
      39,
      59,
      40,
      7
    ],
    "example": [
      "The DigitalHome Gateway device shall provide communication with all the DigitalHome devices and shall connect with a broadband Internet connection.",
      "A DigitalHome system shall use wireless signals to communicate, through the master control unit, with the humidistats.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "The DigitalHome web server communicates, through a home wireless gateway device, with the sensor and controller devices in the home.",
      "The Gateway shall contain an RF Module, which shall send and receive wireless communications between the Gateway and the other DigitalHome devices (sensors and controllers).",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "The home web server will provide interaction with and control of the DigitalHome elements.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home."
    ]
  },
  {
    "text": "A DigitalHome user shall be able to read the humidity at a humidistat position.",
    "id": [
      65,
      77,
      76,
      52,
      66,
      51,
      64,
      14,
      92,
      93
    ],
    "example": [
      "A DigitalHome user shall be able to read the temperature at a thermostat position.",
      "A DigitalHome user shall be able to set the humidity level for a humidistat, from 30% to 60%, inclusive a 1% increments.",
      "The DigitalHome programmable humidistat shall allow a user to monitor and control a home’s humidity from any location, using a web ready computer, cell phone, or PDA.",
      "The humidistat shall provide a reading of the current humidity in the space where the humidistat is located.",
      "A DigitalHome user shall be able to set the thermostat temperatures to between 60 °F and 80 °F, inclusive, at one degree increments.",
      "The system shall include digital programmable humidistats, which shall be used to monitor and regulate the humidity of an enclosed space.",
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices "
    ]
  },
  {
    "text": "For a given month and year, a user shall be able to create or modify a month plan that specifies for each day, for up to four daily time periods, the environmental parameter settings (temperature, humidity, contact sensors and power switches).",
    "id": [
      92,
      81,
      95,
      70,
      93,
      80,
      71,
      77,
      98,
      637
    ],
    "example": [
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "For each humidistat, up to twenty-four one hour settings per day for every day of the week can be scheduled.",
      "The month report shall contain daily average, maximum (with time) and minimum (with time) values of temperature and humidity for each thermostat and humidistat, respectively.",
      "For each thermostat, up to twenty-four one hour settings per day for every day of the week can be scheduled.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices ",
      "If a humdistat device allows a user to make a manual temperature setting, the setting shall remain in effect until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "If a thermostat device allows a user to make a manual temperature setting, the setting shall remain in effect until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "A DigitalHome user shall be able to set the humidity level for a humidistat, from 30% to 60%, inclusive a 1% increments.",
      "Displays of environmental conditions (temperature, humidity, contact sensors and power switches) shall be updated at least every two seconds.",
      "Other message internal time stamps can be used as monitor/control parameters as deemed necessary."
    ]
  },
  {
    "text": "The ASPERA-3 Processing and Archiving Facility (APAF) is a ground data system responsible for processing all of the ASPERA-3 telemetry.",
    "id": [
      121,
      132,
      126,
      116,
      142,
      167,
      131,
      137,
      133,
      165
    ],
    "example": [
      "The APAF data system acquires the telemetry data via NISN, processes the data into IDFS data sets, distributes the IDFS data sets to the ASPERA-3 team, provides web-based displays of the most current data for public view, stores the telemetry and IDFS data sets on a local SwRI archive, and submits the ASPERA-3 IDFS data sets to PDS for long-term archival.",
      "The APAF system shall process all ASPERA-3 science data into IDFS data sets.",
      "The APAF ground data system is to provide data processing algorithms and support to IRF for the ASPERA-3 science team (including Co-I’s) in preparation for the Mission Operations and Data Analysis (MO&DA) phase of the Mars Express mission.",
      "This Software Requirements Specification (SRS) identifies the requirements for the ASPERA-3 Processing and Archiving Facility (APAF) ground data system for the Mars Express mission.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I’s.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I's.",
      "The APAF system shall acquire from ESOC the telemetry data of the ASPERA-3 Experiment and Mars Express Orbit/Attitude to automatically process the data on a daily basis.",
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be stored on a local SwRI archive for data availability and re-processing, and to support the ASPERA-3 team.",
      "The APAF system shall process the engineering and ancillary information necessary for calibration and science validation into IDFS data sets.",
      "The APAF data system requirements for delivering the ASPERA-3 IDFS data, Mars Express Orbit/Attitude IDFS data, and software are described in the following table."
    ]
  },
  {
    "text": "In addition, validation and archiving of all ASPERA-3 scientific data in the NASA Planetary Data System (PDS) within 6 months of receipt in a form useable by the general scientific community is to be provided by the APAF.",
    "id": [
      172,
      173,
      174,
      171,
      137,
      116,
      126,
      121,
      133,
      144
    ],
    "example": [
      "ASPERA-3 data shall be provided to NASA PDS in PDS-compliant form.",
      "ASPERA-3 data shall be calibrated and validated prior to depositing in the NASA PDS.",
      "ASPERA-3 data shall be provided to NASA PDS no later than 6 months after acquisition.",
      "ASPERA-3 IDFS data and MEX OA IDFS data shall be provided to NASA PDS.",
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be stored on a local SwRI archive for data availability and re-processing, and to support the ASPERA-3 team.",
      "This Software Requirements Specification (SRS) identifies the requirements for the ASPERA-3 Processing and Archiving Facility (APAF) ground data system for the Mars Express mission.",
      "The APAF ground data system is to provide data processing algorithms and support to IRF for the ASPERA-3 science team (including Co-I’s) in preparation for the Mission Operations and Data Analysis (MO&DA) phase of the Mars Express mission.",
      "The APAF data system acquires the telemetry data via NISN, processes the data into IDFS data sets, distributes the IDFS data sets to the ASPERA-3 team, provides web-based displays of the most current data for public view, stores the telemetry and IDFS data sets on a local SwRI archive, and submits the ASPERA-3 IDFS data sets to PDS for long-term archival.",
      "The APAF system shall process the engineering and ancillary information necessary for calibration and science validation into IDFS data sets.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives."
    ]
  },
  {
    "text": "The requirements of the APAF data system are categorized and defined in Section 3.",
    "id": [
      165,
      129,
      161,
      207,
      151,
      116,
      172,
      132,
      206,
      57
    ],
    "example": [
      "The APAF data system requirements for delivering the ASPERA-3 IDFS data, Mars Express Orbit/Attitude IDFS data, and software are described in the following table.",
      "The requirements associated with the functionality of the APAF ground data system are itemized in the table below.",
      "The logistics-related requirements of the APAF ground data system are itemized in the following table.",
      "Section three is a detailed requirements specification targeted toward technical designers.",
      "The requirement associated with the privacy of the APAF ground data system is in the table below.",
      "This Software Requirements Specification (SRS) identifies the requirements for the ASPERA-3 Processing and Archiving Facility (APAF) ground data system for the Mars Express mission.",
      "ASPERA-3 data shall be provided to NASA PDS in PDS-compliant form.",
      "The APAF system shall process all ASPERA-3 science data into IDFS data sets.",
      "This section includes information such as functional and data requirements, general constraints, and assumptions.",
      "This section provides a description of the functional requirements."
    ]
  },
  {
    "text": "Section 4 contains general information to aid in the understanding of this specification.",
    "id": [
      57,
      206,
      127,
      558,
      204,
      563,
      1162,
      207,
      478,
      203
    ],
    "example": [
      "This section provides a description of the functional requirements.",
      "This section includes information such as functional and data requirements, general constraints, and assumptions.",
      "Section 2 is an overview of the descriptions of requirement determination, qualification procedures, rationale, and traceability that are used in the identification and the definitions of the requirements.",
      "The requirements contained in this document are numbered based on the section/subsection in which they appear.",
      "The definitions section is intended to assist the technical designers as well as the client in clarifying the terms used throughout the document.",
      "The remainder of this document contains a more detailed description of the Correlator Monitor and Control System as well as the primary requirements necessary to design and build the EVLA Correlator Monitor and Control System.",
      "Requirements are listed in separate sections and in table format for each functional area.",
      "Section three is a detailed requirements specification targeted toward technical designers.",
      "In addition, when designing multimedia information presentations, the design principles and recommendations described in ISO 14915-1 to ISO 14915-3 should be taken into account.",
      "Section one is a brief overview of the product, including definitions and references."
    ]
  },
  {
    "text": "The APAF ground data system requirements are categorized according to functional areas and are defined in the following sections in table format.",
    "id": [
      129,
      161,
      165,
      1162,
      151,
      57,
      206,
      260,
      154,
      558
    ],
    "example": [
      "The requirements associated with the functionality of the APAF ground data system are itemized in the table below.",
      "The logistics-related requirements of the APAF ground data system are itemized in the following table.",
      "The APAF data system requirements for delivering the ASPERA-3 IDFS data, Mars Express Orbit/Attitude IDFS data, and software are described in the following table.",
      "Requirements are listed in separate sections and in table format for each functional area.",
      "The requirement associated with the privacy of the APAF ground data system is in the table below.",
      "This section provides a description of the functional requirements.",
      "This section includes information such as functional and data requirements, general constraints, and assumptions.",
      "The following table summarizes the external interface requirements for the Space Fractions system.",
      "The requirements associated with computer resources are listed in the table below.",
      "The requirements contained in this document are numbered based on the section/subsection in which they appear."
    ]
  },
  {
    "text": "There shall be a UNIX-based APAF system production computer with an archival system.",
    "id": [
      157,
      1030,
      137,
      1093,
      1034,
      602,
      566,
      135,
      695,
      956
    ],
    "example": [
      "There shall be a UNIX-based APAF system development computer.",
      "The Tactical Control System shall have ports for outputting data and imagery to an internal hard copy printer.",
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be stored on a local SwRI archive for data availability and re-processing, and to support the ASPERA-3 team.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services.",
      "The Tactical Control System shall provide a tape drive for storage and retrieval of Tactical Control System data.",
      "It is assumed that the backend data processing and VLA Expansion Project Monitor and Control System systems will be capable of accepting output data rates generated by the Correlator Monitor and Control System.",
      "The Correlator Monitor and Control System will provide a level of abstraction to modularize the correlator system within the VLA Expansion Project environment.",
      "The ASPERA-3 and MEX OA telemetry data shall be stored on a local SwRI archive for data availability and re-processing.",
      "The Tactical Control System will use the computing hardware specified by the service specific procurement contracts.",
      "The Tactical Control System shall prepare annotated as well as un-annotated analog imagery for transmission. "
    ]
  },
  {
    "text": "The SRS will include the details of the system's requirements, interface, design issues, and components.",
    "id": [
      208,
      195,
      1150,
      116,
      146,
      513,
      724,
      1089,
      3,
      125
    ],
    "example": [
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document.",
      "This is the Software Requirements Specification (SRS) for the \"Space Fractions\" system.",
      "This Software Requirements Specification (SRS) provides the requirements for the Center-to-Center (C2C) Communications Network that is based on a Texas Department of Transportation (TxDOT) C2C project.",
      "This Software Requirements Specification (SRS) identifies the requirements for the ASPERA-3 Processing and Archiving Facility (APAF) ground data system for the Mars Express mission.",
      "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the internal interfaces.",
      "The core services, support layer and security and access control components can be deployed as standard components with necessary configuration changes.",
      "The Tactical Control System shall consist of the Tactical Control System workstation Hardware Configuration Items (HWCIs), TCS Computer Software Configuration Items (CSCIs), and additional TCS Support HWCIs and CSCIs.",
      "The Tactical Control System shall provide an open software architecture to be capable of supporting additional CSCIs, CSCs, and CSUs for future AVs, future payloads, and payload capabilities (e.g.",
      "It is made up of a list of the principal features of the system.",
      "Each of the seven components described above will have an associated Software Design Document (SDD) that will define and fully describe all of the data products contained within each individual virtual instrument."
    ]
  },
  {
    "text": "The target clients for our software are students in the sixth grade and their teacher.",
    "id": [
      211,
      210,
      197,
      221,
      316,
      223,
      1098,
      222,
      114,
      592
    ],
    "example": [
      "The personas we will use to model our intended users are a sixth grade female student called Alice learning fractions who does not like to use computers, a sixth grade male student called Bobby learning fractions who is very competitive and a sixth grade teacher with computer skills called Claire.",
      "Moreover, these students (as well as the teacher) are assumed to have basic computer and ",
      "The Space Fractions system is a learning tool created to help improve fraction-solving skills for sixth-grade students.",
      "Claire is a sixth grade teacher who has computer skills.",
      "The Math Umbrella component is designed to serve as an educational resource hub within the system, providing players with easy access to a curated selection of external S2S projects that are specifically tailored to sixth graders. ",
      "Claire has been teaching the sixth grade for six years now.",
      "Training software is the software that provides the computer based training functionality for the system operator.",
      "Claire enjoys teaching sixth graders and is interested in finding innovative ways to teach her students.",
      "HomeOwner has designated object-oriented development, using UML 2.0, as the preferred method for development of software for HomeOwner products.",
      "These individuals are responsible for developing the software and will interact with the EVLA Correlator Monitor and Control System to ensure that it is functioning properly."
    ]
  },
  {
    "text": "Internet skills that will enable them to use this software.",
    "id": [
      328,
      39,
      28,
      21,
      60,
      588,
      42,
      40,
      22,
      306
    ],
    "example": [
      "However, the Space Fractions system will reside on the Internet so more than one user can access the product and download its content for use on their computer.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "A DigitalHome Technician has experience with the type of hardware, software, and web services associated with a system like the DigitalHome system.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "Software tools will be provided to assist the user at all access levels from system wide configuration and control to a low level CMIB command line instruction.",
      "The home web server will provide ability to establish and maintain DigitalHome User Accounts.",
      "The home web server will provide interaction with and control of the DigitalHome elements.",
      "A DigitalHome Technician is specially trained by DigitalHomeOwner to be familiar with the functionality, architecture, and operation of the DigitalHome system product.",
      "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators."
    ]
  },
  {
    "text": "The Space Fractions system requires a web browser capable of running Flash movies.",
    "id": [
      226,
      328,
      236,
      329,
      240,
      1205,
      331,
      333,
      41,
      289
    ],
    "example": [
      "Since the Space Fractions system requires a Flash-supporting browser, the external interface will depend on the configuration of the browser.",
      "However, the Space Fractions system will reside on the Internet so more than one user can access the product and download its content for use on their computer.",
      "This information must be saved in a file on the web server where the Space Fractions system is hosted and will be easily edited through simplified administrative screens.",
      "The Space Fractions system will consist of Flash movies linked together to form a web-based system: there will be a small introductory movie (~200KB), a main menu movie (~100KB), and a main system movie (1-2MB).",
      "The Space Fractions system will run on any Internet-accessible computer with a web browser that supports ",
      "The Web Map application generates a map that can be displayed on an Internet WWW server.",
      "Because Flash movies do not have to be fully downloaded to play, the main system can be played within a few minutes with a regular modem connection to the Internet.",
      "The Space Fractions system will be available over the Internet via the S2S website.",
      "The home web server will provide storage of DigitalHome plans and data.",
      "Alternatively, if the player selects the option to visit the Denominators' web page, the system facilitates this redirection, opening the web page either within the game environment or in a separate browser window, depending on the game's design and platform capabilities."
    ]
  },
  {
    "text": "There is an option to skip the introduction, if desired.",
    "id": [
      273,
      278,
      423,
      305,
      299,
      336,
      275,
      1222,
      298,
      467
    ],
    "example": [
      "This action allows players the option to skip the introductory movie at any point, facilitating a direct transition to the main menu of the game for those who prefer to dive straight into gameplay or who are revisiting the game and already familiar with its storyline.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "If a splash screen is used, a navigation option to skip it should be offered.",
      "Furthermore, this component offers a clear and direct pathway for the player to either revisit the game's content through the main menu or gracefully exit the game, thereby closing their current session.",
      "Upon reaching the ending scene, the system momentarily pauses to allow the player to make their choice between continuing their exploration of the game's content by returning to the main menu or concluding their session by exiting the game.",
      "For example, using appropriate sub- scenes in the main Flash system to split up the code will allow for easy alteration at a later date.",
      "If a click is detected, the movie is immediately terminated, and the system transitions the user to the game's main menu, bypassing the rest of the movie. If no click is registered, the movie plays in its entirety, after which the Space Fractions system automatically proceeds to the main menu.",
      "The GUI shall allow a user to delete a previously entered incident.",
      "Additionally, it presents players with the option to either conclude their current session or navigate back to the main menu for further exploration or replay.",
      "Providing alternative text-only pages: When style sheets and/or frames are turned off it should be possible for the user to read and understand the page; alternatively, the user should be provided with an equivalent alternative text-only page."
    ]
  },
  {
    "text": "Claire will be assured that the students will know what to do from this main screen.",
    "id": [
      221,
      257,
      222,
      210,
      323,
      316,
      211,
      246,
      19,
      312
    ],
    "example": [
      "Claire is a sixth grade teacher who has computer skills.",
      "As the system administrator, Claire can use the question updater to change any of the questions in the system.",
      "Claire enjoys teaching sixth graders and is interested in finding innovative ways to teach her students.",
      "Moreover, these students (as well as the teacher) are assumed to have basic computer and ",
      "This ensures a smooth transition from the system to the external educational content, without disrupting the user's engagement or learning experience.",
      "The Math Umbrella component is designed to serve as an educational resource hub within the system, providing players with easy access to a curated selection of external S2S projects that are specifically tailored to sixth graders. ",
      "The personas we will use to model our intended users are a sixth grade female student called Alice learning fractions who does not like to use computers, a sixth grade male student called Bobby learning fractions who is very competitive and a sixth grade teacher with computer skills called Claire.",
      "The information and interface will be effective so that Bobby will easily recognize what to do to start the system immediately and Alice will have no problems navigating through the help section to understand the rules and systemplay.",
      "He/she will have the same right as the DigitalHome Technician.",
      "The tool then performs a validation check on the submitted data to ensure completeness and contextual relevance to the game's educational objectives."
    ]
  },
  {
    "text": "The last scene will be determined by the user's response on certain critical questions that impact the story's plot, and an option to try again will be presented.",
    "id": [
      294,
      298,
      299,
      253,
      233,
      278,
      296,
      239,
      247,
      304
    ],
    "example": [
      "The system sequence includes \"critical points\" where the storyline can diverge based on whether the player answers these pivotal questions correctly, adding an element of narrative depth and personalization to the gameplay experience.",
      "Additionally, it presents players with the option to either conclude their current session or navigate back to the main menu for further exploration or replay.",
      "Upon reaching the ending scene, the system momentarily pauses to allow the player to make their choice between continuing their exploration of the game's content by returning to the main menu or concluding their session by exiting the game.",
      "After the last question, the main character's adventure will come to an end.",
      "The Space Fractions system will have an ending scene where the user's score is calculated and ranked, with an option to quit the system or try again.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "The ending scene serves as the culmination of the player's journey through the system, providing a conclusion to the storyline that reflects their performance across critical decision points. ",
      "Output will be sounds and animations through Flash movies to acknowledge success or failure in answering the fraction questions.",
      "Next, the user progresses through a series of questions in the form of cartoon images that comprise the main story.",
      "The dynamic nature of the conclusion serves to emphasize the educational progress and decisions of the player, offering a personalized ending that varies from one session to another based on the player's performance."
    ]
  },
  {
    "text": "These inputs will be in the form of two integers representing the numerator and denominator of a fraction. ",
    "id": [
      265,
      266,
      263,
      248,
      209,
      232,
      124,
      261,
      1165,
      295
    ],
    "example": [
      "Upon receiving the fraction inputs, the Space Fractions system will validate the integrity and format of the data to ensure they are integers and that the denominator is not zero.",
      "If the input is valid, the Space Fractions system calculates the velocity adjustment by converting the fraction into a decimal value and applying it to the spaceship's current velocity.",
      "The inputs will consist of fractions entered by the player using the game's interface. ",
      "These questions will test the user's knowledge of basic fraction operations and will be presented as a multiple-choice questionnaire.",
      "These students are in the process of learning how to solve arithmetic problems involving fractions.",
      "The Space Fractions system will have a series of fraction questions (testing arithmetic, equivalence, graphical interpretation, and improper versus proper fraction skills) that sequentially form a storyline related to the introduction.",
      "Each of the physical components will be divided into logical groups (called virtual instruments) in which each logical group will be formatted as an IDFS data set.",
      "The purpose of the Space Fractions system is to process player inputs during gameplay, specifically for calculating spaceship velocity adjustments based on fraction inputs. ",
      "The Requirement Numbers are a combination of target Advanced Traffic Management System (ATMS) and sequential within a given functional area.",
      "The output from this component consists of plot-based questions that incorporate fractions, tailored to both challenge the player's mathematical skills and advance the game's narrative."
    ]
  },
  {
    "text": "The output of this process is the adjusted velocity of the spaceship, represented as a decimal value.",
    "id": [
      266,
      261,
      268,
      245,
      230,
      237,
      265,
      233,
      232,
      595
    ],
    "example": [
      "If the input is valid, the Space Fractions system calculates the velocity adjustment by converting the fraction into a decimal value and applying it to the spaceship's current velocity.",
      "The purpose of the Space Fractions system is to process player inputs during gameplay, specifically for calculating spaceship velocity adjustments based on fraction inputs. ",
      "This adjusted velocity is applied to the game's physics engine to update the spaceship's speed in real-time.",
      "To start the Space Fractions system, the user will click on the corresponding button.",
      "The Space Fractions system will have an introductory movie to set up the storyline.",
      "The user's score must be kept as local data within the Space Fractions system so that the results may be given at the end of the Space Fractions system.",
      "Upon receiving the fraction inputs, the Space Fractions system will validate the integrity and format of the data to ensure they are integers and that the denominator is not zero.",
      "The Space Fractions system will have an ending scene where the user's score is calculated and ranked, with an option to quit the system or try again.",
      "The Space Fractions system will have a series of fraction questions (testing arithmetic, equivalence, graphical interpretation, and improper versus proper fraction skills) that sequentially form a storyline related to the introduction.",
      "The Correlator Monitor and Control is a critical component in the Astronomical data path."
    ]
  },
  {
    "text": "The output timing is immediate, ensuring responsive gameplay. The range of output values is determined by the game's physics rules and the maximum and minimum velocity constraints set within the Space Fractions system.",
    "id": [
      268,
      261,
      264,
      252,
      795,
      314,
      315,
      307,
      1144,
      598
    ],
    "example": [
      "This adjusted velocity is applied to the game's physics engine to update the spaceship's speed in real-time.",
      "The purpose of the Space Fractions system is to process player inputs during gameplay, specifically for calculating spaceship velocity adjustments based on fraction inputs. ",
      "The source of these inputs is the player's interaction with the game's user interface during specific gameplay moments that require velocity adjustment.",
      "The systemplay will be dynamic and adaptive to provide different storylines based on the user's progress.",
      "The Tactical Control System shall permit dynamic mission and payload retasking during all phases of operational mission execution.",
      "This file contains the updated question data, structured in a format that the system sequence can dynamically read and incorporate into the gameplay.",
      "This system allows for real-time updates to the game's content without the need for system restarts or interruptions, enabling a seamless integration of new or revised educational material into the game sequence.",
      "Its primary function is to facilitate the updating and editing of questions within the system sequence, ensuring that the game's educational content remains current, accurate, and engaging for players. By providing an easy-to-use interface for content modification, this tool supports the game's adaptability and longevity in educational settings.",
      "The Tactical Control System HCI shall provide continuously-available, on-screen control functions for time and missioncritical operations, to include as a minimum print, freeze, declassification, mark VCR, declutter, cease RF transmission.",
      "The ultimate ease of use and flexibility of the correlator is rooted in the Correlator Monitor and Control System software."
    ]
  },
  {
    "text": "The system continuously listens for a mouse click event during the playback.",
    "id": [
      285,
      272,
      561,
      1049,
      238,
      275,
      620,
      500,
      549,
      587
    ],
    "example": [
      "The system remains in a passive listening state until an input is received in the form of a mouse click on one of the menu options.",
      "The primary input for this component is the user's interaction in the form of a mouse click. ",
      "The Correlator Monitor and Control System shall process and transfer dynamic control data and monitor data.",
      "The Tactical Control System shall monitor the uplink and downlink to each UAV under its control.",
      "Input will consist entirely of mouse clicks for the user to choose answer options and to set preferences.",
      "If a click is detected, the movie is immediately terminated, and the system transitions the user to the game's main menu, bypassing the rest of the movie. If no click is registered, the movie plays in its entirety, after which the Space Fractions system automatically proceeds to the main menu.",
      "Each computer system in the Correlator Monitor and Control System shall have a hardware based watchdog timer configured to reboot the EVLA Correlator Monitor and Control System in the case of a system hang.",
      "The CCTNS system must be able to perform a simple search within 5-8 seconds and a advanced search (multiple search criteria) within 10-15 seconds regardless of the storage capacity or number of cases in the CCTNS system.",
      "The CCTNS system should ensure high scalability and performance through displaying of records on the screen in batches/paged manner. ",
      "All use of the Correlator Monitor and Control System will be through the VCI or Master Correlator Control Computer."
    ]
  },
  {
    "text": "If the player opts to start the Space Fractions system, the system transitions to the game sequence, where gameplay begins immediately. ",
    "id": [
      274,
      283,
      245,
      261,
      278,
      279,
      286,
      291,
      233,
      275
    ],
    "example": [
      "As soon as the player enters the introductory movie component, the movie begins to play automatically.",
      "One button initiates the game, leading players directly into the gameplay experience.",
      "To start the Space Fractions system, the user will click on the corresponding button.",
      "The purpose of the Space Fractions system is to process player inputs during gameplay, specifically for calculating spaceship velocity adjustments based on fraction inputs. ",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page.",
      "The primary function of the system sequence is to engage players with a series of multiple-choice questions focused on fractions. These questions are integrated within a storyline that naturally follows the introductory narrative of the game.",
      "The Space Fractions system will have an ending scene where the user's score is calculated and ranked, with an option to quit the system or try again.",
      "If a click is detected, the movie is immediately terminated, and the system transitions the user to the game's main menu, bypassing the rest of the movie. If no click is registered, the movie plays in its entirety, after which the Space Fractions system automatically proceeds to the main menu."
    ]
  },
  {
    "text": "This sequence is designed to challenge and educate players on fractions while advancing the plot, thereby keeping the educational content engaging and contextually relevant.",
    "id": [
      291,
      295,
      294,
      270,
      304,
      297,
      271,
      252,
      307,
      317
    ],
    "example": [
      "The primary function of the system sequence is to engage players with a series of multiple-choice questions focused on fractions. These questions are integrated within a storyline that naturally follows the introductory narrative of the game.",
      "The output from this component consists of plot-based questions that incorporate fractions, tailored to both challenge the player's mathematical skills and advance the game's narrative.",
      "The system sequence includes \"critical points\" where the storyline can diverge based on whether the player answers these pivotal questions correctly, adding an element of narrative depth and personalization to the gameplay experience.",
      "The introductory movie serves to immerse players into the game's universe, setting the stage for the storyline and providing critical information to assist users in solving fraction-related puzzles.",
      "The dynamic nature of the conclusion serves to emphasize the educational progress and decisions of the player, offering a personalized ending that varies from one session to another based on the player's performance.",
      "his scene not only showcases the player's overall score but also offers a narrative conclusion that ties directly back to the choices made during gameplay, reinforcing the impact of educational achievements within the game's context.",
      "This engaging start is designed to enhance understanding and interest in the game's educational objectives.",
      "The systemplay will be dynamic and adaptive to provide different storylines based on the user's progress.",
      "Its primary function is to facilitate the updating and editing of questions within the system sequence, ensuring that the game's educational content remains current, accurate, and engaging for players. By providing an easy-to-use interface for content modification, this tool supports the game's adaptability and longevity in educational settings.",
      "These projects are organized by mathematical topics, such as fractions, to complement and enhance the learning experience within the game. "
    ]
  },
  {
    "text": "Players interact with this component by responding to the displayed questions.",
    "id": [
      293,
      292,
      263,
      295,
      291,
      248,
      300,
      247,
      284,
      314
    ],
    "example": [
      "If the player selects the correct answer, a confirmation message is displayed, and the component transitions to the next question, maintaining engagement and providing positive reinforcement.",
      "The interaction involves selecting their answer from a set of multiple-choice options provided for each question. ",
      "The inputs will consist of fractions entered by the player using the game's interface. ",
      "The output from this component consists of plot-based questions that incorporate fractions, tailored to both challenge the player's mathematical skills and advance the game's narrative.",
      "The primary function of the system sequence is to engage players with a series of multiple-choice questions focused on fractions. These questions are integrated within a storyline that naturally follows the introductory narrative of the game.",
      "These questions will test the user's knowledge of basic fraction operations and will be presented as a multiple-choice questionnaire.",
      "The component actively listens for the player's input and, upon selection, proceeds according to the player's decision.",
      "Next, the user progresses through a series of questions in the form of cartoon images that comprise the main story.",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "This file contains the updated question data, structured in a format that the system sequence can dynamically read and incorporate into the gameplay."
    ]
  },
  {
    "text": "This method ensures a straightforward and accessible approach for users to demonstrate their understanding and apply their knowledge of fractions.",
    "id": [
      301,
      450,
      403,
      672,
      355,
      309,
      310,
      307,
      409,
      325
    ],
    "example": [
      "This process is designed to be straightforward and user-friendly, ensuring a smooth transition to the player's chosen next step.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "The CCTNS system must provide End User and Administrator functions which are easy to use and intuitive throughout.",
      "Software shall be written in a style that is easily readable and using practices that allow for minimal confusion.",
      "It makes reporting easy for police by enabling them to execute different types of queries such as monthly reporting, RTI related etc.",
      "This design allows for the efficient input of new data or modifications to existing questions. ",
      "Each question is managed on a separate page within the tool, and navigation between questions is streamlined through the use of a button to progress from one question to the next, ensuring a smooth and organized content update process.",
      "Its primary function is to facilitate the updating and editing of questions within the system sequence, ensuring that the game's educational content remains current, accurate, and engaging for players. By providing an easy-to-use interface for content modification, this tool supports the game's adaptability and longevity in educational settings.",
      "The user interfaces should be designed to make them user-intuitive.",
      "This functionality facilitates a seamless integration of supplemental educational resources, ensuring that players have the opportunity to engage with a broader range of topics and materials at their own pace."
    ]
  },
  {
    "text": "For incorrect answers, the player is informed of the mistake and given another opportunity to answer the question, albeit without the possibility of earning points for that question, fostering a learning environment that encourages understanding through trial and error.",
    "id": [
      293,
      292,
      267,
      256,
      269,
      304,
      466,
      249,
      239,
      300
    ],
    "example": [
      "If the player selects the correct answer, a confirmation message is displayed, and the component transitions to the next question, maintaining engagement and providing positive reinforcement.",
      "The interaction involves selecting their answer from a set of multiple-choice options provided for each question. ",
      "The processing includes error handling for invalid inputs, such as displaying an error message to the player and requesting a new input.",
      "Either way, the user will be encouraged to try again and further better their fraction skills.",
      "In cases of invalid inputs, the output is an error message displayed on the user interface, guiding the player to provide a valid fraction.",
      "The dynamic nature of the conclusion serves to emphasize the educational progress and decisions of the player, offering a personalized ending that varies from one session to another based on the player's performance.",
      "Providing alternatives to frame-based presentation: If frames are used, an alternative way of presenting relevant information without frames should be provided.",
      "The user will be given a problem and then must click the correct solution.",
      "Output will be sounds and animations through Flash movies to acknowledge success or failure in answering the fraction questions.",
      "The component actively listens for the player's input and, upon selection, proceeds according to the player's decision."
    ]
  },
  {
    "text": "After completing a predetermined set of questions, the player is directed to the concluding scene of the game, providing closure to the educational journey.",
    "id": [
      304,
      291,
      298,
      270,
      247,
      293,
      297,
      299,
      271,
      295
    ],
    "example": [
      "The dynamic nature of the conclusion serves to emphasize the educational progress and decisions of the player, offering a personalized ending that varies from one session to another based on the player's performance.",
      "The primary function of the system sequence is to engage players with a series of multiple-choice questions focused on fractions. These questions are integrated within a storyline that naturally follows the introductory narrative of the game.",
      "Additionally, it presents players with the option to either conclude their current session or navigate back to the main menu for further exploration or replay.",
      "The introductory movie serves to immerse players into the game's universe, setting the stage for the storyline and providing critical information to assist users in solving fraction-related puzzles.",
      "Next, the user progresses through a series of questions in the form of cartoon images that comprise the main story.",
      "If the player selects the correct answer, a confirmation message is displayed, and the component transitions to the next question, maintaining engagement and providing positive reinforcement.",
      "his scene not only showcases the player's overall score but also offers a narrative conclusion that ties directly back to the choices made during gameplay, reinforcing the impact of educational achievements within the game's context.",
      "Upon reaching the ending scene, the system momentarily pauses to allow the player to make their choice between continuing their exploration of the game's content by returning to the main menu or concluding their session by exiting the game.",
      "This engaging start is designed to enhance understanding and interest in the game's educational objectives.",
      "The output from this component consists of plot-based questions that incorporate fractions, tailored to both challenge the player's mathematical skills and advance the game's narrative."
    ]
  },
  {
    "text": "Additionally, the sequence customizes the storyline's progression based on the player's performance at critical junctures, offering a dynamic and personalized gaming experience.",
    "id": [
      294,
      252,
      304,
      296,
      264,
      290,
      291,
      297,
      278,
      270
    ],
    "example": [
      "The system sequence includes \"critical points\" where the storyline can diverge based on whether the player answers these pivotal questions correctly, adding an element of narrative depth and personalization to the gameplay experience.",
      "The systemplay will be dynamic and adaptive to provide different storylines based on the user's progress.",
      "The dynamic nature of the conclusion serves to emphasize the educational progress and decisions of the player, offering a personalized ending that varies from one session to another based on the player's performance.",
      "The ending scene serves as the culmination of the player's journey through the system, providing a conclusion to the storyline that reflects their performance across critical decision points. ",
      "The source of these inputs is the player's interaction with the game's user interface during specific gameplay moments that require velocity adjustment.",
      "This dual-path output allows for a customized experience that caters to the player's immediate preference, whether it be diving into the game or seeking additional information and resources.",
      "The primary function of the system sequence is to engage players with a series of multiple-choice questions focused on fractions. These questions are integrated within a storyline that naturally follows the introductory narrative of the game.",
      "his scene not only showcases the player's overall score but also offers a narrative conclusion that ties directly back to the choices made during gameplay, reinforcing the impact of educational achievements within the game's context.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "The introductory movie serves to immerse players into the game's universe, setting the stage for the storyline and providing critical information to assist users in solving fraction-related puzzles."
    ]
  },
  {
    "text": "Feedback is provided after each question to help players understand their performance and learn from their mistakes, reinforcing the educational goals of the game.",
    "id": [
      304,
      293,
      300,
      312,
      297,
      199,
      271,
      280,
      281,
      307
    ],
    "example": [
      "The dynamic nature of the conclusion serves to emphasize the educational progress and decisions of the player, offering a personalized ending that varies from one session to another based on the player's performance.",
      "If the player selects the correct answer, a confirmation message is displayed, and the component transitions to the next question, maintaining engagement and providing positive reinforcement.",
      "The component actively listens for the player's input and, upon selection, proceeds according to the player's decision.",
      "The tool then performs a validation check on the submitted data to ensure completeness and contextual relevance to the game's educational objectives.",
      "his scene not only showcases the player's overall score but also offers a narrative conclusion that ties directly back to the choices made during gameplay, reinforcing the impact of educational achievements within the game's context.",
      "At the end of the system, students will be given feedback based on their system scores.",
      "This engaging start is designed to enhance understanding and interest in the game's educational objectives.",
      "It offers a concise help section that guides players on how to engage with the game effectively and also includes links to both the primary game component and an external educational resource, the Denominators' web page.",
      "This menu aims to equip players with the necessary knowledge to start playing and offer additional learning resources, thereby enriching the overall game experience.",
      "Its primary function is to facilitate the updating and editing of questions within the system sequence, ensuring that the game's educational content remains current, accurate, and engaging for players. By providing an easy-to-use interface for content modification, this tool supports the game's adaptability and longevity in educational settings."
    ]
  },
  {
    "text": "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
    "id": [
      282,
      298,
      299,
      278,
      305,
      288,
      273,
      286,
      289,
      275
    ],
    "example": [
      "Players interact with the main menu through mouse clicks on specific buttons.",
      "Additionally, it presents players with the option to either conclude their current session or navigate back to the main menu for further exploration or replay.",
      "Upon reaching the ending scene, the system momentarily pauses to allow the player to make their choice between continuing their exploration of the game's content by returning to the main menu or concluding their session by exiting the game.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "Furthermore, this component offers a clear and direct pathway for the player to either revisit the game's content through the main menu or gracefully exit the game, thereby closing their current session.",
      "The output of interacting with the main menu is determined by the player's choice.",
      "This action allows players the option to skip the introductory movie at any point, facilitating a direct transition to the main menu of the game for those who prefer to dive straight into gameplay or who are revisiting the game and already familiar with its storyline.",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page.",
      "Alternatively, if the player selects the option to visit the Denominators' web page, the system facilitates this redirection, opening the web page either within the game environment or in a separate browser window, depending on the game's design and platform capabilities.",
      "If a click is detected, the movie is immediately terminated, and the system transitions the user to the game's main menu, bypassing the rest of the movie. If no click is registered, the movie plays in its entirety, after which the Space Fractions system automatically proceeds to the main menu."
    ]
  },
  {
    "text": "This simple, intuitive input method ensures that players of all ages and skill levels can easily make their selection without confusion or frustration.",
    "id": [
      301,
      325,
      287,
      323,
      403,
      307,
      246,
      290,
      315,
      409
    ],
    "example": [
      "This process is designed to be straightforward and user-friendly, ensuring a smooth transition to the player's chosen next step.",
      "This functionality facilitates a seamless integration of supplemental educational resources, ensuring that players have the opportunity to engage with a broader range of topics and materials at their own pace.",
      "This decision-making process ensures that the player's intent is accurately interpreted and the corresponding action is taken swiftly, maintaining a seamless transition from the menu to the player's selected activity.",
      "This ensures a smooth transition from the system to the external educational content, without disrupting the user's engagement or learning experience.",
      "The CCTNS system must provide End User and Administrator functions which are easy to use and intuitive throughout.",
      "Its primary function is to facilitate the updating and editing of questions within the system sequence, ensuring that the game's educational content remains current, accurate, and engaging for players. By providing an easy-to-use interface for content modification, this tool supports the game's adaptability and longevity in educational settings.",
      "The information and interface will be effective so that Bobby will easily recognize what to do to start the system immediately and Alice will have no problems navigating through the help section to understand the rules and systemplay.",
      "This dual-path output allows for a customized experience that caters to the player's immediate preference, whether it be diving into the game or seeking additional information and resources.",
      "This system allows for real-time updates to the game's content without the need for system restarts or interruptions, enabling a seamless integration of new or revised educational material into the game sequence.",
      "The user interfaces should be designed to make them user-intuitive."
    ]
  },
  {
    "text": "This step is crucial for maintaining the quality and integrity of the system content. Once the data passes the validation process, the update for that specific question is finalized.",
    "id": [
      34,
      312,
      540,
      574,
      541,
      311,
      561,
      615,
      111,
      542
    ],
    "example": [
      "Major changes to this document (e.g., changes in requirements) must be approved by the Director of the DigitalHomeOwner Division.",
      "The tool then performs a validation check on the submitted data to ensure completeness and contextual relevance to the game's educational objectives.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "Error and status messages will be provided in a concise time/location referenced format to upper system levels in a content controllable manner.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "Upon the completion of data entry for a question, the administrator will use a submission button to initiate the update process.",
      "The Correlator Monitor and Control System shall process and transfer dynamic control data and monitor data.",
      "It is desired that the state of the correlator hardware be available through interrogation across the CMIB bus for monitoring and fault tolerance.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server."
    ]
  },
  {
    "text": "Players interact with the Math Umbrella through a series of links.",
    "id": [
      316,
      284,
      321,
      317,
      280,
      229,
      320,
      318,
      263,
      286
    ],
    "example": [
      "The Math Umbrella component is designed to serve as an educational resource hub within the system, providing players with easy access to a curated selection of external S2S projects that are specifically tailored to sixth graders. ",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "Upon the player's selection of a link, the Math Umbrella component momentarily pauses to process this action.",
      "These projects are organized by mathematical topics, such as fractions, to complement and enhance the learning experience within the game. ",
      "It offers a concise help section that guides players on how to engage with the game effectively and also includes links to both the primary game component and an external educational resource, the Denominators' web page.",
      "The umbrella will be a singular component, providing links to projects relating to fractions, decimals, and percents in a format accessible over the World Wide Web.",
      "Each link corresponds to a different S2S project, allowing players to choose which external resources they wish to explore based on their interests or areas where they seek further understanding.",
      "This component aims to extend the educational value of the system by integrating additional, topic-relevant resources that support and deepen the player's understanding of mathematics.",
      "The inputs will consist of fractions entered by the player using the game's interface. ",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page."
    ]
  },
  {
    "text": "CRIME &amp; CRIMINAL TRACKING NETWORK AND SYSTEMS (CCTNS)",
    "id": [
      356,
      383,
      535,
      353,
      83,
      520,
      399,
      538,
      529,
      1198
    ],
    "example": [
      "The Citizen Interface module of the CCTNS acts as a conduit for the information exchange between citizens and police units/personnel.",
      "The CCTNS system should be able to provide reports for actions on cases organised by workstation and (where technically appropriate) by network address.",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "Using the search functionality, police personnel can search for a particular person, type of crime, modus operandi, property etc.",
      "The DigitalHome security system consists of contact sensors and a set security alarms.",
      "The CCTNS system should be designed to have satisfactory performance even in Police Stations connected on low-bandwidth ",
      "The CCTNS system must be able to display several entities (cases, suspects) simultaneously.",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries.",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "The Center shall support the following information about network device status, including network identifier, number of DMSs, number of LCSs, DMS status data, LCS status data and CCTV status data."
    ]
  },
  {
    "text": "CCTNS V1.0 functionality is designed to focus on delivering value to IOs, records room staff and citizens within the broad crime investigation area.",
    "id": [
      342,
      344,
      519,
      545,
      356,
      399,
      527,
      520,
      529,
      549
    ],
    "example": [
      "The key guiding principle behind the functional design of CCTNS V1.0 is to focus on the critical functionality that provides value to the police personnel at the cutting edge which in turn can improve the outcomes in the areas of “Investigation of Crime” and “Detection of Criminals”.",
      "The functionality of the CCTNS application is focused on providing value to the police personnel, especially the officers operating at the cutting edge and easing the day to day operations of the police function.",
      "The CCTNS system should work even in an offline mode with the critical functionality ",
      "The CCTNS system should ensure high scalability and performance through using of AJAX based technology to improve user experience.",
      "The Citizen Interface module of the CCTNS acts as a conduit for the information exchange between citizens and police units/personnel.",
      "The CCTNS system must be able to display several entities (cases, suspects) simultaneously.",
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "The CCTNS system should be designed to have satisfactory performance even in Police Stations connected on low-bandwidth ",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "The CCTNS system should ensure high scalability and performance through displaying of records on the screen in batches/paged manner. "
    ]
  },
  {
    "text": "It improves overall productivity by helping citizens and police to cut short the drudgery of large amounts of paperwork.",
    "id": [
      344,
      360,
      342,
      355,
      357,
      346,
      358,
      349,
      520,
      345
    ],
    "example": [
      "The functionality of the CCTNS application is focused on providing value to the police personnel, especially the officers operating at the cutting edge and easing the day to day operations of the police function.",
      "It shows information such as cases assigned, alerts, pending tasks etc hence helping police personnel to plan better and execute with greater efficiency.",
      "The key guiding principle behind the functional design of CCTNS V1.0 is to focus on the critical functionality that provides value to the police personnel at the cutting edge which in turn can improve the outcomes in the areas of “Investigation of Crime” and “Detection of Criminals”.",
      "It makes reporting easy for police by enabling them to execute different types of queries such as monthly reporting, RTI related etc.",
      "Citizens can use it as a tool to get information or acknowledgements from police.",
      "The Registration module acts as an interface between the police and citizens and it eases the approach, interaction and information exchange between police and complainants.",
      "The police in turn can use it to respond to citizens with very little turnaround time.",
      "Interfacing with the courts during the prosecution of cases is an integral part of the responsibilities of police personnel.",
      "The CCTNS system should be designed to have satisfactory performance even in Police Stations connected on low-bandwidth ",
      "Citizens can register their complaints with police and then based on the evidence, facts and following investigation, police shall take the complaint forward."
    ]
  },
  {
    "text": "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
    "id": [
      365,
      369,
      412,
      414,
      366,
      402,
      368,
      450,
      409,
      433
    ],
    "example": [
      "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
      "Application user interfaces to meet its requirements and recommendations.",
      "User interfaces should meet its requirements and recommendations.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "The solution should enable the help-desk user to view the reports on the submitted defects or enhancement requests category-wise, status-wise, and age- wise.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "The user interfaces should be designed to make them user-intuitive.",
      "Acceptable opening / download times: Application pages should be designed and implemented so that there are acceptable opening times and download times for the expected range of technical contexts of use (e.g."
    ]
  },
  {
    "text": "The solution should enable the user to track the submitted defect or enhancement request.",
    "id": [
      366,
      368,
      249,
      367,
      365,
      369,
      439,
      1228,
      581,
      401
    ],
    "example": [
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The solution should enable the help-desk user to view the reports on the submitted defects or enhancement requests category-wise, status-wise, and age- wise.",
      "The user will be given a problem and then must click the correct solution.",
      "The solution should send alerts (e.g., email, SMS) to the user if the user chooses to whenever any action has been taken on the alert.",
      "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "The user shall be provided with the capability to select a network identifier for a device command/control request.",
      "The ability to attempt recovery from failure or hot-swapped hardware devices will be built into this system.",
      "Such configurations must be saved in the user profile."
    ]
  },
  {
    "text": "This functionality can be used by external auditors who wish to examine or analyse system activity.",
    "id": [
      591,
      562,
      774,
      641,
      908,
      581,
      837,
      973,
      615,
      1158
    ],
    "example": [
      "Engineers and technicians will need tools to inspect and monitor individual CMIB layer devices from remote locations and have the ability to fault trace to a specific hot-swappable subsystem.",
      "The Correlator Monitor and Control System shall perform limited amounts of real-time data processing and probing such as providing tools to collect and display auto correlation products.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring.",
      "It will be capable of detecting, reporting on and automatically taking action to remedy or lessen the impact of the following types of abnormal conditions: processor hardware failure, operating system hangs or crashes, temperature or voltage deviations, computational performance below minimum specifications, computational error rates above maximum specification, internal communications failures.",
      "External storage can be utilized for this purpose.",
      "The ability to attempt recovery from failure or hot-swapped hardware devices will be built into this system.",
      "The Tactical Control System shall have the capability to control and monitor multiple types of AVs.",
      "The Tactical Control System shall allow an Authorized Operator to execute a software debug capability and view the resulting debug diagnostic information.",
      "It is desired that the state of the correlator hardware be available through interrogation across the CMIB bus for monitoring and fault tolerance.",
      "The software is being designed so that multiple instances of a building block can be deployed by simply “configuring” the building block of operation within a specific agency."
    ]
  },
  {
    "text": "The CCTNS system should allow a user to stipulate which other users or groups can access cases.",
    "id": [
      388,
      386,
      383,
      399,
      395,
      382,
      523,
      387,
      529,
      530
    ],
    "example": [
      "The CCTNS system must allow a user to be a member of more than one group.",
      "The CCTNS system must allow the user to limit access to cases to specified users or user groups.",
      "The CCTNS system should be able to provide reports for actions on cases organised by workstation and (where technically appropriate) by network address.",
      "The CCTNS system must be able to display several entities (cases, suspects) simultaneously.",
      "If the CCTNS system allows users to make unauthorised attempts to access cases, it must log these in the audit trail.",
      "The CCTNS system must be able to capture and store violations (i.e.A user’s attempts to access a case to which he is denied access), and (where violations can validly be attempted) attempted violations, of access control mechanisms.",
      "The CCTNS system should be built on a common User Access and Authentication Service to ensure Single-Sign on for the end-user ",
      "The CCTNS system should provide for role-based control for the functionality within the CCTNS system ",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "The CCTNS system should support multi-tier authentication where required "
    ]
  },
  {
    "text": "Ideally, each error message will be accompanied by explanatory text and an indication of the action(s) which the user can take in response to the error.",
    "id": [
      436,
      367,
      437,
      267,
      269,
      105,
      574,
      397,
      439,
      1109
    ],
    "example": [
      "Providing clear error messages: The content of error messages shown on the pages or special error pages should clearly state the reason why the error occurred and, if possible, actions the user can take to resolve the error.",
      "The solution should send alerts (e.g., email, SMS) to the user if the user chooses to whenever any action has been taken on the alert.",
      "Users expect error messages to be in the same language as the user interface.",
      "The processing includes error handling for invalid inputs, such as displaying an error message to the player and requesting a new input.",
      "In cases of invalid inputs, the output is an error message displayed on the user interface, guiding the player to provide a valid fraction.",
      "All DigitalHome operations shall incorporate exception handling so that the system responds to a user with a clear, descriptive message when an error or an exceptional condition occurs.",
      "Error and status messages will be provided in a concise time/location referenced format to upper system levels in a content controllable manner.",
      "All error messages produced by the CCTNS system must be meaningful, so that they can be appropriately acted upon by the users who are likely to see them.",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "The Tactical Control System operator shall be required to enter an acknowledgment prior to disabling the display of critical warning flags for any AV, Payload, ADT, GDT, and Tactical Control System faults."
    ]
  },
  {
    "text": "Minimizing navigation effort: The number of navigation steps needed to reach a certain piece of content should be minimized as long as different mental models, navigation strategies and tasks of the user are taken into account.",
    "id": [
      464,
      430,
      423,
      427,
      447,
      422,
      489,
      452,
      482,
      487
    ],
    "example": [
      "Using frames with care: If frames are used, care should be taken to avoid possible problems, for example, those involving the use of the back button, bookmarking of pages, or scrolling of information.",
      "Horizontal scrolling should be avoided wherever possible.",
      "If a splash screen is used, a navigation option to skip it should be offered.",
      "They could make it cognitively more difficult to understand the navigation structure with negative effects on both usability and accessibility.",
      "Avoiding link overload: Text pages containing large proportions of links should be formatted so that the presence of links does not impede the readability of the text.",
      "Splash screens should be avoided unless they provide useful content or feedback about the application state to the user.",
      "Taking account of the users’ tasks and information needs: When providing different access paths or navigation structures for different user groups, the tasks and information needs of these user groups should be taken into consideration.",
      "Distinguishing navigation links from controls: Navigation links should be clearly distinguishable from controls activating some action.",
      "Consistency between navigation components and content: If navigation components (or overviews) are shown in conjunction with associated content, consistency between the navigation component and the content shown should be maintained by indicating in the navigation component (e.g.",
      "individualization designing content and navigation differently for varying user groups or roles i.e."
    ]
  },
  {
    "text": "Designing for input device independence: User interfaces should be designed to allow activation of controls by a variety of input devices.",
    "id": [
      414,
      409,
      432,
      402,
      486,
      485,
      400,
      438,
      412,
      407
    ],
    "example": [
      "User interfaces should meet its requirements and recommendations.",
      "The user interfaces should be designed to make them user-intuitive.",
      "Making user interfaces robust: User interfaces should be designed to be as robust as possible in the face of changing technology.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "User adaptation can also be important for making the user interface more accessible.",
      "The interfaces must be made customizable or user-configurable to the extent possible.(e.g., the displayed columns in the table, move, resize, modify the appearance).",
      "Using appropriate formats, units of measurement or currency: When designing user interfaces for use by diverse groups, input and output of information elements such as currency, units of measurement, temperatures, date and time, phone numbers, address or postal codes should be designed so that they are usable.",
      "Application user interfaces to meet its requirements and recommendations.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it."
    ]
  },
  {
    "text": "The ability to choose between different input devices for activating controls such as links, fields and buttons is important both for users who prefer a certain input mode, mobile users and users with disabilities.",
    "id": [
      486,
      485,
      489,
      438,
      402,
      439,
      409,
      450,
      431,
      93
    ],
    "example": [
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "User adaptation can also be important for making the user interface more accessible.",
      "Taking account of the users’ tasks and information needs: When providing different access paths or navigation structures for different user groups, the tasks and information needs of these user groups should be taken into consideration.",
      "Using appropriate formats, units of measurement or currency: When designing user interfaces for use by diverse groups, input and output of information elements such as currency, units of measurement, temperatures, date and time, phone numbers, address or postal codes should be designed so that they are usable.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "The user interfaces should be designed to make them user-intuitive.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "In general, device independence can be achieved if the functionality is operable via a keyboard.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices "
    ]
  },
  {
    "text": "This encompasses being able to present content containing newer technologies by older user agents as well as designing content to be usable with future technologies.",
    "id": [
      485,
      486,
      28,
      490,
      432,
      1154,
      479,
      409,
      450,
      433
    ],
    "example": [
      "User adaptation can also be important for making the user interface more accessible.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "Making user profiles evident: If predefined user profiles or user-specified profiles are used for individualizing or adapting content, the profile currently used should be made evident.",
      "Making user interfaces robust: User interfaces should be designed to be as robust as possible in the face of changing technology.",
      "In order to create the Center-to-Center infrastructure, interfaces to the existing systems will be created.",
      "Appropriate content presentation also plays a key role in accessibility.",
      "The user interfaces should be designed to make them user-intuitive.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "Acceptable opening / download times: Application pages should be designed and implemented so that there are acceptable opening times and download times for the expected range of technical contexts of use (e.g."
    ]
  },
  {
    "text": "Minimizing user errors: Potential user errors as well as the effort needed to recover from errors should be minimized.",
    "id": [
      422,
      464,
      423,
      430,
      635,
      1115,
      1039,
      621,
      821,
      436
    ],
    "example": [
      "Splash screens should be avoided unless they provide useful content or feedback about the application state to the user.",
      "Using frames with care: If frames are used, care should be taken to avoid possible problems, for example, those involving the use of the back button, bookmarking of pages, or scrolling of information.",
      "If a splash screen is used, a navigation option to skip it should be offered.",
      "Horizontal scrolling should be avoided wherever possible.",
      "Personnel interested in error messages should be able to easily filter the error message stream.",
      "All Tactical Control System operator inputs shall be error checked such that any erroneous operator entry will not cause current processing to terminate.",
      "The Tactical Control System safety requirements are intended to eliminate as well as control potential hazards to equipment and personnel involved in the Tactical Control System.",
      "Reboots should result in minimal system interruptions with the offending CPU reconfiguring and returning to service autonomously.",
      "A de-clutter capability shall be provided that allows the operator to display only a selected number of the most significant threats.",
      "Providing clear error messages: The content of error messages shown on the pages or special error pages should clearly state the reason why the error occurred and, if possible, actions the user can take to resolve the error."
    ]
  },
  {
    "text": "Typical action types in user interfaces include manipulating application data, performing searches, communication actions, such as opening a new e-mail window or starting a chat function, and presentation-related actions, such as sorting a list of search results.",
    "id": [
      485,
      486,
      439,
      308,
      272,
      435,
      400,
      412,
      915,
      286
    ],
    "example": [
      "User adaptation can also be important for making the user interface more accessible.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "Administrators interact with the Question Updater through a user-friendly interface consisting of pulldown menus and text fields. ",
      "The primary input for this component is the user's interaction in the form of a mouse click. ",
      "This is particularly important for frequently accessed pages or pages that are important for user navigation and exploration, such as the home page.",
      "The interfaces must be made customizable or user-configurable to the extent possible.(e.g., the displayed columns in the table, move, resize, modify the appearance).",
      "Application user interfaces to meet its requirements and recommendations.",
      "Annotation includes operator generated comments as well as graphics which are superimposed on the imagery.",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page."
    ]
  },
  {
    "text": "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient.",
    "id": [
      485,
      486,
      450,
      489,
      369,
      409,
      439,
      479,
      438,
      488
    ],
    "example": [
      "User adaptation can also be important for making the user interface more accessible.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "Taking account of the users’ tasks and information needs: When providing different access paths or navigation structures for different user groups, the tasks and information needs of these user groups should be taken into consideration.",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
      "The user interfaces should be designed to make them user-intuitive.",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "Appropriate content presentation also plays a key role in accessibility.",
      "Using appropriate formats, units of measurement or currency: When designing user interfaces for use by diverse groups, input and output of information elements such as currency, units of measurement, temperatures, date and time, phone numbers, address or postal codes should be designed so that they are usable.",
      "such as employees of different levels, citizens etc, monitoring the user’s behaviour and adapting to the user’s goals that are inferred from the behaviour observed, recommending information that is potentially more relevant or interesting to the specific user, based on the behaviour of all users or a user group."
    ]
  },
  {
    "text": "Making individualization and adaptation evident: It should be made evident to the user when individualization and/or adaptation are used.",
    "id": [
      485,
      486,
      409,
      432,
      490,
      418,
      439,
      414,
      489,
      450
    ],
    "example": [
      "User adaptation can also be important for making the user interface more accessible.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "The user interfaces should be designed to make them user-intuitive.",
      "Making user interfaces robust: User interfaces should be designed to be as robust as possible in the face of changing technology.",
      "Making user profiles evident: If predefined user profiles or user-specified profiles are used for individualizing or adapting content, the profile currently used should be made evident.",
      "Making navigation self-descriptive: Navigation should be designed to help users understand where they are, where they have been and where they can go next.",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "User interfaces should meet its requirements and recommendations.",
      "Taking account of the users’ tasks and information needs: When providing different access paths or navigation structures for different user groups, the tasks and information needs of these user groups should be taken into consideration.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand."
    ]
  },
  {
    "text": "The CCTNS system is considered to be down if any user is unable to perform any normal System function and if this failure is attributed to any component of the CCTNS system other than the workstation.",
    "id": [
      642,
      607,
      774,
      104,
      744,
      498,
      586,
      772,
      371,
      773
    ],
    "example": [
      "The software part of the EVLA Correlator Monitor and Control System shall be able to perform without total system restart due to internal failure between system maintenance windows.",
      "There shall be a redundant communication path between the Master Correlator Control Computer and Correlator Power Control Computer to provide for remote reboot in the event of a networking or computing failure.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring.",
      "If the DigitalHome System fails (due to power loss, loss of internet access, or other software or hardware failure), the system recovery mechanism shall restore system data (configuration, default parameter settings, planning, and usage data) from the most recent backup.",
      "When the Tactical Control System software is halted due to an unplanned power interruption as well as abnormal program termination, then the Tactical Control System shall enter the Recovery Startup Mode upon application of power.",
      "In the event of any software or hardware failure, it must be possible to restore the CCTNS system (with inline synchronization) within no more than <xx> hours.",
      "Due to the more hardware specific connections and controls of the Correlator Power Control Computer, actions taken by external system upon hard failures are TBD.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct workstation and peripheral equipment maintenance.",
      "This includes actions taken by users or Administrators, or actions initiated automatically by the CCTNS system as a result of system parameters.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software upgrades."
    ]
  },
  {
    "text": "The CCTNS system should be designed for access through browser-based systems and must impose minimal requirements on the client device ",
    "id": [
      523,
      402,
      398,
      390,
      403,
      532,
      533,
      407,
      531,
      536
    ],
    "example": [
      "The CCTNS system should be built on a common User Access and Authentication Service to ensure Single-Sign on for the end-user ",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "The CCTNS system must employ a single set of user interface rules, or a small number of sets to provide a familiar and common look and feel for the application.",
      "The CCTNS system must allow changes to security attributes for groups or users (such as access rights, security level, privileges, password allocation and management) to be made only by super-user.",
      "The CCTNS system must provide End User and Administrator functions which are easy to use and intuitive throughout.",
      "The CCTNS system should use HTTPS as the communication protocol, i.e., HTTP over an encrypted secure socket layer (SSL) ",
      "The CCTNS system should run on multiple browsers.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "The CCTNS system should support SSL encrypted connections ",
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting."
    ]
  },
  {
    "text": "The CCTNS system should have capability to support public access to a subset of data and functionality ",
    "id": [
      540,
      541,
      535,
      527,
      387,
      517,
      529,
      383,
      538,
      539
    ],
    "example": [
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "The CCTNS system should provide for role-based control for the functionality within the CCTNS system ",
      "The CCTNS system should support multilingual interface ",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "The CCTNS system should be able to provide reports for actions on cases organised by workstation and (where technically appropriate) by network address.",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries.",
      "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs."
    ]
  },
  {
    "text": "The CCTNS system should support secure virtual private network connections ",
    "id": [
      531,
      535,
      529,
      527,
      532,
      523,
      541,
      540,
      542,
      530
    ],
    "example": [
      "The CCTNS system should support SSL encrypted connections ",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "The CCTNS system should use HTTPS as the communication protocol, i.e., HTTP over an encrypted secure socket layer (SSL) ",
      "The CCTNS system should be built on a common User Access and Authentication Service to ensure Single-Sign on for the end-user ",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The CCTNS system should support multi-tier authentication where required "
    ]
  },
  {
    "text": "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
    "id": [
      564,
      575,
      559,
      566,
      571,
      565,
      601,
      576,
      639,
      555
    ],
    "example": [
      "The format of the document follows that outlined in the IEEE STD 830 document, IEEE The VLA Expansion Project Correlator Monitor and Control System is responsible for correlator configuration, real time monitor/control, and hardware testing/servicing.",
      "Correlator configurations and control instructions will be received from the VLA Expansion Project Monitor and Control System system in a form suitable for translation by the Master Correlator Control Computer.",
      "The Correlator Monitor and Control System provides the physical link between the WIDAR Correlator hardware and the VLA Expansion Project monitor and control system.",
      "The Correlator Monitor and Control System will provide a level of abstraction to modularize the correlator system within the VLA Expansion Project environment.",
      "The Correlator monitor subsystem will provide VLA Expansion Project system wide access to all correlator system states including the Monitor and Control System supervisor system state.",
      "The Correlator Monitor and Control System exists as an integrated part of the overall VLA Expansion Project Monitor and Control Structure.",
      "It is assumed that all auxiliary data needed for real time update of correlator parameters will be provided directly by the VLA Expansion Project Monitor and Control System system or by dedicated servers.",
      "The translation will provide the correlator with specific goal oriented hardware configuration tables to satisfy the configuration requested by the A second interface with a human GUI will also allow for configuration of the correlator hardware, preferably through the same table structures used above.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "The primary goal of this document is to provide a complete and accurate list of requirements for the VLA Expansion Project Correlator Monitor and Control System."
    ]
  },
  {
    "text": "The Correlator Monitor and Control System shall monitor correlator and correlator subsystem health and take corrective action autonomously to recover from hardware and computing system faults.",
    "id": [
      774,
      640,
      585,
      757,
      641,
      620,
      561,
      644,
      584,
      1044
    ],
    "example": [
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring.",
      "The Correlator Monitor and Control System shall be self-monitoring.",
      "Watchdog processes and the Master Correlator Control Computer will likewise monitor Correlator Power Control Computer health.",
      "The Tactical Control System hardware and software shall execute periodic Fault Detection/Location (FD/L) while in the Normal Operations Mode and Training Mode, to include a periodic determination of level of interaction.",
      "It will be capable of detecting, reporting on and automatically taking action to remedy or lessen the impact of the following types of abnormal conditions: processor hardware failure, operating system hangs or crashes, temperature or voltage deviations, computational performance below minimum specifications, computational error rates above maximum specification, internal communications failures.",
      "Each computer system in the Correlator Monitor and Control System shall have a hardware based watchdog timer configured to reboot the EVLA Correlator Monitor and Control System in the case of a system hang.",
      "The Correlator Monitor and Control System shall process and transfer dynamic control data and monitor data.",
      "The EVLA Correlator Monitor and Control System shall be able to continue processing of all correlator configuration/control events until the queues of parameters are exhausted and external communications are restored.",
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction."
    ]
  },
  {
    "text": "The Correlator Monitor and Control System shall allow for easy system access to aid testing and debugging.",
    "id": [
      598,
      639,
      619,
      573,
      638,
      1075,
      640,
      403,
      692,
      1122
    ],
    "example": [
      "The ultimate ease of use and flexibility of the correlator is rooted in the Correlator Monitor and Control System software.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "The Correlator Monitor and Control System will be a fully observable system with the only limits placed on information access being those imposed by hardware, bandwidth, and/or security restrictions.",
      "Software shall be provided that allows an authorized user full access to all messaging, monitor, and control traffic.",
      "For each OUTRIDER system, the Tactical Control System shall provide full independent computer redundancy.",
      "The Correlator Monitor and Control System shall be self-monitoring.",
      "The CCTNS system must provide End User and Administrator functions which are easy to use and intuitive throughout.",
      "The Tactical Control System will operate in an open architecture and be capable of being hosted on computers that are typically supported by the using Service.",
      "The Tactical Control System shall provide the functionality to display all HCI elements on any available monitor on the Tactical Control System workstation."
    ]
  },
  {
    "text": "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
    "id": [
      1155,
      1151,
      599,
      1076,
      541,
      631,
      535,
      540,
      542,
      109
    ],
    "example": [
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "This Center-to-Center infrastructure implements a repository for traffic data and provides a mechanism to exchange device control information between TMCs.",
      "Full access is required with a high level of data integration to provide the user with a logical and coherent interface.",
      "The Tactical Control System shall have sufficient throughput to support the processing requirements of the selected data link.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The Correlator Monitor and Control System processors shall be capable of meeting all data processing deadlines and anticipated future requirements The Correlator Monitor and Control System processors shall be capable of responding to correlator hardware inputs in a deterministic fashion with sufficient performance to avoid data loss, corruption or overflows.",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The DigitalHome web system shall provide for authentication and information encryption through a recognized reliable and effective security technology, such as Transport Layer Security."
    ]
  },
  {
    "text": "The ability of the Correlator System to achieve and maintain high reliability and uptime will be vitally dependent upon reliable operation and rapid diagnosis and repair of faults in the hardware and software systems.",
    "id": [
      597,
      581,
      631,
      584,
      586,
      630,
      773,
      615,
      101,
      627
    ],
    "example": [
      "The ultimate determiner of a reliable and available correlator is dependent on the stability of the Functionality needs to be modularized to provide the easiest means of fault detection and repair.",
      "The ability to attempt recovery from failure or hot-swapped hardware devices will be built into this system.",
      "The Correlator Monitor and Control System processors shall be capable of meeting all data processing deadlines and anticipated future requirements The Correlator Monitor and Control System processors shall be capable of responding to correlator hardware inputs in a deterministic fashion with sufficient performance to avoid data loss, corruption or overflows.",
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "Due to the more hardware specific connections and controls of the Correlator Power Control Computer, actions taken by external system upon hard failures are TBD.",
      "This requirement is to allow correlator power monitoring and control to continue in the event of an Monitor and Control System network failure.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software upgrades.",
      "It is desired that the state of the correlator hardware be available through interrogation across the CMIB bus for monitoring and fault tolerance.",
      "The DigitalHome System must be highly reliable with no more than 1 failure per 10,000 hours of operation.",
      "The Correlator Power Control Computer shall be a high availability type general purpose computer capable of supporting a COTS operating system and have the ability to accept a large number of external hardware status signals either directly or through external interface hardware."
    ]
  },
  {
    "text": "Where applicable, all computers and peripherals shall be powered though UPS type devices with sufficient capacity for the computers to safely coordinate a system wide shutdown of the correlator hardware in the event of a prolonged power outage.",
    "id": [
      618,
      643,
      630,
      1075,
      1081,
      607,
      1048,
      756,
      947,
      498
    ],
    "example": [
      "The UPS devices need the ability to signal the Correlator Monitor and Control System when a power outage has occurred and keep the Correlator Monitor and Control System apprised of time remaining on backup power.",
      "The hardware part of the EVLA Correlator Monitor and Control System shall be able to perform indefinitely without complete loss of service, except in the event of total failure of primary and backup power.",
      "This requirement is to allow correlator power monitoring and control to continue in the event of an Monitor and Control System network failure.",
      "For each OUTRIDER system, the Tactical Control System shall provide full independent computer redundancy.",
      "The Tactical Control System shall be capable of restoring power in sufficient time to avoid loss of critical mission data and loss of air vehicle control during power outages.",
      "There shall be a redundant communication path between the Master Correlator Control Computer and Correlator Power Control Computer to provide for remote reboot in the event of a networking or computing failure.",
      "The Tactical Control System shall be capable of restoring power in sufficient time to avoid loss of air vehicle control during power outages.",
      "The operator shall have the capability to command the system to the Shutdown State from all modes under the Operations State.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate analog communication with peripheral devices.",
      "In the event of any software or hardware failure, it must be possible to restore the CCTNS system (with inline synchronization) within no more than <xx> hours."
    ]
  },
  {
    "text": "Error messages will be stamped with their discovery time, control messages will be stamped with their generation time.",
    "id": [
      637,
      636,
      574,
      589,
      939,
      267,
      436,
      800,
      801,
      954
    ],
    "example": [
      "Other message internal time stamps can be used as monitor/control parameters as deemed necessary.",
      "All messages passed between Correlator Monitor and Control System system layers shall have both UTC and wall clock time stamp information appropriate for the message type.",
      "Error and status messages will be provided in a concise time/location referenced format to upper system levels in a content controllable manner.",
      "The primary contact with array operations will be via status and error messages channeled through the Monitor and Control System.",
      "Where applicable, Tactical Control System data burst messages shall comply with Variable Message Formats.",
      "The processing includes error handling for invalid inputs, such as displaying an error message to the player and requesting a new input.",
      "Providing clear error messages: The content of error messages shown on the pages or special error pages should clearly state the reason why the error occurred and, if possible, actions the user can take to resolve the error.",
      "The Tactical Control System shall notify the operator of all discrepancies found during the mission plan check as well as indicate successful completion of the mission plan check.",
      "The Tactical Control System shall allow the operator to set the LOL delay timer(s) during mission planning.",
      "All erroneous messages that cannot be corrected by Tactical Control System shall be flagged to the operator."
    ]
  },
  {
    "text": "A Graphical User Interface shall be provided as an interface to the Correlator Monitor and Control System test software that allows for a convenient and configurable tool to access the Correlator Monitor and Control System remotely through the VCI.",
    "id": [
      1094,
      691,
      588,
      1100,
      1247,
      407,
      402,
      1107,
      1103,
      639
    ],
    "example": [
      "Tactical Control System software shall provide a windows based graphic operator interface.",
      "The software will provide a high resolution computer generated graphical user interface that enables a UAV operator trained on one system to control different types of UAVs or UAV payloads with a minimum of additional training.",
      "Software tools will be provided to assist the user at all access levels from system wide configuration and control to a low level CMIB command line instruction.",
      "The Tactical Control System software shall provide a high-resolution, computer-generated graphical user interface that enables a UAV operator trained on one system to control different types of UAVs as well as UAV payloads with minimal additional training.",
      "The Remote Control GUI shall be implemented using C/C++ and ESRI Map Objects.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "The Tactical Control System HCI shall be a Graphical User Interface (GUI) based on X-windows and Motif.",
      "Each control console shall have a display windows that presents the interface menus for workstation software.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system."
    ]
  },
  {
    "text": "All system processing and interconnect hardware shall be readily accessible for maintenance, repair, replacement and reconfiguration.",
    "id": [
      670,
      619,
      1075,
      647,
      638,
      1122,
      167,
      1065,
      142,
      663
    ],
    "example": [
      "Complete and comprehensible hardware systems specifications and configuration information shall be readily available.",
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "For each OUTRIDER system, the Tactical Control System shall provide full independent computer redundancy.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "Software shall be provided that allows an authorized user full access to all messaging, monitor, and control traffic.",
      "The Tactical Control System shall provide the functionality to display all HCI elements on any available monitor on the Tactical Control System workstation.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I's.",
      "All Tactical Control System users, operators, maintainers and other personnel having access to Tactical Control System shall be cleared to the highest sensitivity of the data that the Tactical Control System processes, stores and transfers.",
      "ASPERA-3 and MEX OA IDFS data and any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be provided to all ASPERA-3 Co-I’s.",
      "A system administrator shall have unrestricted access to all aspects of the EVLA Correlator Monitor and Control System."
    ]
  },
  {
    "text": "They should be organized such that all inputs and outputs can be simulated if necessary.",
    "id": [
      647,
      656,
      365,
      631,
      599,
      579,
      1076,
      1124,
      1122,
      1074
    ],
    "example": [
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "All users of the Correlator Monitor and Control System must be uniquely identified.",
      "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
      "The Correlator Monitor and Control System processors shall be capable of meeting all data processing deadlines and anticipated future requirements The Correlator Monitor and Control System processors shall be capable of responding to correlator hardware inputs in a deterministic fashion with sufficient performance to avoid data loss, corruption or overflows.",
      "Full access is required with a high level of data integration to provide the user with a logical and coherent interface.",
      "Data sample rates and contents will be fully controllable via either the VLA Expansion Project Monitor and Control System or the Backend processing controller.",
      "The Tactical Control System shall have sufficient throughput to support the processing requirements of the selected data link.",
      "The Tactical Control System shall provide full complementary control operations from the keyset as well as the X/Y control device (e.g., trackball, mouse, joystick).",
      "The Tactical Control System shall provide the functionality to display all HCI elements on any available monitor on the Tactical Control System workstation.",
      "The Tactical Control System hardware shall support the data rate characteristics of the AV, data link and payload to ensure interoperability."
    ]
  },
  {
    "text": "All software processes shall be killable, restartable, debuggable and testable with minimal impact on normal system operations.",
    "id": [
      1097,
      775,
      1096,
      1095,
      1075,
      653,
      762,
      573,
      579,
      621
    ],
    "example": [
      "Training software shall be alterable without affecting the configuration of the operational software.",
      "Functions, except for software upgrade and software debug, under the Maintenance Operations Mode shall operate concurrently without precluding or excluding any of the other functions in accordance with allowable operations as determined by the appropriate levels of interaction.",
      "The Tactical Control System’s operating system and executable software shall be re-programmable without hardware disassembly.",
      "The Tactical Control System software shall be non-proprietary and have unlimited data rights.",
      "For each OUTRIDER system, the Tactical Control System shall provide full independent computer redundancy.",
      "Seamlessness shall be accomplished in a manner that is seamless, in that it does not affect hardware modules or software functionality that it meets at interfaces.",
      "Functions under the Normal Operations Mode shall operate concurrently without precluding or excluding any of the other functions, in accordance with allowable operations as determined by the appropriate levels of interaction.",
      "The Correlator Monitor and Control System will be a fully observable system with the only limits placed on information access being those imposed by hardware, bandwidth, and/or security restrictions.",
      "Data sample rates and contents will be fully controllable via either the VLA Expansion Project Monitor and Control System or the Backend processing controller.",
      "Reboots should result in minimal system interruptions with the offending CPU reconfiguring and returning to service autonomously."
    ]
  },
  {
    "text": "In order to monitor all past access to the EVLA Correlator Monitor and Control System, all attempts to access the EVLA Correlator Monitor and Control System should be logged.",
    "id": [
      644,
      620,
      619,
      647,
      660,
      667,
      642,
      657,
      664,
      666
    ],
    "example": [
      "The EVLA Correlator Monitor and Control System shall be able to continue processing of all correlator configuration/control events until the queues of parameters are exhausted and external communications are restored.",
      "Each computer system in the Correlator Monitor and Control System shall have a hardware based watchdog timer configured to reboot the EVLA Correlator Monitor and Control System in the case of a system hang.",
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "Systems operations should be given unrestricted access to all aspects of the EVLA Correlator Monitor and Control System and should have the authority to grant and revoke privileges on a per-user basis.",
      "The EVLA Correlator Monitor and Control System shall continue operations, although not Description necessarily at full capacity, on all unaffected resources during partial shutdowns for maintenance, repair and/or upgrade.",
      "The software part of the EVLA Correlator Monitor and Control System shall be able to perform without total system restart due to internal failure between system maintenance windows.",
      "This could be done via a username and associated password scheme that would authenticate and authorize the user access to the EVLA Correlator Monitor and Control System and, if applicable, grant the user access to restricted or controlled parts of the EVLA Correlator Monitor and Control System.",
      "Each user shall have a set of system access properties that defines the user’s privileges within the EVLA Correlator Monitor and Control System.",
      "The administrator shall have the ability to block all access to the EVLA Correlator Monitor and Control System for all users or selectively by user."
    ]
  },
  {
    "text": "All users of the EVLA Correlator Monitor and Control System shall login using some form of unique identification.",
    "id": [
      656,
      647,
      664,
      619,
      638,
      663,
      660,
      1228,
      662,
      657
    ],
    "example": [
      "All users of the Correlator Monitor and Control System must be uniquely identified.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "Each user shall have a set of system access properties that defines the user’s privileges within the EVLA Correlator Monitor and Control System.",
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "Software shall be provided that allows an authorized user full access to all messaging, monitor, and control traffic.",
      "A system administrator shall have unrestricted access to all aspects of the EVLA Correlator Monitor and Control System.",
      "Systems operations should be given unrestricted access to all aspects of the EVLA Correlator Monitor and Control System and should have the authority to grant and revoke privileges on a per-user basis.",
      "The user shall be provided with the capability to select a network identifier for a device command/control request.",
      "All login attempts shall be done in a secure manner.",
      "This could be done via a username and associated password scheme that would authenticate and authorize the user access to the EVLA Correlator Monitor and Control System and, if applicable, grant the user access to restricted or controlled parts of the EVLA Correlator Monitor and Control System."
    ]
  },
  {
    "text": "The administrator shall have the ability to remove a user from the EVLA Correlator Monitor and Control System.",
    "id": [
      666,
      665,
      1222,
      1224,
      1225,
      642,
      657,
      664,
      756,
      897
    ],
    "example": [
      "The administrator shall have the ability to block all access to the EVLA Correlator Monitor and Control System for all users or selectively by user.",
      "The administrator shall have the ability to create and add a new user to the EVLA Correlator Monitor and Control System.",
      "The GUI shall allow a user to delete a previously entered incident.",
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "The software part of the EVLA Correlator Monitor and Control System shall be able to perform without total system restart due to internal failure between system maintenance windows.",
      "This could be done via a username and associated password scheme that would authenticate and authorize the user access to the EVLA Correlator Monitor and Control System and, if applicable, grant the user access to restricted or controlled parts of the EVLA Correlator Monitor and Control System.",
      "Each user shall have a set of system access properties that defines the user’s privileges within the EVLA Correlator Monitor and Control System.",
      "The operator shall have the capability to command the system to the Shutdown State from all modes under the Operations State.",
      "The operator shall be able to manually override the automatic mode selection of the selected data terminal, if desired."
    ]
  },
  {
    "text": "The administrator shall have the ability to edit a user’s system access properties.",
    "id": [
      665,
      18,
      664,
      17,
      638,
      619,
      366,
      308,
      1228,
      306
    ],
    "example": [
      "The administrator shall have the ability to create and add a new user to the EVLA Correlator Monitor and Control System.",
      "For example, a Master User shall be able to add a user account or change the default parameter settings.",
      "Each user shall have a set of system access properties that defines the user’s privileges within the EVLA Correlator Monitor and Control System.",
      "A Master user will be designated, who shall be able to change the configuration of the system.",
      "Software shall be provided that allows an authorized user full access to all messaging, monitor, and control traffic.",
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "Administrators interact with the Question Updater through a user-friendly interface consisting of pulldown menus and text fields. ",
      "The user shall be provided with the capability to select a network identifier for a device command/control request.",
      "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators."
    ]
  },
  {
    "text": "Tactical Control System (TCS) System/Subsystem Specification",
    "id": [
      724,
      996,
      994,
      977,
      1012,
      1006,
      993,
      1000,
      997,
      998
    ],
    "example": [
      "The Tactical Control System shall consist of the Tactical Control System workstation Hardware Configuration Items (HWCIs), TCS Computer Software Configuration Items (CSCIs), and additional TCS Support HWCIs and CSCIs.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS."
    ]
  },
  {
    "text": "This TACTICAL CONTROL SYSTEM (TCS) - SYSTEM / SUBSYSTEM SPECIFICATION (SSS) - VERSION 1.0 identifies, specifies, and establishes the detailed system requirements for the Tactical control system as set forth by the OPERATIONAL REQUIREMENTS DOCUMENT FOR THE UNMANNED AERIAL VEHICLE (UAV) TACTICAL CONTROL SYSTEM (TCS) - VERSION 5.0.",
    "id": [
      1091,
      785,
      724,
      797,
      996,
      732,
      994,
      997,
      998,
      992
    ],
    "example": [
      "The Tactical Control System core software shall be generically written to provide level one through level five interaction for both Outrider and Predator UAVs and establish the architecture for future tactical UAVs.",
      "The Tactical Control System Mission plan shall include all necessary information required to be interoperable with the service specific mission planning systems including the Tactical Aircraft Mission Planning System (TAMPS), Aviation Mission Planning System (AMPS), and Air Force Mission Support System (AFMSS).",
      "The Tactical Control System shall consist of the Tactical Control System workstation Hardware Configuration Items (HWCIs), TCS Computer Software Configuration Items (CSCIs), and additional TCS Support HWCIs and CSCIs.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall meet the applicable capability and characteristic criteria established by the Operational Requirements Document (ORD) CAF 003-90-I-A for the RQ-1A Predator Medium Altitude Endurance Unmanned Aerial Vehicle/System (MAE UAV) and the Close Range – Tactical Unmanned Aerial Vehicle (CR-TUAV).",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS."
    ]
  },
  {
    "text": "The Unmanned Aerial Vehicle Joint Project Office (UAV JPO) has undertaken development of a Tactical Control System for UAVs.",
    "id": [
      736,
      683,
      912,
      783,
      721,
      735,
      734,
      682,
      787,
      676
    ],
    "example": [
      "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System shall be capable of receiving secondary HAE UAV payload imagery.",
      "The Tactical Control System shall have the functionality to allow the operator to generate a UAV mission plan.",
      "The Tactical Control System will export and disseminate UAV imagery products, tactical communication messages, as well as mission plans and target coordinates.",
      "The Tactical Control System will provide direct receipt of imagery and/or data from UAV.",
      "The Tactical Control System will provide receipt and transmission of secondary imagery and/or data from UAV.",
      "The Tactical Control System will direct receipt of imagery and/or data from multiple UAV.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "These UAVs shall include the Tactical Unmanned Aerial Vehicle (TUAV) and the Medium Altitude and Endurance (MAE) UAV (henceforth referred to as Outrider and Predator respectively), their associated payloads, and other network communication systems."
    ]
  },
  {
    "text": "Phase 1 will be a 24 month period and will demonstrate Level 1 through Level 5 interaction (as defined below) in an Incremental and Evolutionary strategy as described in accordance with MIL-STD-498.",
    "id": [
      679,
      111,
      1091,
      566,
      678,
      749,
      766,
      729,
      565,
      564
    ],
    "example": [
      "Phase 1 is defined as the Program Definition and Risk Reduction phase, and Phase 2 is defined as the Engineering and Manufacturing Development phase in accordance with Department Of Defense Instruction (DODI) - 5000.2R.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "The Tactical Control System core software shall be generically written to provide level one through level five interaction for both Outrider and Predator UAVs and establish the architecture for future tactical UAVs.",
      "The Correlator Monitor and Control System will provide a level of abstraction to modularize the correlator system within the VLA Expansion Project environment.",
      "Design and development of the Tactical Control System will be conducted in two phases.",
      "Initialization of the Tactical Control System HWCIs shall include startup of HWCIs, download of software, startup of CSCIs, execution of Startup FD/L, and establishment of the state of readiness of all interfaces.",
      "In the Training Operations Mode the Tactical Control System shall support target coordinate development.",
      "The operational capabilities to be performed by the system will be determined by task analysis in accordance with MIL STD 1388 Task 401 as a guide based on a thorough understanding of Outrider and Predator mission requirements.",
      "The Correlator Monitor and Control System exists as an integrated part of the overall VLA Expansion Project Monitor and Control Structure.",
      "The format of the document follows that outlined in the IEEE STD 830 document, IEEE The VLA Expansion Project Correlator Monitor and Control System is responsible for correlator configuration, real time monitor/control, and hardware testing/servicing."
    ]
  },
  {
    "text": "The Tactical Control System consists of the software, software-related hardware and the extra ground support hardware necessary for the control of the Outrider, and the Predator UAV, and future tactical UAVs.",
    "id": [
      986,
      1001,
      993,
      997,
      998,
      787,
      1006,
      989,
      992,
      1086
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Trojan Spirit II.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links."
    ]
  },
  {
    "text": "The major focus of the Tactical Control System program is software.",
    "id": [
      989,
      1059,
      1086,
      986,
      694,
      993,
      1001,
      726,
      992,
      1092
    ],
    "example": [
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "These requirements pertain to the Tactical Control System computer hardware and software.",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System will provide software portability, scaleable functionality, and support for operational configurations tailored to the users’ needs.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Trojan Spirit II.",
      "The primary function of the Tactical Control System is to provide command and control of the payload, Air Vehicle (AV), data link, and other necessary support equipment in order to employ tactical UAVs to conduct reconnaissance, surveillance, target acquisition, and target identification missions.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System software shall provide the UAV operator with the necessary tools for computer related communications, mission tasking, mission planning, mission execution, data receipt, data processing, and data dissemination."
    ]
  },
  {
    "text": "Software developed will be Defense Information Infrastructure / Common Operating Environment (DII/COE) compliant, non-proprietary, and the architectural standard for all future tactical UAVs.",
    "id": [
      1091,
      1087,
      997,
      998,
      986,
      984,
      693,
      1001,
      999,
      992
    ],
    "example": [
      "The Tactical Control System core software shall be generically written to provide level one through level five interaction for both Outrider and Predator UAVs and establish the architecture for future tactical UAVs.",
      "The Tactical Control System shall have software based on Defense Information Infrastructure/Common Operating Environment per Assistant Secretary of Defense for Command, Control, Communications, and Intelligence (ASD(C3I)) Joint Technical Architecture (JTA).",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS.",
      "To the extent possible, the Tactical Control System will use standard Department of Defense (DoD) software components to achieve commonality.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Trojan Spirit II.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS."
    ]
  },
  {
    "text": "To the extent possible, the Tactical Control System will use standard DoD components in order to achieve commonality.",
    "id": [
      693,
      1014,
      1000,
      1006,
      994,
      999,
      992,
      986,
      997,
      998
    ],
    "example": [
      "To the extent possible, the Tactical Control System will use standard Department of Defense (DoD) software components to achieve commonality.",
      "The Tactical Control System shall have an interface between the Tactical Control System and DoD standard power supply equipment.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS."
    ]
  },
  {
    "text": "The Tactical Control System hardware must be scaleable or modular to meet varying Service needs.",
    "id": [
      1072,
      694,
      733,
      688,
      996,
      992,
      989,
      986,
      991,
      993
    ],
    "example": [
      "The hardware of the Tactical Control System shall be capable of being scaled as well as being modular to meet the varying needs of the Services.",
      "The Tactical Control System will provide software portability, scaleable functionality, and support for operational configurations tailored to the users’ needs.",
      "The Tactical Control System shall provide software capabilities and hardware configurations necessary to fulfill the operational tasking requirements across the 5 levels of interaction.",
      "Although developed as a total package, the Tactical Control System will be scaleable to meet the user's requirements for deployment.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS."
    ]
  },
  {
    "text": "The Tactical Control System will be connected with Advanced Field Artillery Tactical Data System (AFATDS).",
    "id": [
      715,
      716,
      710,
      888,
      705,
      986,
      712,
      702,
      717,
      992
    ],
    "example": [
      "The Tactical Control System will be connected with Army Mission Planning System (AMPS)",
      "The Tactical Control System will be connected with Air Force Mission Support System (AFMSS)",
      "The Tactical Control System will be connected with Joint Service Imagery Processing System – Air Force (JSIPS-AF)",
      "The Tactical Control System shall support a LOS data link and SATCOM data link capability.",
      "The Tactical Control System will be connected with Enhanced Tactical Radar Correlator (ETRAC)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System will be connected with Joint Surveillance Target Attack Radar System (JSTARS) Ground Station Module/Common",
      "The Tactical Control System will be connected with Automated Target Hand-off System (ATHS)",
      "The Tactical Control System will be connected with Tactical Aircraft Mission Planning System (TAMPS)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS."
    ]
  },
  {
    "text": "The Tactical Control System will be connected with Closed Circuit Television (CCTV)",
    "id": [
      988,
      1028,
      1026,
      936,
      931,
      881,
      836,
      980,
      699,
      948
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with CCTV.",
      "The Tactical Control System shall be able to route VCR recorded payload video to the C4I Interfaces.",
      "The Tactical Control System will provide an interface between the Tactical Control System and a video cassette recorder.",
      "The Tactical Control System shall have the capability to use cable to deliver live video imagery in multiple locations.",
      "The Tactical Control System shall be capable of entering DII-COE compliant (C4I) networks.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall transmit command and control information to the AV via the uplink to the AV, and receive AV telemetry and payload information via downlink from the AV.",
      "The Tactical Control System will be interoperable with C4I systems.",
      "The Tactical Control System will be capable of entering DII/COE compliant networks.",
      "The Tactical Control System will have the functionality to process received C4I messages and to prepare C4I messages for transmission."
    ]
  },
  {
    "text": "The Tactical Control System states shall not exist concurrently.",
    "id": [
      755,
      746,
      739,
      950,
      874,
      1012,
      933,
      1046,
      1036,
      1146
    ],
    "example": [
      "The Operations State modes shall not exist concurrently.",
      "Levels of interaction higher than those achievable by a particular Tactical Control System configuration shall be prohibited.",
      "The states of operation of the Tactical Control System shall include Startup, Operation, and Shutdown.",
      "The Tactical Control System shall create tactical communications messages.",
      "Current air vehicle design does not permit concurrent communications with two air vehicles at the same time.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall plan and conduct a mission.",
      "The Tactical Control System shall be designed such that no single hardware failure results in an unsafe command to be transmitted to the air vehicle.",
      "The Tactical Control System shall have an interface to an uninterruptible power supply.",
      "The Tactical Control System shall have an objective capability to be integrated and operated from tactical and command and control aircraft."
    ]
  },
  {
    "text": "In the Normal Operations Mode the Tactical Control System shall support target coordinate development.",
    "id": [
      766,
      758,
      763,
      759,
      933,
      764,
      976,
      760,
      754,
      1129
    ],
    "example": [
      "In the Training Operations Mode the Tactical Control System shall support target coordinate development.",
      "In the Normal Operations Mode the Tactical Control System shall support mission planning.",
      "In the Training Operations Mode the Tactical Control System shall support mission planning.",
      "In the Normal Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "The Tactical Control System shall plan and conduct a mission.",
      "In the Training Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "In the Normal Operations Mode the Tactical Control System shall support payload product management.",
      "When in the Operations State the Tactical Control System shall be capable of operating in three modes: normal operations mode, training operations mode, and maintenance operations mode.",
      "The Tactical Control System shall provide automated Tactical Control System system information, control options, and logical and simple operator guidance and support for immediate and adaptive responding to crisis situations."
    ]
  },
  {
    "text": "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform fault detection/location (FD/L).",
    "id": [
      774,
      772,
      773,
      771,
      769,
      770,
      757,
      967,
      968,
      966
    ],
    "example": [
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct workstation and peripheral equipment maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software upgrades.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct data link terminal maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct AV maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct payload maintenance.",
      "The Tactical Control System hardware and software shall execute periodic Fault Detection/Location (FD/L) while in the Normal Operations Mode and Training Mode, to include a periodic determination of level of interaction.",
      "Tactical Control System shall be capable of executing workstation and peripheral equipment maintenance software and displaying appropriate status results.",
      "Fault Detection/Location (FD/L) to the Line Replaceable Unit (LRU) level shall be provided to indicate the readiness status of Tactical Control System, if inherent to the COTS hardware and software utilized.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results."
    ]
  },
  {
    "text": "The Tactical Control System will allow the operator to conduct mission planning.",
    "id": [
      779,
      781,
      783,
      780,
      763,
      833,
      758,
      764,
      818,
      759
    ],
    "example": [
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "The Tactical Control System will allow the operator to conduct targeting.",
      "The Tactical Control System shall have the functionality to allow the operator to generate a UAV mission plan.",
      "The Tactical Control System will allow the operator to conduct payload product management. ",
      "In the Training Operations Mode the Tactical Control System shall support mission planning.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "In the Normal Operations Mode the Tactical Control System shall support mission planning.",
      "In the Training Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "In the Normal Operations Mode the Tactical Control System shall support mission control and monitoring."
    ]
  },
  {
    "text": "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems.",
    "id": [
      788,
      784,
      787,
      783,
      736,
      1007,
      683,
      805,
      721,
      797
    ],
    "example": [
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from service specific mission planning systems.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System shall have the functionality to allow the operator to generate a UAV mission plan.",
      "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
      "The Tactical Control System shall provide interfaces with the respective UAV program-provided data links for command and control.",
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System will export and disseminate UAV imagery products, tactical communication messages, as well as mission plans and target coordinates.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the system functionality necessary to upload a flight route plan and payload plan (if applicable) to the AV via the selected system data link as well as direct ground connection.",
    "id": [
      1086,
      797,
      1071,
      883,
      871,
      872,
      831,
      784,
      836,
      845
    ],
    "example": [
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall provide the necessary system capabilities required for payload control beyond line of sight via uplink command of two air vehicles of the same type using sequential communication techniques.",
      "The Tactical Control System shall be able to generate payload planning information to be uplinked to the AV separate from a flight route plan.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from service specific mission planning systems.",
      "The Tactical Control System shall transmit command and control information to the AV via the uplink to the AV, and receive AV telemetry and payload information via downlink from the AV.",
      "The Tactical Control System shall provide the necessary system capabilities required for AV flight control BLOS via uplink command to two MAE air vehicles."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the capability to override validation faults after the fault is acknowledged by the operator.",
    "id": [
      1105,
      1044,
      860,
      1109,
      973,
      779,
      966,
      776,
      1115,
      878
    ],
    "example": [
      "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System operator shall be required to enter an acknowledgment prior to disabling the display of critical warning flags for any AV, Payload, ADT, GDT, and Tactical Control System faults.",
      "The Tactical Control System shall allow an Authorized Operator to execute a software debug capability and view the resulting debug diagnostic information.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "Upon the selection of a shutdown command the Tactical Control System shall enter the Shutdown State, which will cause the Tactical Control System to be placed in a condition where power can be removed without impacting operations as well as causing damage to the system, and from which restart of the system can be accomplished normally.",
      "All Tactical Control System operator inputs shall be error checked such that any erroneous operator entry will not cause current processing to terminate.",
      "The Tactical Control System shall provide override of payload automated as well as preprogrammed inputs."
    ]
  },
  {
    "text": "The Flight Route Plan, as a minimum, shall include AV flight path information, Loss of Link plan, AV VCR control tasking (if applicable to the selected AV), and data link control information.",
    "id": [
      817,
      815,
      831,
      812,
      867,
      789,
      797,
      1020,
      796,
      809
    ],
    "example": [
      "The flight route plan, as a minimum, shall provide the necessary AV commands to autonomously execute a programmed flight and return to a designated recovery area.",
      "The Tactical Control System shall analyze the flight route plan selected for uplink to determine that the flight constraints of the AV and the limitation of the data link are not violated prior to transmission of the flight route plan to the AV.",
      "The Tactical Control System shall be able to generate payload planning information to be uplinked to the AV separate from a flight route plan.",
      "The Tactical Control System flight route planner will be able to designate flight corridors and restricted airspace.",
      "The Tactical Control System shall compute the estimated position of the AV during Loss of Link (LOL) based upon the last known AV position and anticipated flight path based on current flight mode (e.g. flight route plan mode, emergency flight route plan mode, maintain current heading mode).",
      "A Mission Plan shall include a Flight Route Plan for a selected AV, a Payload Plan for the selected payload, and a Communications Plan.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The uplink and downlink information passed between the Tactical Control System and the AV shall be in accordance with the associated AV documentation.",
      "The Tactical Control System shall allow the operator to enter as well as review mission plan parameters, including AV flight parameters, payload control parameters, data link control parameters, AV VCR control parameters (if applicable to the selected AV), and AV loiter patterns.",
      "The Tactical Control System flight route planner will provide terrain avoidance warnings for line-of-sight flights. "
    ]
  },
  {
    "text": "The Tactical Control System shall provide the capability to display waypoint data in alphanumeric format.",
    "id": [
      806,
      803,
      911,
      957,
      805,
      972,
      1032,
      952,
      963,
      883
    ],
    "example": [
      "The Tactical Control System shall provide the capability to enter waypoint data in alphanumeric format.",
      "The Tactical Control System shall provide the capability to print waypoint data in alphanumeric format.",
      "The Tactical Control System shall have a built-in text entry capability including the ability to annotate textual information on imagery.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall be capable of importing map information via operator procedure and shall be capable of incorporating vector format and Compressed ADRG (CADRG) maps.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV."
    ]
  },
  {
    "text": "The Tactical Control System shall display an icon indicating AV position when receiving downlink from the desired AV.",
    "id": [
      825,
      828,
      836,
      851,
      864,
      1133,
      840,
      964,
      861,
      842
    ],
    "example": [
      "The Tactical Control System shall display an icon indicating payload center field of view and footprint when receiving downlink from the desired AV.",
      "The Tactical Control System shall display an icon indicating Launch, Handover, and Recovery site (when applicable).",
      "The Tactical Control System shall transmit command and control information to the AV via the uplink to the AV, and receive AV telemetry and payload information via downlink from the AV.",
      "The Tactical Control System shall have the capability to command the AV to use the navigation methods inherent to the selected AV.",
      "The Tactical Control System shall display the AV status, to include but not be limited to the AV location and flight and avionics system status.",
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control.",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "Tactical Control System shall be capable of executing AV maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall allow the operator to initiate the emergency recovery feature of the AV, if the AV has an emergency recovery feature.",
      "The Tactical Control System shall provide the capability to fully control and display the AV's Identification Friend or Foe "
    ]
  },
  {
    "text": "The Tactical Control System shall provide the system functionality necessary to generate a payload plan.",
    "id": [
      832,
      797,
      879,
      784,
      760,
      788,
      903,
      783,
      765,
      833
    ],
    "example": [
      "The Tactical Control System shall provide the capability to display the payload swath for the selected payload for planning purposes.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "Tactical Control System shall provide the capability to monitor payload adherence to the uplinked mission plan.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from service specific mission planning systems.",
      "In the Normal Operations Mode the Tactical Control System shall support payload product management.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System will have the functionality necessary to manage all aspects of payload product handling to include receiving, processing, displaying, and performing limited exploitation.",
      "The Tactical Control System shall have the functionality to allow the operator to generate a UAV mission plan.",
      "In the Training Operations Mode the Tactical Control System shall support payload product Mmanagement.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of being interoperable with Predator and Outrider UAVs across the 5 levels of UAV interaction.",
    "id": [
      869,
      733,
      941,
      1091,
      787,
      837,
      788,
      745,
      986,
      999
    ],
    "example": [
      "The Tactical Control System shall be capable of being interoperable with the installed payloads across the 5 levels of UAV interaction.",
      "The Tactical Control System shall provide software capabilities and hardware configurations necessary to fulfill the operational tasking requirements across the 5 levels of interaction.",
      "The Tactical Control System will have the capability to manage all operational C4I interfaces across all 5 levels of interaction.",
      "The Tactical Control System core software shall be generically written to provide level one through level five interaction for both Outrider and Predator UAVs and establish the architecture for future tactical UAVs.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System shall have the capability to control and monitor multiple types of AVs.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "During startup, the Tactical Control System shall determine which of the 5 levels of interaction are achievable by the Tactical Control System configuration.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS."
    ]
  },
  {
    "text": "AV telemetry data shall be available to support other Tactical Control System functions as required.",
    "id": [
      913,
      836,
      1071,
      882,
      1020,
      917,
      1032,
      871,
      1013,
      910
    ],
    "example": [
      "Payload telemetry data shall be available to support other Tactical Control System functions as required.",
      "The Tactical Control System shall transmit command and control information to the AV via the uplink to the AV, and receive AV telemetry and payload information via downlink from the AV.",
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System shall provide the system functionality necessary to record data obtained via the data link.",
      "The uplink and downlink information passed between the Tactical Control System and the AV shall be in accordance with the associated AV documentation.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "The NITF 2.0 imagery files generated by the Tactical Control System shall contain the necessary telemetry and support data to permit subsequent imagery exploitation by C4I systems."
    ]
  },
  {
    "text": "Tactical Control System shall provide the capability to monitor specific telemetry elements real-time, and record all telemetry elements for future review and processing.",
    "id": [
      881,
      917,
      900,
      957,
      962,
      901,
      952,
      953,
      1071,
      902
    ],
    "example": [
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall be equipped to view incoming and outgoing, both annotated and un-annotated analog imagery.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission.",
      "The Tactical Control System shall have the capability to review incoming annotated as well as un-annotated digital imagery.",
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System shall be capable of presenting to the operator a visual depiction of the minimum and maximum data link operational ranges."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of displaying fuel parameters to the operator to include as a minimum, remaining fuel, flow rate, and bingo fuel.",
    "id": [
      808,
      813,
      902,
      796,
      814,
      843,
      918,
      1144,
      799,
      783
    ],
    "example": [
      "The Tactical Control System flight route planner will perform fuel calculations.",
      "The Tactical Control System shall present to the operator the estimated time of arrival and fuel status at each programmed waypoint of the proposed mission plan.",
      "The Tactical Control System shall be capable of presenting to the operator a visual depiction of the minimum and maximum data link operational ranges.",
      "The Tactical Control System shall allow the operator to enter as well as review mission plan parameters, including AV flight parameters, payload control parameters, data link control parameters, AV VCR control parameters (if applicable to the selected AV), and AV loiter patterns.",
      "At every waypoint and every 5 minutes, the Tactical Control System shall compute the AV's flight range based on remaining fuel.",
      "The Tactical Control System shall provide the capability to enter AV preset limits which, as a minimum, will include airspeed limits, altitude limits, and fuel limits.",
      "The Tactical Control System operator shall be able to select the content of the overlay information.",
      "The Tactical Control System HCI shall provide continuously-available, on-screen control functions for time and missioncritical operations, to include as a minimum print, freeze, declassification, mark VCR, declutter, cease RF transmission.",
      "The Tactical Control System shall automatically check the validity of the intended mission plan prior to being uploaded including altitude constraints, payload constraints, data link range constraints, airspace restrictions, fuel limitations, threat constraints, data link terrain masking effects, and Loss of Link (LOL) Plan.",
      "The Tactical Control System shall have the functionality to allow the operator to generate a UAV mission plan."
    ]
  },
  {
    "text": "The Tactical Control System shall provide an interactive display for the purpose of controlling the data link terminal.",
    "id": [
      877,
      977,
      1128,
      848,
      881,
      818,
      827,
      1016,
      1012,
      853
    ],
    "example": [
      "The Tactical Control System shall provide a graphical user interface display for the purpose of controlling the payload.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide for multi-level information display tailoring by the operator.",
      "The Tactical Control System shall provide interactive displays necessary to command the flight of an AV.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "The Tactical Control System shall display icons indicating Tactical Control System position and Ground Data Terminal (GDT) position.",
      "The Tactical Control System shall have an interface to a source of current navigation information.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data "
    ]
  },
  {
    "text": "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
    "id": [
      875,
      900,
      901,
      883,
      966,
      977,
      1130,
      779,
      882,
      833
    ],
    "example": [
      "The Tactical Control System shall receive, process, and present payload data to the operator so that the status of the payload can be determined.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "The Tactical Control System shall provide the system functionality necessary to record data obtained via the data link.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission."
    ]
  },
  {
    "text": "Payload data includes the digital and analog imagery and associated telemetry sent to the Tactical Control System from each of these payloads.",
    "id": [
      913,
      917,
      1071,
      905,
      904,
      875,
      681,
      683,
      1086,
      682
    ],
    "example": [
      "Payload telemetry data shall be available to support other Tactical Control System functions as required.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System shall have the functionality to process payload product data from Electro Optical (EO), Infrared (IR), and Synthetic Aperture Radar (SAR) payloads.",
      "The payload product includes the payload sensor output and the appropriate AV and payload telemetry data.",
      "The Tactical Control System shall receive, process, and present payload data to the operator so that the status of the payload can be determined.",
      "The Tactical Control System will receipt and transmission of secondary imagery and/or data from multiple UAV.",
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "The Tactical Control System will direct receipt of imagery and/or data from multiple UAV."
    ]
  },
  {
    "text": "The Tactical Control System shall provide information to the C4I system, utilizing data obtained from drones (non-real-time trajectories, tactical points, and details), for use by C4I system operators. This information is transmitted via tactical data communication links and is available for engagement by appropriate weapon systems.",
    "id": [
      727,
      782,
      958,
      698,
      959,
      948,
      833,
      767,
      932,
      786
    ],
    "example": [
      "The Tactical Control System will interface with and export and disseminate payload data to military supported units via external (not part of TCS) tactical communications systems, and C4I systems.",
      "The Tactical Control System will allow the operator to conduct C4I system interface.",
      "The Tactical Control System shall have the functionality to monitor the status of all C4I interfaces, and display appropriate control information.",
      "The Tactical Control System integration with C4I systems will be accomplished through development of interfaces that permit information exchange between the Tactical Control System and specified C4I systems.",
      "The Tactical Control System shall display which C4I systems are supported and online during a mission.",
      "The Tactical Control System will have the functionality to process received C4I messages and to prepare C4I messages for transmission.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "In the Training Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Tactical Control System shall have the functionality necessary to manage all aspects of C4I system interfaces to include receiving, processing, and transmitting tactical information to include but not limited to character based text messages, NITF 2.0 imagery files, and RS-170A video.",
      "The Tactical Control System shall facilitate automated processing of mission plan data received via C4I interfaces in order to extract the appropriate mission planning data."
    ]
  },
  {
    "text": "The Tactical Control System shall have the capability to establish and subsequently terminate digital communication with peripheral devices.",
    "id": [
      947,
      946,
      944,
      1032,
      1013,
      1031,
      894,
      993,
      896,
      977
    ],
    "example": [
      "The Tactical Control System shall have the capability to establish and subsequently terminate analog communication with peripheral devices.",
      "The Tactical Control System shall establish analog communication with C4I systems and terminate the communication once it is completed.",
      "The Tactical Control System shall establish digital communication with the C4I systems and terminate the communication upon completion.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "The Tactical Control System shall be able to access data storage devices.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver functions of the selected data terminal.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal."
    ]
  },
  {
    "text": "All digital messages received by the Tactical Control System shall be automatically checked for errors and corrected when possible.",
    "id": [
      1115,
      960,
      955,
      1114,
      961,
      954,
      752,
      397,
      105,
      951
    ],
    "example": [
      "All Tactical Control System operator inputs shall be error checked such that any erroneous operator entry will not cause current processing to terminate.",
      "The Tactical Control System shall be capable of monitoring the status of all incoming and outgoing tactical communication messages.",
      "The Tactical Control System shall provide the capability to log all incoming and outgoing formatted tactical messages.",
      "All Tactical Control System warning messages and HCI actions shall be archived for later review.",
      "The Tactical Control System shall have the capability to review all tactical communication messages received and transmitted.",
      "All erroneous messages that cannot be corrected by Tactical Control System shall be flagged to the operator.",
      "The Tactical Control System shall be capable of automatically recording system state data, interface communications and other information necessary to support event reconstruction.",
      "All error messages produced by the CCTNS system must be meaningful, so that they can be appropriately acted upon by the users who are likely to see them.",
      "All DigitalHome operations shall incorporate exception handling so that the system responds to a user with a clear, descriptive message when an error or an exceptional condition occurs.",
      "The Tactical Control System shall be capable of reviewing incoming Tactical Communication Messages."
    ]
  },
  {
    "text": "As a minimum, Tactical Control System shall provide Startup FD/L for the operator workstation.",
    "id": [
      743,
      967,
      742,
      1010,
      966,
      885,
      977,
      776,
      1015,
      779
    ],
    "example": [
      "When the Tactical Control System Software is terminated normally the Tactical Control System shall enter the Normal Startup Mode of operation upon application of power.",
      "Tactical Control System shall be capable of executing workstation and peripheral equipment maintenance software and displaying appropriate status results.",
      "The Tactical Control System will execute the particular startup mode which corresponds with the manner in which the Tactical Control System ",
      "The Tactical Control System shall as a minimum, allow Operator(s) to print freeze-frame video, C4I Messages, Mission Plans, FD/L information, and current map display.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "Upon the selection of a shutdown command the Tactical Control System shall enter the Shutdown State, which will cause the Tactical Control System to be placed in a condition where power can be removed without impacting operations as well as causing damage to the system, and from which restart of the system can be accomplished normally.",
      "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring."
    ]
  },
  {
    "text": "The Tactical Control System shall allow the operator to control and monitor the AV's FD/L, if required and provided by the Original Equipment Manufacturer (OEM).",
    "id": [
      844,
      861,
      840,
      1027,
      849,
      837,
      964,
      851,
      860,
      838
    ],
    "example": [
      "The Tactical Control System shall allow the operator to control an AV using the LOS as well as SATCOM data links.",
      "The Tactical Control System shall allow the operator to initiate the emergency recovery feature of the AV, if the AV has an emergency recovery feature.",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "The Tactical Control System shall allow the Operator(s) to fully control the VCR via the Tactical Control System Display input device(s).",
      "The Tactical Control System shall allow the operator to command the flight behavior characteristics inherent to the selected AV.",
      "The Tactical Control System shall have the capability to control and monitor multiple types of AVs.",
      "Tactical Control System shall be capable of executing AV maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall have the capability to command the AV to use the navigation methods inherent to the selected AV.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "Tactical Control System shall notify the operator when AV performance parameters are out of limits."
    ]
  },
  {
    "text": "The Tactical Control System shall allow authorized operators to install software upgrades via CD-ROM as well as other media storage devices.",
    "id": [
      1093,
      973,
      995,
      993,
      991,
      970,
      986,
      988,
      983,
      947
    ],
    "example": [
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services.",
      "The Tactical Control System shall allow an Authorized Operator to execute a software debug capability and view the resulting debug diagnostic information.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JDISS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the capability for Authorized Operators to modify all Tactical Control System programmable parameters.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with CCTV.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSTARS GSM.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate analog communication with peripheral devices."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of importing National Imagery Mapping Agency (NIMA) Digital Terrain Elevation Data (DTED), Digital Feature Analysis Data (DFAD), Arc Digitized Raster Graphic and scanned hard copy maps, via compact disk.",
    "id": [
      1078,
      952,
      972,
      1032,
      1013,
      957,
      956,
      1011,
      943,
      1030
    ],
    "example": [
      "The Tactical Control System computer system shall contain a CD-ROM drive that is compatible with National Imagery and Mapping Agency (NIMA), CD-ROM Digital Terrain Elevation Data (DTED), Digital Feature Analysis Data (DFAD), and embedded training media.",
      "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission.",
      "The Tactical Control System shall be capable of importing map information via operator procedure and shall be capable of incorporating vector format and Compressed ADRG (CADRG) maps.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall prepare annotated as well as un-annotated analog imagery for transmission. ",
      "The Tactical Control System shall have the functionality to output digital message data and imagery to a hard copy printer.",
      "The Tactical Control System shall send and receive annotated and un-annotated digital imagery.",
      "The Tactical Control System shall have ports for outputting data and imagery to an internal hard copy printer."
    ]
  },
  {
    "text": "The Tactical Control System will interface with external systems to conduct mission coordination and operations.",
    "id": [
      976,
      989,
      764,
      833,
      722,
      759,
      763,
      933,
      758,
      979
    ],
    "example": [
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "In the Training Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System will also receive, process, and display tasking orders, and operational information from Service specific mission planning systems.",
      "In the Normal Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "In the Training Operations Mode the Tactical Control System shall support mission planning.",
      "The Tactical Control System shall plan and conduct a mission.",
      "In the Normal Operations Mode the Tactical Control System shall support mission planning.",
      "The Tactical Control System shall provide external interfaces to launch and recovery systems."
    ]
  },
  {
    "text": "This prioritization schema has been validated by a Joint Requirements Oversight Council (JROC) Memorandum.",
    "id": [
      478,
      6,
      555,
      1087,
      339,
      202,
      563,
      412,
      749,
      1150
    ],
    "example": [
      "In addition, when designing multimedia information presentations, the design principles and recommendations described in ISO 14915-1 to ISO 14915-3 should be taken into account.",
      "These document were prepared by the DigitalHomeOwner Division, in consultation with the Marketing Division of HomeOwner Inc.",
      "The primary goal of this document is to provide a complete and accurate list of requirements for the VLA Expansion Project Correlator Monitor and Control System.",
      "The Tactical Control System shall have software based on Defense Information Infrastructure/Common Operating Environment per Assistant Secretary of Defense for Command, Control, Communications, and Intelligence (ASD(C3I)) Joint Technical Architecture (JTA).",
      "FUNCTIONAL REQUIREMENTS SPECIFICATION V1.0 (DRAFT) ",
      "This document is designed to provide information to both the client and the technical designers of the software.",
      "The remainder of this document contains a more detailed description of the Correlator Monitor and Control System as well as the primary requirements necessary to design and build the EVLA Correlator Monitor and Control System.",
      "Application user interfaces to meet its requirements and recommendations.",
      "Initialization of the Tactical Control System HWCIs shall include startup of HWCIs, download of software, startup of CSCIs, execution of Startup FD/L, and establishment of the state of readiness of all interfaces.",
      "This Software Requirements Specification (SRS) provides the requirements for the Center-to-Center (C2C) Communications Network that is based on a Texas Department of Transportation (TxDOT) C2C project."
    ]
  },
  {
    "text": "The Tactical Control System shall support a concurrent uplink and downlink capability.",
    "id": [
      881,
      686,
      978,
      977,
      883,
      1015,
      1012,
      872,
      888,
      994
    ],
    "example": [
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System will also provide connectivity to specifically identified Command, Control, Communications, Computers, and ",
      "The Tactical Control System shall provide the system functionality to allow interfacing with external systems via a local area network.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide the necessary system capabilities required for payload control beyond line of sight via uplink command of two air vehicles of the same type using sequential communication techniques.",
      "The Tactical Control System shall support a LOS data link and SATCOM data link capability.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF."
    ]
  },
  {
    "text": "The RTP interface shall support distributed processing capability.",
    "id": [
      1160,
      1019,
      1076,
      639,
      623,
      1086,
      1022,
      601,
      1089,
      1074
    ],
    "example": [
      "Systems will interface to the “cloud” using a project defined protocol.",
      "This interface shall allow for addition of future AVs and will provide the generic architecture to ensure interoperability.",
      "The Tactical Control System shall have sufficient throughput to support the processing requirements of the selected data link.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "This interface shall allow the information from the data server to be made available to other components of the Tactical Control System.",
      "It is assumed that all auxiliary data needed for real time update of correlator parameters will be provided directly by the VLA Expansion Project Monitor and Control System system or by dedicated servers.",
      "The Tactical Control System shall provide an open software architecture to be capable of supporting additional CSCIs, CSCs, and CSUs for future AVs, future payloads, and payload capabilities (e.g.",
      "The Tactical Control System hardware shall support the data rate characteristics of the AV, data link and payload to ensure interoperability."
    ]
  },
  {
    "text": "The Tactical Control System shall incorporate an intercom system that provides verbal communicate in the situation where there are multiple operators.",
    "id": [
      686,
      978,
      950,
      942,
      1110,
      857,
      872,
      1130,
      1128,
      883
    ],
    "example": [
      "The Tactical Control System will also provide connectivity to specifically identified Command, Control, Communications, Computers, and ",
      "The Tactical Control System shall provide the system functionality to allow interfacing with external systems via a local area network.",
      "The Tactical Control System shall create tactical communications messages.",
      "The Tactical Control System shall send and receive tactical communication messages. ",
      "A combination of visual and auditory outputs will be provided to alert the Tactical Control System operator to situations which may require operator response.",
      "The Tactical Control System shall provide the functionality to control the power, transmitter signal strength, and frequencies used by ADT for data link communication.",
      "The Tactical Control System shall provide the necessary system capabilities required for payload control beyond line of sight via uplink command of two air vehicles of the same type using sequential communication techniques.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System shall provide for multi-level information display tailoring by the operator.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV."
    ]
  },
  {
    "text": "The Tactical Control System shall, as a minimum, allow the Operator(s) to print freeze-frame video, C4I Messages, Mission Plans, FD/L information, and current map display to an internal printer.",
    "id": [
      1010,
      1030,
      1011,
      1144,
      1009,
      914,
      957,
      966,
      1143,
      803
    ],
    "example": [
      "The Tactical Control System shall as a minimum, allow Operator(s) to print freeze-frame video, C4I Messages, Mission Plans, FD/L information, and current map display.",
      "The Tactical Control System shall have ports for outputting data and imagery to an internal hard copy printer.",
      "The Tactical Control System shall have the functionality to output digital message data and imagery to a hard copy printer.",
      "The Tactical Control System HCI shall provide continuously-available, on-screen control functions for time and missioncritical operations, to include as a minimum print, freeze, declassification, mark VCR, declutter, cease RF transmission.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and an external hard copy printer.",
      "The Tactical Control System shall display live and recorded imagery data, with as well as without annotation and overlay, upon operator request.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "The Tactical Control System HCI shall provide for on-screen information to include, as a minimum, overlays, headers, cursors, alphanumeric annotation, waypoints, crosshairs, designed to be visible against the complete spectrum of map and payload video backgrounds.",
      "The Tactical Control System shall provide the capability to print waypoint data in alphanumeric format."
    ]
  },
  {
    "text": "Appropriate cautions and warnings shall be provided to the operator if the air vehicle deviates into unsafe flight regime.",
    "id": [
      1105,
      1044,
      838,
      1109,
      747,
      862,
      1045,
      1041,
      860,
      849
    ],
    "example": [
      "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
      "Tactical Control System shall notify the operator when AV performance parameters are out of limits.",
      "The Tactical Control System operator shall be required to enter an acknowledgment prior to disabling the display of critical warning flags for any AV, Payload, ADT, GDT, and Tactical Control System faults.",
      "The Tactical Control System shall inform the operator if the operator attempts to execute a function prohibited as a result of the determined level of interaction.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "The Tactical Control System shall provide the required information to allow the operator to maintain safe separation from other aircraft and a safe altitude in civilian airspace per Federal Aviation Administration (FAA) rules.",
      "The Tactical Control System shall provide sufficient cues to allow the operator to safely take-off, land and navigate under Instrument Flight Rules.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System shall allow the operator to command the flight behavior characteristics inherent to the selected AV."
    ]
  },
  {
    "text": "The system design shall use MIL-STD-2036, as a guide, with regard to personnel hazards, and MIL-STD-1472D, as a guide for safety from a human engineering viewpoint.",
    "id": [
      1040,
      729,
      1051,
      1069,
      1039,
      703,
      1038,
      1052,
      1016,
      1005
    ],
    "example": [
      "The Tactical Control System shall comply with para 5.3 of MIL-STD 882C, “System Safety Program Requirements”, dated 19 January 1993 w/ Notice 1 dated 19 January 1996.",
      "The operational capabilities to be performed by the system will be determined by task analysis in accordance with MIL STD 1388 Task 401 as a guide based on a thorough understanding of Outrider and Predator mission requirements.",
      "The Tactical Control System design shall provide protection against injury to Tactical Control System operators and maintenance personnel.",
      "The Tactical Control System shall be capable of operation within environments specified in the System/Subsystem Design Document for the land-based shelter and shipboard environments.",
      "The Tactical Control System safety requirements are intended to eliminate as well as control potential hazards to equipment and personnel involved in the Tactical Control System.",
      "The Tactical Control System will be connected with Common Operational Modeling, Planning, and Simulation Strategy (COMPASS)",
      "The Tactical Control System design shall consider all safety requirements affecting design and performance except nuclear safety.",
      "System safety and health hazards, if any, shall be identified and evaluated during Phase I of the Tactical Control System development.",
      "The Tactical Control System shall have an interface to a source of current navigation information.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with COMPASS."
    ]
  },
  {
    "text": "The Tactical Control System shall conform with the National Institute for Standard Technology (NIST) Federal Information Processing Standard (FIPS) Publication 151-2 (POSIX.1).",
    "id": [
      1064,
      909,
      994,
      985,
      1055,
      1120,
      803,
      1040,
      997,
      998
    ],
    "example": [
      "The Tactical Control System shall be approved for operation at the same level as the systems with which it interfaces.",
      "The Tactical Control System shall be in compliance with Common Imagery Ground Surface Station (CIGSS), United States Imagery Standards (USIS), Video Working Group Standards Architecture, National Imagery Transmission Format (NITF) Version 2.0, and Global Command Control Systems (GCCS) when processing payload imagery data.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "Therefore, as per DoD Regulation 5000.2-R, dated March 15, 1996, the Tactical Control System shall meet security requirements in accordance with DoD Directive 5200.28(D), “Security Requirements for Automated Information Systems” dated March 21, 1988.",
      "The Human Computer Interface (HCI) shall be designed and implemented in accordance with the Tactical Control System HCI Specification, Tactical Control System 108.[SSS462] ",
      "The Tactical Control System shall provide the capability to print waypoint data in alphanumeric format.",
      "The Tactical Control System shall comply with para 5.3 of MIL-STD 882C, “System Safety Program Requirements”, dated 19 January 1993 w/ Notice 1 dated 19 January 1996.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS."
    ]
  },
  {
    "text": "The Tactical Control System shall comply with the Assistant Secretary of Defense (C3I) Joint Technical Architecture (JTA).",
    "id": [
      1087,
      984,
      1064,
      909,
      985,
      1000,
      997,
      998,
      933,
      999
    ],
    "example": [
      "The Tactical Control System shall have software based on Defense Information Infrastructure/Common Operating Environment per Assistant Secretary of Defense for Command, Control, Communications, and Intelligence (ASD(C3I)) Joint Technical Architecture (JTA).",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS.",
      "The Tactical Control System shall be approved for operation at the same level as the systems with which it interfaces.",
      "The Tactical Control System shall be in compliance with Common Imagery Ground Surface Station (CIGSS), United States Imagery Standards (USIS), Video Working Group Standards Architecture, National Imagery Transmission Format (NITF) Version 2.0, and Global Command Control Systems (GCCS) when processing payload imagery data.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall plan and conduct a mission.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS."
    ]
  },
  {
    "text": "Each control console shall have a display windows that provides aircraft flight data or payload data in the foreground, with downlinked video in the background.",
    "id": [
      1101,
      1102,
      1123,
      1103,
      848,
      805,
      1143,
      917,
      877,
      853
    ],
    "example": [
      "Each control console shall have a display windows that provides the aircraft position, Tactical Control System position, flight path, and waypoint graphics in the foreground, which are positioned in relation to a map displayed in the background.",
      "Each control console shall have a display windows that provides graphic presentations of downlinked telemetry data.",
      "The Tactical Control System shall be capable of displaying a window within a window format to include, as a minimum, displaying a video window overlaid on a map screen as well as a map screen overlaid on a video screen.",
      "Each control console shall have a display windows that presents the interface menus for workstation software.",
      "The Tactical Control System shall provide interactive displays necessary to command the flight of an AV.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System HCI shall provide for on-screen information to include, as a minimum, overlays, headers, cursors, alphanumeric annotation, waypoints, crosshairs, designed to be visible against the complete spectrum of map and payload video backgrounds.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "The Tactical Control System shall provide a graphical user interface display for the purpose of controlling the payload.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data "
    ]
  },
  {
    "text": "The Tactical Control System shall have ergonomically designed operator controls and displays for the 5th percentile female to 95th percentile male operator.",
    "id": [
      1128,
      1133,
      1130,
      1125,
      1129,
      902,
      1015,
      881,
      1127,
      830
    ],
    "example": [
      "The Tactical Control System shall provide for multi-level information display tailoring by the operator.",
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System shall provide access to the DII Style Manager so that pointing device characteristics can be modified.",
      "The Tactical Control System shall provide automated Tactical Control System system information, control options, and logical and simple operator guidance and support for immediate and adaptive responding to crisis situations.",
      "The Tactical Control System shall be capable of presenting to the operator a visual depiction of the minimum and maximum data link operational ranges.",
      "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall provide a capability for porting an off-the-shelf, complex control joystick with multiple toggle and multi-position switches as part of the Tactical Control System hardware suite.",
      "The Tactical Control System shall provide the capability to graphically display Line of Sight versus terrain profile (DTED)."
    ]
  },
  {
    "text": "Tactical Control System Warning messages shall be color coded and flashed based on mission criticality.",
    "id": [
      1133,
      826,
      827,
      828,
      805,
      942,
      919,
      950,
      820,
      877
    ],
    "example": [
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control.",
      "The Tactical Control System shall display an icon, in variable sizes, indicating target position and type at coordinates selected by the operator.",
      "The Tactical Control System shall display icons indicating Tactical Control System position and Ground Data Terminal (GDT) position.",
      "The Tactical Control System shall display an icon indicating Launch, Handover, and Recovery site (when applicable).",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall send and receive tactical communication messages. ",
      "The Tactical Control System shall have the capability to select and deselect several types of cross hairs (or other similar ICON) to identify a selected point on a target.",
      "The Tactical Control System shall create tactical communications messages.",
      "The Tactical Control System shall provide the capability of displaying overlays each containing 100 simultaneous icons of known fire support coordination zones, airspace control zones, threat systems, and displaying the threat engagement envelopes with associated radar terrain masking for those threats.",
      "The Tactical Control System shall provide a graphical user interface display for the purpose of controlling the payload."
    ]
  },
  {
    "text": "The color codes and flash frequencies will follow MIL-STD 1472 guidelines.",
    "id": [
      829,
      1143,
      1211,
      1202,
      909,
      410,
      1040,
      925,
      444,
      1055
    ],
    "example": [
      "The Tactical Control System shall be capable of displaying the positions of the icons in Lat./Lon., Universal Transverse Mercator (UTM), and Military Grid Reference System (MGRS) formats and provide conversion to multiple spheroid scales.",
      "The Tactical Control System HCI shall provide for on-screen information to include, as a minimum, overlays, headers, cursors, alphanumeric annotation, waypoints, crosshairs, designed to be visible against the complete spectrum of map and payload video backgrounds.",
      "Each link displayed on the map shall be color coded to provide a graphical depiction of speeds.",
      "The Center-to-Center Project shall utilize the TMDD standard (including message sets) to transmit information.",
      "The Tactical Control System shall be in compliance with Common Imagery Ground Surface Station (CIGSS), United States Imagery Standards (USIS), Video Working Group Standards Architecture, National Imagery Transmission Format (NITF) Version 2.0, and Global Command Control Systems (GCCS) when processing payload imagery data.",
      "The user interfaces of the CCTNS system should comply with Standard ISO 9241.",
      "The Tactical Control System shall comply with para 5.3 of MIL-STD 882C, “System Safety Program Requirements”, dated 19 January 1993 w/ Notice 1 dated 19 January 1996.",
      "The Tactical Control System shall have the capability to display Near-Real Time (NRT) imagery to include, as a minimum, date/time group, target location coordinates when the target is in the center of the field of view, north seeking arrow, and AV position and heading.",
      "ISO 9241-303 shall be consulted for screen text legibility requirements.",
      "Therefore, as per DoD Regulation 5000.2-R, dated March 15, 1996, the Tactical Control System shall meet security requirements in accordance with DoD Directive 5200.28(D), “Security Requirements for Automated Information Systems” dated March 21, 1988."
    ]
  },
  {
    "text": "In addition to displayed alert messages to the Tactical Control System operator, auditory alerts to include tones shall also be provided.",
    "id": [
      1110,
      937,
      1113,
      1142,
      901,
      900,
      85,
      860,
      948,
      942
    ],
    "example": [
      "A combination of visual and auditory outputs will be provided to alert the Tactical Control System operator to situations which may require operator response.",
      "The Tactical Control System shall have the ability to interface with Service specific ground and airborne Ultra High Frequency (UHF), Very High Frequency (VHF), UHF/VHF, and High Frequency (HF) radios for digital message transmission while using the same radios for record traffic.",
      "The volume of these auditory tones shall be adjustable by the operator via keyboard and trackball input to at least 20dB above the speech interference level at the operator’s ear.",
      "For AV safety as well as mission-critical Warnings, the Tactical Control System HCI shall provide a default selection as well as an override option, along with a selection of adaptive responses, and the minimum information necessary to assist the operator in responding quickly and adaptively to the emergency.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "A DigitalHome system shall be able to activate both light and sound alarms: one sound alarm and one light alarm subsystem, with multiple lights.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System will have the functionality to process received C4I messages and to prepare C4I messages for transmission.",
      "The Tactical Control System shall send and receive tactical communication messages. "
    ]
  },
  {
    "text": "The Tactical Control System shall use graphical representations to convey information, such as system status, C4I links, and AV-GDT links.",
    "id": [
      827,
      877,
      805,
      959,
      830,
      1016,
      686,
      1133,
      958,
      722
    ],
    "example": [
      "The Tactical Control System shall display icons indicating Tactical Control System position and Ground Data Terminal (GDT) position.",
      "The Tactical Control System shall provide a graphical user interface display for the purpose of controlling the payload.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall display which C4I systems are supported and online during a mission.",
      "The Tactical Control System shall provide the capability to graphically display Line of Sight versus terrain profile (DTED).",
      "The Tactical Control System shall have an interface to a source of current navigation information.",
      "The Tactical Control System will also provide connectivity to specifically identified Command, Control, Communications, Computers, and ",
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control.",
      "The Tactical Control System shall have the functionality to monitor the status of all C4I interfaces, and display appropriate control information.",
      "The Tactical Control System will also receive, process, and display tasking orders, and operational information from Service specific mission planning systems."
    ]
  },
  {
    "text": "The Tactical Control System shall provide maximum automated system software support to system status monitoring and alerting of the Tactical Control System operator when a preset system parameter goes under as well as over a set threshold.",
    "id": [
      966,
      965,
      967,
      1130,
      838,
      1042,
      1129,
      779,
      862,
      993
    ],
    "example": [
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "Tactical Control System shall be capable of executing payload maintenance software and displaying appropriate status results.",
      "Tactical Control System shall be capable of executing workstation and peripheral equipment maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "Tactical Control System shall notify the operator when AV performance parameters are out of limits.",
      "The Tactical Control System shall provide adequate capability to allow the operator to operate each UAV within its certified operational flight envelope.",
      "The Tactical Control System shall provide automated Tactical Control System system information, control options, and logical and simple operator guidance and support for immediate and adaptive responding to crisis situations.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS."
    ]
  },
  {
    "text": "The Tactical Control System HCI shall provide for separation, grouping, and visual coding of multiple categories of alerts, to include Warnings, Cautions, and Advisories.",
    "id": [
      1141,
      1144,
      1143,
      1142,
      958,
      1139,
      1134,
      1140,
      1138,
      932
    ],
    "example": [
      "The Tactical Control System HCI shall provide for visual Warnings, Cautions, and Advisories to be displayed at or near the center of the field of view, i.e., within a 30o cone, of all monitors in a Tactical Control System system.",
      "The Tactical Control System HCI shall provide continuously-available, on-screen control functions for time and missioncritical operations, to include as a minimum print, freeze, declassification, mark VCR, declutter, cease RF transmission.",
      "The Tactical Control System HCI shall provide for on-screen information to include, as a minimum, overlays, headers, cursors, alphanumeric annotation, waypoints, crosshairs, designed to be visible against the complete spectrum of map and payload video backgrounds.",
      "For AV safety as well as mission-critical Warnings, the Tactical Control System HCI shall provide a default selection as well as an override option, along with a selection of adaptive responses, and the minimum information necessary to assist the operator in responding quickly and adaptively to the emergency.",
      "The Tactical Control System shall have the functionality to monitor the status of all C4I interfaces, and display appropriate control information.",
      "The Tactical Control System HCI shall provide the capability to display operator definable “Lock Out” zones around waypoints, Launch and Recovery Point (LRP), as well as any selected point on the AV flight path.",
      "The Tactical Control System HCI shall provide the capability to select and amplify an object and point on a map as well as payload screen.",
      "The Tactical Control System HCI shall provide for a rapid means to cancel aural warnings.",
      "The Tactical Control System HCI shall provide the capability to lock onto and hold a coordinate point on the payload imagery window.",
      "The Tactical Control System shall have the functionality necessary to manage all aspects of C4I system interfaces to include receiving, processing, and transmitting tactical information to include but not limited to character based text messages, NITF 2.0 imagery files, and RS-170A video."
    ]
  },
  {
    "text": "",
    "id": [
      554,
      454,
      384,
      455,
      434,
      483,
      1164,
      868,
      412,
      1090
    ],
    "example": [
      "",
      "in the expected layout, paper format, or orientation).",
      "# 审核到这里啦",
      "Use of “white space”: “White space” on a page i.e.",
      "bandwidth between the application and the user).",
      "highlighting) the topic currently visible in the content area.",
      "The mnemonic for the Center-to-Center project is Center-to-Center.",
      "Tactical Control System shall display a LOL timer to the operator initiating a LOL onset.",
      "Application user interfaces to meet its requirements and recommendations.",
      "auto-search and automatic target tracking), and future Tactical UAVs."
    ]
  },
  {
    "text": "The TxDOT Center-to-Center project initially connected the DFW TxDOT Traffic Management Centers (TMCs).",
    "id": [
      1150,
      1163,
      1151,
      1154,
      1153,
      1174,
      1156,
      1166,
      1172,
      1178
    ],
    "example": [
      "This Software Requirements Specification (SRS) provides the requirements for the Center-to-Center (C2C) Communications Network that is based on a Texas Department of Transportation (TxDOT) C2C project.",
      "The Center-to-Center project mnemonic uniquely identifies the Center-to-Center project to distinguish its requirements from the requirements of other ITS systems.",
      "This Center-to-Center infrastructure implements a repository for traffic data and provides a mechanism to exchange device control information between TMCs.",
      "In order to create the Center-to-Center infrastructure, interfaces to the existing systems will be created.",
      "The Center-to-Center infrastructure must interconnect several dissimilar traffic management systems.",
      "To support LCS control in other centers, the Center shall be able to support the following device control command for a LCS, including network identifier, LCS identifier, username and Password.",
      "The Center-to-Center infrastructure is being created using a series of building blocks.",
      "For each roadway network it maintains, the Center shall provide the network name and link data information.",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "To support CCTV switching in other centers, the Center shall be able to support the following CCTV switching command, including network identifier, username, Password and video channel input identifier."
    ]
  },
  {
    "text": "The Center-to-Center project will be implemented using the evolving ITS Traffic Management Data Dictionary (TMDD) standard, the message sets associated with TMDD, other ITS Data Elements and Message Sets.",
    "id": [
      1202,
      1155,
      1154,
      1151,
      1201,
      1160,
      1246,
      576,
      513,
      728
    ],
    "example": [
      "The Center-to-Center Project shall utilize the TMDD standard (including message sets) to transmit information.",
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "In order to create the Center-to-Center infrastructure, interfaces to the existing systems will be created.",
      "This Center-to-Center infrastructure implements a repository for traffic data and provides a mechanism to exchange device control information between TMCs.",
      "The Data Collector shall be designed to support the storage of TMDD data elements and message set information.",
      "Systems will interface to the “cloud” using a project defined protocol.",
      "The Center-to-Center web interface shall be implemented using C/C++ and ESRI ARC IMS.",
      "The translation will provide the correlator with specific goal oriented hardware configuration tables to satisfy the configuration requested by the A second interface with a human GUI will also allow for configuration of the correlator hardware, preferably through the same table structures used above.",
      "The core services, support layer and security and access control components can be deployed as standard components with necessary configuration changes.",
      "Communications procedures, formats, and interfaces will be interoperable with selected standard DoD C4I systems, architectures, and protocols."
    ]
  },
  {
    "text": "New systems that are deployed (based on the ITS standards) will not utilize the project defined protocol but will be moved “into” the cloud (because they themselves would be based on the ITS standards.",
    "id": [
      1160,
      11,
      1154,
      1077,
      508,
      605,
      513,
      526,
      524,
      514
    ],
    "example": [
      "Systems will interface to the “cloud” using a project defined protocol.",
      "The scope of the project will be limited to the management of devices which control temperature, humidity, security, and power to small appliances and lighting units, through the use of a web-ready device.",
      "In order to create the Center-to-Center infrastructure, interfaces to the existing systems will be created.",
      "To meet growth requirements, the Tactical Control System shall be capable of adding additional storage without major hardware reconfiguration.",
      "The proposed functional architecture is modeled around centralized deployment to facilitate ease of maintenance and leverage advancement in open standards and web technologies.",
      "Network switches shall be employed to distribute traffic within a correlator rack and where their use will significantly reduce overall network wiring complexity.",
      "The core services, support layer and security and access control components can be deployed as standard components with necessary configuration changes.",
      "The CCTNS system should be designed to have a n-tier architecture with the presentation logic separated from the business logic that is again separated from the data-access logic ",
      "The CCTNS system should be developed for a centralized deployment and maintenance ",
      "The customization layer can override and add to the core services based on the specific state requirements and can be plugged with the core services."
    ]
  },
  {
    "text": "This would allow a “local” common repository to be created by “linking” individual partners, a “regional” common repository to be created by “linking” local common repositories and a “statewide” common repository to be created by “linking” regional common repositories.",
    "id": [
      1151,
      319,
      159,
      508,
      320,
      529,
      1154,
      533,
      1153,
      517
    ],
    "example": [
      "This Center-to-Center infrastructure implements a repository for traffic data and provides a mechanism to exchange device control information between TMCs.",
      "These links are presented within the system interface and lead to various World Wide Web documents.",
      "There shall be a network connection between SwRI and NISN for data transfers and distribution.",
      "The proposed functional architecture is modeled around centralized deployment to facilitate ease of maintenance and leverage advancement in open standards and web technologies.",
      "Each link corresponds to a different S2S project, allowing players to choose which external resources they wish to explore based on their interests or areas where they seek further understanding.",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "In order to create the Center-to-Center infrastructure, interfaces to the existing systems will be created.",
      "The CCTNS system should run on multiple browsers.",
      "The Center-to-Center infrastructure must interconnect several dissimilar traffic management systems.",
      "The CCTNS system should support multilingual interface "
    ]
  },
  {
    "text": "The Requirement Category Mnemonic is a two-letter mnemonic for each functional area.",
    "id": [
      162,
      127,
      57,
      205,
      1162,
      130,
      558,
      166,
      512,
      1165
    ],
    "example": [
      "The mnemonic, LR, is used in the requirement identifiers to show that these requirements are Logistical ",
      "Section 2 is an overview of the descriptions of requirement determination, qualification procedures, rationale, and traceability that are used in the identification and the definitions of the requirements.",
      "This section provides a description of the functional requirements.",
      "Section two is a general description of the product requirements from a user's perspective.",
      "Requirements are listed in separate sections and in table format for each functional area.",
      "The mnemonic, FR, is used in the requirement identifiers to show that these requirements are Functional Requirements unless otherwise specified.",
      "The requirements contained in this document are numbered based on the section/subsection in which they appear.",
      "The mnemonic, DR, is used in the requirement identifiers to show that these requirements are Delivery Requirements.",
      "Each of the components contains multiple services as defined by Service Definition.",
      "The Requirement Numbers are a combination of target Advanced Traffic Management System (ATMS) and sequential within a given functional area."
    ]
  },
  {
    "text": "The Center shall support the status information about each ramp meter, including network identifier, Ramp Meter identifier, Ramp Meter name, Location and Status.",
    "id": [
      1181,
      1184,
      1171,
      1188,
      1197,
      1196,
      1179,
      1195,
      1173,
      1193
    ],
    "example": [
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the following status information about each Parking Lot, including network identifier, parking lot identifier, parking lot name, location and status.",
      "The Center shall provide the following status information about each DMS, including network identifier, DMS identifier, DMS name.",
      "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
      "The Center shall support the following status information about each Vehicle Priority, including vehicle identifier, network identifier, link identifier and intersection identifier.",
      "The Center shall support the following status information about each Park and Ride Lot, including network identifier, park and ride lot identifier, park and ride lot name, location, status and capacity.",
      "The Center shall support the following status information about each HAR, including network identifier, HAR identifier, HAR name, location and status.",
      "The Center shall support the following status information about each Light/Commuter Location, including network identifier, link identifier, commuter or light rail identifier, commuter or light rail name, location and schedule adherence.",
      "The Center shall support the following status information about each LCS, including network identifier, LCS identifier, LCS name, Location and Status.",
      "The Center shall support the following status information about each Bus Location, including network identifier, link identifier, bus identifier, bus name, location and schedule adherece."
    ]
  },
  {
    "text": "To support Ramp Meter control in other centers, the Center shall be able to support the following device control command for a ramp meter, including network identifier, Ramp Meter identifier, username, password and plan.",
    "id": [
      1189,
      1172,
      1182,
      1191,
      1180,
      1174,
      1186,
      1233,
      1188,
      1171
    ],
    "example": [
      "To support Reversible Lane control in other centers, the Center shall be able to support the following device control command for a Reversible Lane, including network identifier, reversible lane identifier, username, password, plan and duration.",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "To support Traffic Signal control in other centers, the Center shall be able to support the following device control command for a Traffic Signal, including network identifier, traffic signal identifier, username, password and traffic signal plan identifier.",
      "To support Dynamic Lane control in other centers, the Center shall be able to support the following device control command for a Dynamic Lane, including network identifier, dynamic lane identifier, username, password and lane plan.",
      "To support HAR control in other centers, the Center shall be able to support the following device control command for a HAR, including network identifier, HAR identifier, username, password and message.",
      "To support LCS control in other centers, the Center shall be able to support the following device control command for a LCS, including network identifier, LCS identifier, username and Password.",
      "To support School Zone control in other centers, the Center shall be able to support the following device control command for a School Zone, including network identifier, school zone identifier, username, password and plan.",
      "Once an Center is selected, the user shall be able to select a Ramp Meter from a list and provide the following information, including Target Ramp Meter and Plan.",
      "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
      "The Center shall provide the following status information about each DMS, including network identifier, DMS identifier, DMS name."
    ]
  },
  {
    "text": "The Center shall support the following status information about each HOV, including network identifier, HOV identifier, HOV name, link identifier, status and plan.",
    "id": [
      1179,
      1188,
      1197,
      1181,
      1173,
      1171,
      1183,
      1193,
      1195,
      1185
    ],
    "example": [
      "The Center shall support the following status information about each HAR, including network identifier, HAR identifier, HAR name, location and status.",
      "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
      "The Center shall support the following status information about each Vehicle Priority, including vehicle identifier, network identifier, link identifier and intersection identifier.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the following status information about each LCS, including network identifier, LCS identifier, LCS name, Location and Status.",
      "The Center shall provide the following status information about each DMS, including network identifier, DMS identifier, DMS name.",
      "The Center shall support the following status information about each ESS, including network identifier, environmental sensor identifier, environment sensor name, type, location and status.",
      "The Center shall support the following status information about each Bus Location, including network identifier, link identifier, bus identifier, bus name, location and schedule adherece.",
      "The Center shall support the following status information about each Light/Commuter Location, including network identifier, link identifier, commuter or light rail identifier, commuter or light rail name, location and schedule adherence.",
      "The Center shall support the following status information about each School Zone, including network identifier, link identifier, school zone identifier and school zone name."
    ]
  },
  {
    "text": "To support HOV Lane control in other centers, the Center shall be able to support the following device control command for a HOV Lane, including network identifier, HOV Lane identifier, username, password and lane plan.",
    "id": [
      1189,
      1191,
      1182,
      1180,
      1172,
      1174,
      1188,
      1186,
      1190,
      1197
    ],
    "example": [
      "To support Reversible Lane control in other centers, the Center shall be able to support the following device control command for a Reversible Lane, including network identifier, reversible lane identifier, username, password, plan and duration.",
      "To support Dynamic Lane control in other centers, the Center shall be able to support the following device control command for a Dynamic Lane, including network identifier, dynamic lane identifier, username, password and lane plan.",
      "To support Traffic Signal control in other centers, the Center shall be able to support the following device control command for a Traffic Signal, including network identifier, traffic signal identifier, username, password and traffic signal plan identifier.",
      "To support HAR control in other centers, the Center shall be able to support the following device control command for a HAR, including network identifier, HAR identifier, username, password and message.",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "To support LCS control in other centers, the Center shall be able to support the following device control command for a LCS, including network identifier, LCS identifier, username and Password.",
      "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
      "To support School Zone control in other centers, the Center shall be able to support the following device control command for a School Zone, including network identifier, school zone identifier, username, password and plan.",
      "The Center shall support the following status information about each Dynamic Lane, including network identifier, link identifier, dynamic lane identifier, dynamic lane name and failure state.",
      "The Center shall support the following status information about each Vehicle Priority, including vehicle identifier, network identifier, link identifier and intersection identifier."
    ]
  },
  {
    "text": "The map shall be capable of displaying the following for a CCTV.",
    "id": [
      1216,
      1232,
      1217,
      1175,
      1177,
      1176,
      823,
      1211,
      1178,
      1143
    ],
    "example": [
      "The map shall be capable of displaying the following for a DMS.",
      "Once an Center is selected, the user shall be able to select a CCTV from a list and provide the following information.",
      "The map shall be capable of displaying the following for a LCS.",
      "The Center shall provide the information status information about each CCTV, including network identifier, CCTV identifier, CCTV name, Location and Status.",
      "To support video snapshots, the Center shall be able to support the status information, including network identifier, CCTV identifier, CCTV name and status.",
      "To support CCTV control in other centers, the Center shall be able to support the following CCTV control request, including network identifier, CCTV identifier, username, Password.",
      "The Tactical Control System shall have the capability to load a map onto the display, to zoom in and out, to scroll, to print, and to clear a map on the map display.",
      "Each link displayed on the map shall be color coded to provide a graphical depiction of speeds.",
      "To support CCTV switching in other centers, the Center shall be able to support the following CCTV switching command, including network identifier, username, Password and video channel input identifier.",
      "The Tactical Control System HCI shall provide for on-screen information to include, as a minimum, overlays, headers, cursors, alphanumeric annotation, waypoints, crosshairs, designed to be visible against the complete spectrum of map and payload video backgrounds."
    ]
  },
  {
    "text": "The Incident GUI shall allow the user to input the following information for each lane closure.",
    "id": [
      1219,
      1214,
      1223,
      1220,
      1218,
      1224,
      1225,
      366,
      1221,
      1227
    ],
    "example": [
      "The Incident GUI shall allow the user to input the following information for each incident.",
      "The user shall be able to click on an incident icon to obtain further information about the incident.",
      "The GUI shall provide a list of previously entered lane closures.",
      "The GUI shall provide a list of previously entered incidents.",
      "The Incident GUI shall allow the user to enter incident or lane closure information without the use of an Center.",
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The GUI shall allow the data about an incident to be modified.",
      "When the GUI application is initiated, the user shall be prompted for the following information, including User name and Password."
    ]
  },
  {
    "text": "The Incident GUI shall be implemented using C/C++ and ESRI Map Objects.",
    "id": [
      1247,
      1107,
      1246,
      1221,
      972,
      1094,
      793,
      1219,
      1226,
      576
    ],
    "example": [
      "The Remote Control GUI shall be implemented using C/C++ and ESRI Map Objects.",
      "The Tactical Control System HCI shall be a Graphical User Interface (GUI) based on X-windows and Motif.",
      "The Center-to-Center web interface shall be implemented using C/C++ and ESRI ARC IMS.",
      "The GUI shall allow the data about an incident to be modified.",
      "The Tactical Control System shall be capable of importing map information via operator procedure and shall be capable of incorporating vector format and Compressed ADRG (CADRG) maps.",
      "Tactical Control System software shall provide a windows based graphic operator interface.",
      "As an objective, the Tactical Control System shall have the capability to import as well as create and modify map display overlays for fire support coordination measures [SSS547], airspace control measures [SSS548], and threat identification measures.",
      "The Incident GUI shall allow the user to input the following information for each incident.",
      "The remote Center Control GUI shall be designed to execute on a public network (e.g., Internet) and transmit equipment requests to the C-2-C software system.",
      "The translation will provide the correlator with specific goal oriented hardware configuration tables to satisfy the configuration requested by the A second interface with a human GUI will also allow for configuration of the correlator hardware, preferably through the same table structures used above."
    ]
  }
]