[
  {
    "text": "The DigitalHome web server communicates, through a home wireless gateway device, with the sensor and controller devices in the home.",
    "id": [
      37,
      57,
      36,
      38,
      39,
      58,
      10,
      40,
      60,
      1021
    ],
    "example": [
      "The home web server will provide interaction with and control of the DigitalHome elements.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer.",
      "The home web server will provide storage of DigitalHome plans and data.",
      "The home web server will provide ability to establish and maintain DigitalHome User Accounts.",
      "Each DigitalHome shall contain a master control device (the DigitalHome Gateway Device) that connects to the home’s broadband Internet connection, and uses wireless communication to send and receive communication between the DigitalHome system and the home devices and systems.",
      "The user communicates through a personal web page on the DigitalHome web server or on a local home server.",
      "The home web server will provide backup service for user account information, user plans and a home database.",
      "Using wireless communication, sensor values can be read and saved in the home database.",
      "Remotely hosted applications shall communicate in a client server relationship via the defined data server interface."
    ]
  },
  {
    "text": "The general user is familiar with the layout of his/her home and the location of sensor and control devices (for temperature, for humidity, and for power to small appliances and lighting units).",
    "id": [
      56,
      16,
      1,
      62,
      89,
      2,
      9,
      73,
      84,
      59
    ],
    "example": [
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "A “Smart House” is a home management system that allows home residents to easily manage their daily lives by providing for a lifestyle that brings together security, environmental and energy management (temperature, humidity and lighting), entertainment, and communications.",
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "The Smart House components consist of household devices (e.g., a heating and air conditioning unit, a security system, and small appliances and lighting units, etc.), sensors and controllers for the devices, communication links between the components, and a computer system, which will manage the components.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "The DigitalHome programmable humidistat shall allow a user to monitor and control a home’s humidity from any location, using a web ready computer, cell phone, or PDA.",
      "The DigitalHome programmable Appliance Manager shall provide for management of a home’s small appliances, including lighting units, by allowing a user to turn them on or off as desired.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches)."
    ]
  },
  {
    "text": "A DigitalHome Technician has experience with the type of hardware, software, and web services associated with a system like the DigitalHome system.",
    "id": [
      22,
      21,
      23,
      1095,
      28,
      107,
      206,
      80,
      16,
      57
    ],
    "example": [
      "A DigitalHome Technician is specially trained by DigitalHomeOwner to be familiar with the functionality, architecture, and operation of the DigitalHome system product.",
      "A DigitalHome Technician is responsible for setting up and maintaining the configuration of a DigitalHome system.",
      "A DigitalHome Technician will have rights beyond the DigitalHome General User, capable of setting up and making changes in the configuration of the system (e.g.,setting system parameters and establishing user accounts), and starting and stopping operation of the DigitalHome System.",
      "Training software is the software that provides the computer based training functionality for the system operator.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "Internet skills that will enable them to use this software.",
      "The DigitalHome security system consists of contact sensors and a set security alarms.",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems."
    ]
  },
  {
    "text": "However, the simulated environment will be realistic and adhere to the physical properties and constraints of an actual home and to real sensors and controllers.",
    "id": [
      31,
      14,
      16,
      1,
      56,
      9,
      44,
      62,
      89,
      646
    ],
    "example": [
      "The DigitalHome system will be tested in a simulated environment.",
      "The prototype DigitalHome software system will be situated in a simulated environment.",
      "The general user shall be able to use the DigitalHome system capabilities to monitor and control the environment in his/her home.",
      "A “Smart House” is a home management system that allows home residents to easily manage their daily lives by providing for a lifestyle that brings together security, environmental and energy management (temperature, humidity and lighting), entertainment, and communications.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "They should be organized such that all inputs and outputs can be simulated if necessary."
    ]
  },
  {
    "text": "Although the system to be developed is a “proof of concept” system intended to help Homeowner Inc.",
    "id": [
      110,
      36,
      5,
      12,
      0,
      509,
      27,
      9,
      1159,
      8
    ],
    "example": [
      "HomeOwner has designated object-oriented development, using UML 2.0, as the preferred method for development of software for HomeOwner products.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer.",
      "This initial version of DigitalHome will be a limited prototype version, which will be used by HomeOwner management to make business decisions about the future commercial development of DigitalHomeOwner products and services.",
      "The Digital Home High Level Requirements Definition is intended as a prototype, which will allow business decisions to be made about future development of a commercial product.",
      "This document specifies the requirements for the development of a “Smart House”, called DigitalHome (DH), by the DigitalHomeOwner Division of HomeOwner Inc.",
      "The proposed functional architecture is modeled around centralized deployment to facilitate ease of maintenance and leverage advancement in open standards and web technologies.",
      "The development team will use the development process specified by the Digital HomeOwner Inc.",
      "The Digital Home system, for the purposes of this document, is a system that will allow a home user to manage devices that control the environment of a home.",
      "The software is being designed so that multiple instances of a building block can be deployed by simply “configuring” the building block of operation within a specific agency.",
      "These document were prepared by the DigitalHomeOwner Division, in consultation with the Marketing Division of HomeOwner Inc."
    ]
  },
  {
    "text": "The home system shall require an Internet Service Provider (ISP).",
    "id": [
      36,
      41,
      58,
      57,
      533,
      37,
      206,
      39,
      1161,
      338
    ],
    "example": [
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer.",
      "The DigitalHome Gateway device shall provide communication with all the DigitalHome devices and shall connect with a broadband Internet connection.",
      "Each DigitalHome shall contain a master control device (the DigitalHome Gateway Device) that connects to the home’s broadband Internet connection, and uses wireless communication to send and receive communication between the DigitalHome system and the home devices and systems.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "The CCTNS system should use HTTPS as the communication protocol, i.e., HTTP over an encrypted secure socket layer (SSL) ",
      "The home web server will provide interaction with and control of the DigitalHome elements.",
      "Internet skills that will enable them to use this software.",
      "The home web server will provide ability to establish and maintain DigitalHome User Accounts.",
      "Systems will interface to the “cloud” using a project defined protocol.",
      "The Space Fractions system will be available over the Internet via the S2S website."
    ]
  },
  {
    "text": "The Internet Service Provider should be widely available (cable modem, high speed DSL), such as Bright House or Bellsouth FastAccess.",
    "id": [
      41,
      58,
      206,
      1024,
      36,
      533,
      105,
      545,
      57,
      374
    ],
    "example": [
      "The DigitalHome Gateway device shall provide communication with all the DigitalHome devices and shall connect with a broadband Internet connection.",
      "Each DigitalHome shall contain a master control device (the DigitalHome Gateway Device) that connects to the home’s broadband Internet connection, and uses wireless communication to send and receive communication between the DigitalHome system and the home devices and systems.",
      "Internet skills that will enable them to use this software.",
      "The intercom system shall be compatible with service specific voice communication systems.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer.",
      "The CCTNS system should use HTTPS as the communication protocol, i.e., HTTP over an encrypted secure socket layer (SSL) ",
      "The DigitalHome web system shall provide for authentication and information encryption through a recognized reliable and effective security technology, such as Transport Layer Security.",
      "The CCTNS system should ensure high scalability and performance through leveraging Asynchronous HTTP socket capabilities of web server for scalability and performance.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface."
    ]
  },
  {
    "text": "The system shall be able to use a power switch to change the state of the appliance (e.g., from “off” to “on”).",
    "id": [
      87,
      53,
      86,
      85,
      84,
      82,
      88,
      56,
      51,
      617
    ],
    "example": [
      "The system shall be able to change the state of a power switch (OFF to ON, or ON to OFF), in turn changing the state of an appliance connected to the power switch.",
      "The system shall include digital programmable power switches which shall be used to monitor the current state of an appliance (e.g., a coffee maker is off or on).",
      "The system shall be able to provide information about the state of a power switch (OFF or ON), indicating the whether an appliance connected to the power switch is OFF or ON.",
      "The Appliance Manager shall be able to manage up to one hundred 115 volt, 10 amp power switches.",
      "The DigitalHome programmable Appliance Manager shall provide for management of a home’s small appliances, including lighting units, by allowing a user to turn them on or off as desired.",
      "A DigitalHome system shall be able to activate both light and sound alarms: one sound alarm and one light alarm subsystem, with multiple lights.",
      "If a user changes the state of power switch device manually, the device shall remain in that state until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "The system shall include magnetic alarm contact switches which shall be used to monitor entry through a door or window when the switch is active.",
      "The UPS devices need the ability to signal the Correlator Monitor and Control System when a power outage has occurred and keep the Correlator Monitor and Control System apprised of time remaining on backup power."
    ]
  },
  {
    "text": "The thermostats may be controlled individually or collectively, so that temperature can be controlled at different levels in different home spaces.",
    "id": [
      46,
      44,
      67,
      66,
      65,
      47,
      62,
      56,
      64,
      45
    ],
    "example": [
      "The controller part of thermostat shall provides a “set point” temperature that is used to control the flow of heat energy (by switching heating or cooling devices on or off as needed) to achieve the set point temperature.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "For each thermostat, up to twenty-four one hour settings per day for every day of the week can be scheduled.",
      "A single thermostat shall be placed in an enclosed space (e.g., a room in the house) for which the air temperature is to be controlled.",
      "Up to eight thermostats shall be placed in rooms throughout the home.",
      "The sensor part of the thermostat has a sensitivity range between 14ºF and 104ºF (-10ºC and 40ºC).",
      "The DigitalHome programmable thermostat shall allow a user to monitor and control a home’s temperature from any location, using a web ready computer, cell phone, or PDA.",
      "The DigitalHome System shall allow a web-ready computer, cell phone or PDA to control a home's temperature, humidity, lights, security, and the state of small appliances.",
      "A DigitalHome user shall be able to set the thermostat temperatures to between 60 °F and 80 °F, inclusive, at one degree increments.",
      "The thermostat shall provide a reading of the current temperature in the space where the thermostat is located."
    ]
  },
  {
    "text": "A DigitalHome system shall use wireless signals to communicate, through the master control unit, with the humidistats.",
    "id": [
      69,
      58,
      939,
      42,
      860,
      947,
      48,
      901,
      59,
      1030
    ],
    "example": [
      "A thermostat unit shall communicate, through wireless signals, with the master control unit.",
      "Each DigitalHome shall contain a master control device (the DigitalHome Gateway Device) that connects to the home’s broadband Internet connection, and uses wireless communication to send and receive communication between the DigitalHome system and the home devices and systems.",
      "The Tactical Control System shall have the ability to interface with Service specific ground and airborne Ultra High Frequency (UHF), Very High Frequency (VHF), UHF/VHF, and High Frequency (HF) radios for digital message transmission while using the same radios for record traffic.",
      "The Gateway shall contain an RF Module, which shall send and receive wireless communications between the Gateway and the other DigitalHome devices (sensors and controllers).",
      "The Tactical Control System shall provide the functionality to control the power, transmitter signal strength, and frequencies used by ADT for data link communication.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate digital communication with peripheral devices.",
      "The system shall include digital programmable humidistats, which shall be used to monitor and regulate the humidity of an enclosed space.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices."
    ]
  },
  {
    "text": "An environmental sensor or controller device shall have to be within 1000 feet of the master control device, in order to be in communication with the system.",
    "id": [
      59,
      69,
      43,
      97,
      1072,
      904,
      44,
      905,
      980,
      625
    ],
    "example": [
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "A thermostat unit shall communicate, through wireless signals, with the master control unit.",
      "The Gateway device shall operate up to a 1000-foot range for indoor transmission.",
      "Sensor (temperature, humidity, contact sensor, power state) shall have a minimum data acquisition rate of 10 Hz.",
      "The Tactical Control System shall have sufficient throughput to support the processing requirements of the selected data link.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "This requirement is to allow correlator power monitoring and control to continue in the event of an Monitor and Control System network failure."
    ]
  },
  {
    "text": "Although there are no specific safety requirements, high system reliability is important to insure there are no system failures in carrying out user requests.",
    "id": [
      518,
      625,
      627,
      98,
      540,
      591,
      1112,
      519,
      528,
      520
    ],
    "example": [
      "The CCTNS system should be designed in manner that operational data is not lost in case of any failure of equipment or communication network.",
      "This requirement is to allow correlator power monitoring and control to continue in the event of an Monitor and Control System network failure.",
      "Aside from a networking or CPU failure, it should never be necessary to directly access a CPU to display error messages.",
      "The DigitalHome System must be highly reliable with no more than 1 failure per 10,000 hours of operation.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The ability of the Correlator System to achieve and maintain high reliability and uptime will be vitally dependent upon reliable operation and rapid diagnosis and repair of faults in the hardware and software systems.",
      "All Tactical Control System operator inputs shall be error checked such that any erroneous operator entry will not cause current processing to terminate.",
      "The CCTNS system should work even in an offline mode with the critical functionality ",
      "The CCTNS system should be designed for access through browser-based systems and must impose minimal requirements on the client device ",
      "The CCTNS system should be designed to have satisfactory performance even in Police Stations connected on low-bandwidth "
    ]
  },
  {
    "text": "There are six components of the ASPERA-3 package, plus the orbit and attitude data from the spacecraft: Data Processing Unit(DPU), Electron Spectrometer(ELS), Ion Mass Analyzer(IMA), Neutral Particle Detector(NPD), Neutral Particle Imager(NPI), Scanning Unit(SU), Orbit/Attitude(OA).",
    "id": [
      114,
      911,
      162,
      117,
      909,
      112,
      139,
      122,
      113,
      813
    ],
    "example": [
      "ASPERA-3 contains a number of different sensors that will measure the particles, neutral atoms, and fields in the near Martian environment.",
      "Payload data includes the digital and analog imagery and associated telemetry sent to the Tactical Control System from each of these payloads.",
      "The APAF data system requirements for delivering the ASPERA-3 IDFS data, Mars Express Orbit/Attitude IDFS data, and software are described in the following table.",
      "The ASPERA-3 Processing and Archiving Facility (APAF) is a ground data system responsible for processing all of the ASPERA-3 telemetry.",
      "The Tactical Control System shall have the functionality to process payload product data from Electro Optical (EO), Infrared (IR), and Synthetic Aperture Radar (SAR) payloads.",
      "This Software Requirements Specification (SRS) identifies the requirements for the ASPERA-3 Processing and Archiving Facility (APAF) ground data system for the Mars Express mission.",
      "Web-based displays defined by ASPERA-3 team shall be provided where any available ASPERA-3 data (as opposed to just the most current) can be used for science analysis to support the ASPERA-3 team in meeting mission goals and objectives.",
      "The APAF ground data system is to provide data processing algorithms and support to IRF for the ASPERA-3 science team (including Co-I’s) in preparation for the Mission Operations and Data Analysis (MO&DA) phase of the Mars Express mission.",
      "The ASPERA-3 instrument package will be flown on the Mars Express mission of the European Space Agency (ESA) and will be launched in June 2003 according to the current schedule.",
      "The Tactical Control System flight route planner will provide payload search area information, such as visual acuity range due to atmospheric conditions, diurnal transition periods for thermal imagery, and lunar and solar terrain shadowing."
    ]
  },
  {
    "text": "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the internal interfaces.",
    "id": [
      147,
      121,
      198,
      563,
      514,
      196,
      1088,
      673,
      558,
      191
    ],
    "example": [
      "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the virtual instrument data items.",
      "Each of the seven components described above will have an associated Software Design Document (SDD) that will define and fully describe all of the data products contained within each individual virtual instrument.",
      "The definitions section is intended to assist the technical designers as well as the client in clarifying the terms used throughout the document.",
      "The remainder of this document contains a more detailed description of the Correlator Monitor and Control System as well as the primary requirements necessary to design and build the EVLA Correlator Monitor and Control System.",
      "The core services, support layer and security and access control components can be deployed as standard components with necessary configuration changes.",
      "This document is designed to provide information to both the client and the technical designers of the software.",
      "The Tactical Control System core software shall be generically written to provide level one through level five interaction for both Outrider and Predator UAVs and establish the architecture for future tactical UAVs.",
      "Requirements pertaining to the TCS external interfaces are covered in separate Interface Design ",
      "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
      "The SRS will include the details of the system's requirements, interface, design issues, and components."
    ]
  },
  {
    "text": "There are no security requirements associated with the APAF ground data system.",
    "id": [
      180,
      177,
      179,
      188,
      183,
      181,
      176,
      220,
      223,
      186
    ],
    "example": [
      "Therefore, there are no safety requirements of the APAF ground data system.",
      "There are no installation-dependent requirements for the operation of the APAF data system.",
      "The APAF data system will not impose hazards to personnel, property, or the environment.",
      "There are no requirements of the APAF data system that need special treatment or consideration at this time.",
      "There are no requirements that constrain the design and implementation of the APAF software.",
      "Although the APAF data system and associated software will be developed with the highest quality possible, there are no requirements concerned with software quality.",
      "The APAF data system is not required to operate in more than one state or mode.",
      "The Space Fractions system will not be dependent on any other software and is not a component of another program.",
      "The Space Fractions system does not require any new hardware.",
      "Since the members of the SwRI software team are experienced with data system and IDFS processing software development, there are no training-related requirements for developers of the APAF data system."
    ]
  },
  {
    "text": "The requirements associated with computer resources are listed in the table below.",
    "id": [
      200,
      129,
      54,
      1165,
      128,
      253,
      153,
      159,
      152,
      149
    ],
    "example": [
      "This section includes information such as functional and data requirements, general constraints, and assumptions.",
      "The requirements associated with the functionality of the APAF ground data system are itemized in the table below.",
      "This section provides a description of the functional requirements.",
      "Requirements are listed in separate sections and in table format for each functional area.",
      "The APAF ground data system requirements are categorized according to functional areas and are defined in the following sections in table format.",
      "The following table summarizes the external interface requirements for the Space Fractions system.",
      "The mnemonic, CR, is used in the requirement identifiers to show that these requirements are Computer resource Requirements.",
      "The logistics-related requirements of the APAF ground data system are itemized in the following table.",
      "Computer resources include computer hardware, computer software, and computer communication.",
      "The requirement associated with the privacy of the APAF ground data system is in the table below."
    ]
  },
  {
    "text": "The mnemonic, LR, is used in the requirement identifiers to show that these requirements are Logistical ",
    "id": [
      163,
      130,
      1168,
      153,
      54,
      124,
      556,
      202,
      150,
      198
    ],
    "example": [
      "The mnemonic, DR, is used in the requirement identifiers to show that these requirements are Delivery Requirements.",
      "The mnemonic, FR, is used in the requirement identifiers to show that these requirements are Functional Requirements unless otherwise specified.",
      "The Requirement Category Mnemonic is a two-letter mnemonic for each functional area.",
      "The mnemonic, CR, is used in the requirement identifiers to show that these requirements are Computer resource Requirements.",
      "This section provides a description of the functional requirements.",
      "Section 2 is an overview of the descriptions of requirement determination, qualification procedures, rationale, and traceability that are used in the identification and the definitions of the requirements.",
      "The requirements contained in this document are numbered based on the section/subsection in which they appear.",
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document.",
      "The mnemonic, PR, is used in the requirement identifier to show that this requirement is a Privacy Requirement.",
      "The definitions section is intended to assist the technical designers as well as the client in clarifying the terms used throughout the document."
    ]
  },
  {
    "text": "ASPERA-3 IDFS data and MEX OA IDFS data shall be provided to NASA PDS.",
    "id": [
      168,
      169,
      170,
      123,
      144,
      118,
      172,
      122,
      162,
      173
    ],
    "example": [
      "ASPERA-3 data shall be provided to NASA PDS in PDS-compliant form.",
      "ASPERA-3 data shall be calibrated and validated prior to depositing in the NASA PDS.",
      "ASPERA-3 data shall be provided to NASA PDS no later than 6 months after acquisition.",
      "In addition, validation and archiving of all ASPERA-3 scientific data in the NASA Planetary Data System (PDS) within 6 months of receipt in a form useable by the general scientific community is to be provided by the APAF.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "The APAF data system acquires the telemetry data via NISN, processes the data into IDFS data sets, distributes the IDFS data sets to the ASPERA-3 team, provides web-based displays of the most current data for public view, stores the telemetry and IDFS data sets on a local SwRI archive, and submits the ASPERA-3 IDFS data sets to PDS for long-term archival.",
      "Science analysis software shall be integrated into the NASA approved data repository.",
      "The APAF ground data system is to provide data processing algorithms and support to IRF for the ASPERA-3 science team (including Co-I’s) in preparation for the Mission Operations and Data Analysis (MO&DA) phase of the Mars Express mission.",
      "The APAF data system requirements for delivering the ASPERA-3 IDFS data, Mars Express Orbit/Attitude IDFS data, and software are described in the following table.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made avaiable to the ASPERA=3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives."
    ]
  },
  {
    "text": "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
    "id": [
      143,
      144,
      173,
      139,
      165,
      161,
      171,
      140,
      137,
      690
    ],
    "example": [
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made avaiable to the ASPERA=3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Web-based displays defined by ASPERA-3 team shall be provided where any available ASPERA-3 data (as opposed to just the most current) can be used for science analysis to support the ASPERA-3 team in meeting mission goals and objectives.",
      "ASPERA-3 IDFS data that are electronically distributed shall be provided to the ASPERA-3 Co-I’s within 24 hours of acquiring ASPERA-3 telemetry as long as the transmission and processing are error-free to support the ASPERA-3 team in meeting MEX mission goals and objectives ",
      "SwRI shall provide software support for the APAF system.",
      "SwRI shall provide IDFS data processing algorithms to IRF.",
      "The web-based displays defined by the ASPERA-3 team to be used for science analysis shall be password protected until the ASPERA-3 data is made public to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be stored on a local SwRI archive for data availability and re-processing, and to support the ASPERA-3 team.",
      "The software will provide the UAV operator the necessary tools for computer related communications, mission tasking, mission planning, mission execution, data receipt, data processing, limited data exploitation, and data dissemination."
    ]
  },
  {
    "text": "This section identifies the requirements considered but not part of the APAF ground data system requirements.",
    "id": [
      187,
      188,
      129,
      128,
      149,
      1064,
      176,
      177,
      159,
      180
    ],
    "example": [
      "In addition, the APAF Operations Procedures Document shall provide installation and operations procedures of the APAF system in enough detail where there are no training-related requirements for users and operators of the APAF data system.",
      "There are no requirements of the APAF data system that need special treatment or consideration at this time.",
      "The requirements associated with the functionality of the APAF ground data system are itemized in the table below.",
      "The APAF ground data system requirements are categorized according to functional areas and are defined in the following sections in table format.",
      "The requirement associated with the privacy of the APAF ground data system is in the table below.",
      "This section not applicable, therefore tailored out.",
      "The APAF data system is not required to operate in more than one state or mode.",
      "There are no installation-dependent requirements for the operation of the APAF data system.",
      "The logistics-related requirements of the APAF ground data system are itemized in the following table.",
      "Therefore, there are no safety requirements of the APAF ground data system."
    ]
  },
  {
    "text": "At the end of the system, students will be given feedback based on their system scores.",
    "id": [
      300,
      228,
      317,
      310,
      205,
      232,
      297,
      308,
      294,
      301
    ],
    "example": [
      "Feedback is provided after each question to help players understand their performance and learn from their mistakes, reinforcing the educational goals of the game.",
      "The Space Fractions system will have an ending scene where the user's score is calculated and ranked, with an option to quit the system or try again.",
      "The tool then performs a validation check on the submitted data to ensure completeness and contextual relevance to the game's educational objectives.",
      "The dynamic nature of the conclusion serves to emphasize the educational progress and decisions of the player, offering a personalized ending that varies from one session to another based on the player's performance.",
      "Moreover, these students (as well as the teacher) are assumed to have basic computer and ",
      "The user's score must be kept as local data within the Space Fractions system so that the results may be given at the end of the Space Fractions system.",
      "After completing a predetermined set of questions, the player is directed to the concluding scene of the game, providing closure to the educational journey.",
      "The primary outputs of the ending scene include the display of the player's total score accumulated throughout the system and a tailored narrative conclusion.",
      "If the player selects the correct answer, a confirmation message is displayed, and the component transitions to the next question, maintaining engagement and providing positive reinforcement.",
      "The ending scene serves as the culmination of the player's journey through the system, providing a conclusion to the storyline that reflects their performance across critical decision points. "
    ]
  },
  {
    "text": "However, Alice is really interested in learning fractions and enjoys working with other students.",
    "id": [
      216,
      249,
      210,
      208,
      324,
      332,
      215,
      209,
      207,
      240
    ],
    "example": [
      "Claire enjoys teaching sixth graders and is interested in finding innovative ways to teach her students.",
      "This gives Bobby the competition he requires and allows Alice to have a unique experience the next time through the program.",
      "Alice would rather read a story or talk with friends.",
      "Alice is a sixth grade female student learning fractions who does not like to use computers.",
      "This component aims to extend the educational value of the system by integrating additional, topic-relevant resources that support and deepen the player's understanding of mathematics.",
      "This functionality facilitates a seamless integration of supplemental educational resources, ensuring that players have the opportunity to engage with a broader range of topics and materials at their own pace.",
      "Claire is a sixth grade teacher who has computer skills.",
      "Although Alice has used computers for email and systems, Alice considers computers to be boring.",
      "The personas we will use to model our intended users are a sixth grade female student called Alice learning fractions who does not like to use computers, a sixth grade male student called Bobby learning fractions who is very competitive and a sixth grade teacher with computer skills called Claire.",
      "The information and interface will be effective so that Bobby will easily recognize what to do to start the system immediately and Alice will have no problems navigating through the help section to understand the rules and systemplay."
    ]
  },
  {
    "text": "Bobby enjoys playing competitive sports and using computers, especially to play systems.",
    "id": [
      213,
      212,
      211,
      249,
      245,
      214,
      240,
      324,
      152,
      278
    ],
    "example": [
      "Bobby particularly likes to play systems where Bobby can excel.",
      "Bobby has used computers since age five.",
      "Bobby is a sixth grade male student learning fractions who is very competitive.",
      "This gives Bobby the competition he requires and allows Alice to have a unique experience the next time through the program.",
      "Bobby will be captivated by the storyline and will wish to progress as fast as possible.",
      "Bobby is only somewhat interested in learning about fractions.",
      "The information and interface will be effective so that Bobby will easily recognize what to do to start the system immediately and Alice will have no problems navigating through the help section to understand the rules and systemplay.",
      "This component aims to extend the educational value of the system by integrating additional, topic-relevant resources that support and deepen the player's understanding of mathematics.",
      "Computer resources include computer hardware, computer software, and computer communication.",
      "This menu aims to equip players with the necessary knowledge to start playing and offer additional learning resources, thereby enriching the overall game experience."
    ]
  },
  {
    "text": "Output will be sounds and animations through Flash movies to acknowledge success or failure in answering the fraction questions.",
    "id": [
      247,
      274,
      235,
      265,
      294,
      296,
      298,
      275,
      291,
      227
    ],
    "example": [
      "The last scene will be determined by the user's response on certain critical questions that impact the story's plot, and an option to try again will be presented.",
      "The output of this functional requirement is the visual and auditory presentation of the movie on the player's screen.",
      "Upon starting the Space Fractions system, the user is taken through a brief introductory movie to provide background story and information that will help them complete the fraction questions.",
      "In cases of invalid inputs, the output is an error message displayed on the user interface, guiding the player to provide a valid fraction.",
      "If the player selects the correct answer, a confirmation message is displayed, and the component transitions to the next question, maintaining engagement and providing positive reinforcement.",
      "The system sequence includes \"critical points\" where the storyline can diverge based on whether the player answers these pivotal questions correctly, adding an element of narrative depth and personalization to the gameplay experience.",
      "The output from this component consists of plot-based questions that incorporate fractions, tailored to both challenge the player's mathematical skills and advance the game's narrative.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "Players interact with this component by responding to the displayed questions.",
      "The Space Fractions system will have a series of fraction questions (testing arithmetic, equivalence, graphical interpretation, and improper versus proper fraction skills) that sequentially form a storyline related to the introduction."
    ]
  },
  {
    "text": "To start the Space Fractions system, the user will click on the corresponding button.",
    "id": [
      286,
      316,
      260,
      280,
      243,
      226,
      230,
      228,
      78,
      753
    ],
    "example": [
      "If the player opts to start the Space Fractions system, the system transitions to the game sequence, where gameplay begins immediately. ",
      "Upon the completion of data entry for a question, the administrator will use a submission button to initiate the update process.",
      "If the input is valid, the Space Fractions system calculates the velocity adjustment by converting the fraction into a decimal value and applying it to the spaceship's current velocity.",
      "One button initiates the game, leading players directly into the gameplay experience.",
      "The user will be given a problem and then must click the correct solution.",
      "The Space Fractions system will have a main menu, including a brief help section.",
      "The administrator of the Space Fractions system may wish to design a custom system complete with custom fraction questions.",
      "The Space Fractions system will have an ending scene where the user's score is calculated and ranked, with an option to quit the system or try again.",
      "If a humdistat device allows a user to make a manual temperature setting, the setting shall remain in effect until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "When executing in the Normal Startup Mode, the Tactical Control System shall provide the system functionality necessary to initialize the system to place it in the Operations State within 60 seconds from the time power is supplied and the Tactical Control System application is launched."
    ]
  },
  {
    "text": "Next, the user progresses through a series of questions in the form of cartoon images that comprise the main story.",
    "id": [
      289,
      298,
      297,
      227,
      291,
      235,
      238,
      281,
      315,
      242
    ],
    "example": [
      "The primary function of the system sequence is to engage players with a series of multiple-choice questions focused on fractions. These questions are integrated within a storyline that naturally follows the introductory narrative of the game.",
      "The output from this component consists of plot-based questions that incorporate fractions, tailored to both challenge the player's mathematical skills and advance the game's narrative.",
      "After completing a predetermined set of questions, the player is directed to the concluding scene of the game, providing closure to the educational journey.",
      "The Space Fractions system will have a series of fraction questions (testing arithmetic, equivalence, graphical interpretation, and improper versus proper fraction skills) that sequentially form a storyline related to the introduction.",
      "Players interact with this component by responding to the displayed questions.",
      "Upon starting the Space Fractions system, the user is taken through a brief introductory movie to provide background story and information that will help them complete the fraction questions.",
      "At the main title screen, the user will be able to view a general help screen to reveal basic instructions on system play.",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "Each question is managed on a separate page within the tool, and navigation between questions is streamlined through the use of a button to progress from one question to the next, ensuring a smooth and organized content update process.",
      "These questions will test the user's knowledge of basic fraction operations and will be presented as a multiple-choice questionnaire."
    ]
  },
  {
    "text": "The systemplay will be dynamic and adaptive to provide different storylines based on the user's progress.",
    "id": [
      299,
      296,
      283,
      258,
      287,
      288,
      285,
      304,
      275,
      290
    ],
    "example": [
      "Additionally, the sequence customizes the storyline's progression based on the player's performance at critical junctures, offering a dynamic and personalized gaming experience.",
      "The system sequence includes \"critical points\" where the storyline can diverge based on whether the player answers these pivotal questions correctly, adding an element of narrative depth and personalization to the gameplay experience.",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page.",
      "The source of these inputs is the player's interaction with the game's user interface during specific gameplay moments that require velocity adjustment.",
      "Alternatively, if the player selects the option to visit the Denominators' web page, the system facilitates this redirection, opening the web page either within the game environment or in a separate browser window, depending on the game's design and platform capabilities.",
      "This dual-path output allows for a customized experience that caters to the player's immediate preference, whether it be diving into the game or seeking additional information and resources.",
      "The output of interacting with the main menu is determined by the player's choice.",
      "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "This sequence is designed to challenge and educate players on fractions while advancing the plot, thereby keeping the educational content engaging and contextually relevant."
    ]
  },
  {
    "text": "As the system administrator, Claire can use the question updater to change any of the questions in the system.",
    "id": [
      313,
      252,
      663,
      19,
      900,
      898,
      251,
      316,
      91,
      315
    ],
    "example": [
      "Administrators interact with the Question Updater through a user-friendly interface consisting of pulldown menus and text fields. ",
      "Upon correct submission of her password, she uses an intuitive web forms interface to update the system to her desiring.",
      "The administrator shall have the ability to edit a user’s system access properties.",
      "For example, a Master User shall be able to add a user account or change the default parameter settings.",
      "The operator shall be able to manually override the automatic mode selection of the selected data terminal, if desired.",
      "The operator shall be able to manually override the automatic function selection of the selected data terminal, if desired.",
      "She navigates to the updater page, which asks for a password.",
      "Upon the completion of data entry for a question, the administrator will use a submission button to initiate the update process.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices ",
      "Each question is managed on a separate page within the tool, and navigation between questions is streamlined through the use of a button to progress from one question to the next, ensuring a smooth and organized content update process."
    ]
  },
  {
    "text": "The component actively listens for the player's input and, upon selection, proceeds according to the player's decision.",
    "id": [
      294,
      284,
      300,
      285,
      291,
      288,
      329,
      292,
      256,
      283
    ],
    "example": [
      "If the player selects the correct answer, a confirmation message is displayed, and the component transitions to the next question, maintaining engagement and providing positive reinforcement.",
      "This decision-making process ensures that the player's intent is accurately interpreted and the corresponding action is taken swiftly, maintaining a seamless transition from the menu to the player's selected activity.",
      "Feedback is provided after each question to help players understand their performance and learn from their mistakes, reinforcing the educational goals of the game.",
      "The output of interacting with the main menu is determined by the player's choice.",
      "Players interact with this component by responding to the displayed questions.",
      "This dual-path output allows for a customized experience that caters to the player's immediate preference, whether it be diving into the game or seeking additional information and resources.",
      "The system is designed to detect and respond to the player's choice by initiating the process to open the selected S2S project.",
      "The interaction involves selecting their answer from a set of multiple-choice options provided for each question. ",
      "The inputs will consist of fractions entered by the player using the game's interface. ",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page."
    ]
  },
  {
    "text": "The Question Updater is envisioned as a web-accessible tool designed specifically for system administrators.",
    "id": [
      313,
      1207,
      374,
      370,
      234,
      412,
      39,
      156,
      37,
      1243
    ],
    "example": [
      "Administrators interact with the Question Updater through a user-friendly interface consisting of pulldown menus and text fields. ",
      "The Web Map application generates a map that can be displayed on an Internet WWW server.",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The Space Fractions system will run on any Internet-accessible computer with a web browser that supports ",
      "Application user interfaces to meet its requirements and recommendations.",
      "The home web server will provide ability to establish and maintain DigitalHome User Accounts.",
      "There shall be a web server for the APAF system for web-based displays and information change.",
      "The home web server will provide interaction with and control of the DigitalHome elements.",
      "The web server application shall use ESRI's ARC Internet Map Server (ARC IMS) product for creating of map images."
    ]
  },
  {
    "text": "The Space Fractions system will consist of Flash movies linked together to form a web-based system: there will be a small introductory movie (~200KB), a main menu movie (~100KB), and a main system movie (1-2MB).",
    "id": [
      219,
      225,
      226,
      235,
      336,
      275,
      55,
      266,
      229,
      335
    ],
    "example": [
      "The Space Fractions system requires a web browser capable of running Flash movies.",
      "The Space Fractions system will have an introductory movie to set up the storyline.",
      "The Space Fractions system will have a main menu, including a brief help section.",
      "Upon starting the Space Fractions system, the user is taken through a brief introductory movie to provide background story and information that will help them complete the fraction questions.",
      "Due to the relatively small size of the introductory and main menu movies, they can be downloaded in approximately one minute with a modem connection.",
      "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
      "There is a DigitalHome Use Case Model in the Appendix, which provides an overview of the system functionality and shows the relationships between the DigitalHome System entities.",
      "The introductory movie serves to immerse players into the game's universe, setting the stage for the storyline and providing critical information to assist users in solving fraction-related puzzles.",
      "In addition, a component accessible over the World Wide Web will allow the series of fraction questions to be updated by an administrator of the Space Fractions system.",
      "However, the Space Fractions system will reside on the Internet so more than one user can access the product and download its content for use on their computer."
    ]
  },
  {
    "text": "Because Flash movies do not have to be fully downloaded to play, the main system can be played within a few minutes with a regular modem connection to the Internet.",
    "id": [
      336,
      335,
      219,
      341,
      17,
      321,
      234,
      500,
      57,
      36
    ],
    "example": [
      "Due to the relatively small size of the introductory and main menu movies, they can be downloaded in approximately one minute with a modem connection.",
      "However, the Space Fractions system will reside on the Internet so more than one user can access the product and download its content for use on their computer.",
      "The Space Fractions system requires a web browser capable of running Flash movies.",
      "For example, using appropriate sub- scenes in the main Flash system to split up the code will allow for easy alteration at a later date.",
      "Although the general user is not familiar with the technical features of the DigitalHome system, he/she is familiar with the use of a web interface and can perform simple web operations (logging in and logging out, browsing web pages, and submitting information and requests via a web interface).",
      "This system allows for real-time updates to the game's content without the need for system restarts or interruptions, enabling a seamless integration of new or revised educational material into the game sequence.",
      "The Space Fractions system will run on any Internet-accessible computer with a web browser that supports ",
      "In the event of any software or hardware failure, it must be possible to restore the CCTNS system (with inline synchronization) within no more than <xx> hours.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer."
    ]
  },
  {
    "text": "E-GOVERNANCE MISSION MODE PROJECT (MMP) ",
    "id": [
      340,
      1161,
      143,
      554,
      1020,
      984,
      1103,
      790,
      173,
      144
    ],
    "example": [
      "Maintainability is a primary goal for this project.",
      "Systems will interface to the “cloud” using a project defined protocol.",
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "The primary audience of this document includes, but is not limited to, project leaders, the designers and developers of the EVLA Correlator Monitor and Control System and the end user.",
      "The RTP interface shall support distributed processing capability.",
      "This prioritization schema has been validated by a Joint Requirements Oversight Council (JROC) Memorandum.",
      "The Tactical Control System HCI shall be a Graphical User Interface (GUI) based on X-windows and Motif.",
      "A Mission Plan shall include a Flight Route Plan for a selected AV, a Payload Plan for the selected payload, and a Communications Plan.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made avaiable to the ASPERA=3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives."
    ]
  },
  {
    "text": "The functionality of the CCTNS application is focused on providing value to the police personnel, especially the officers operating at the cutting edge and easing the day to day operations of the police function.",
    "id": [
      347,
      348,
      357,
      363,
      351,
      359,
      520,
      361,
      353,
      405
    ],
    "example": [
      "The key guiding principle behind the functional design of CCTNS V1.0 is to focus on the critical functionality that provides value to the police personnel at the cutting edge which in turn can improve the outcomes in the areas of “Investigation of Crime” and “Detection of Criminals”.",
      "CCTNS V1.0 functionality is designed to focus on delivering value to IOs, records room staff and citizens within the broad crime investigation area.",
      "The Search module of the CCTNS gives police personnel the ability to execute a basic or advanced search on cases.",
      "It shows information such as cases assigned, alerts, pending tasks etc hence helping police personnel to plan better and execute with greater efficiency.",
      "The Registration module acts as an interface between the police and citizens and it eases the approach, interaction and information exchange between police and complainants.",
      "It makes reporting easy for police by enabling them to execute different types of queries such as monthly reporting, RTI related etc.",
      "The CCTNS system should be designed to have satisfactory performance even in Police Stations connected on low-bandwidth ",
      "It improves overall productivity by helping citizens and police to cut short the drudgery of large amounts of paperwork.",
      "The Investigation module of the CCTNS facilitates the investigation process and introduces operational efficiencies by automating most of the tasks that take place after initial entries are made during Registration.",
      "The CCTNS system must provide End User and Administrator functions which are easy to use and intuitive throughout."
    ]
  },
  {
    "text": "It also gives the user the ability to customize the results view by criminal/accused or by cases.",
    "id": [
      1225,
      402,
      488,
      494,
      409,
      288,
      486,
      487,
      919,
      91
    ],
    "example": [
      "The GUI shall allow the data about an incident to be modified.",
      "The interfaces must be made customizable or user-configurable to the extent possible.(e.g., the displayed columns in the table, move, resize, modify the appearance).",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "Allowing users to see and change profiles: If user-specified profiles are used, users should be able to see, modify and delete that profile on demand.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "This dual-path output allows for a customized experience that caters to the player's immediate preference, whether it be diving into the game or seeking additional information and resources.",
      "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient.",
      "User adaptation can also be important for making the user interface more accessible.",
      "Overlays consist of information obtained from external sources that is selected by the operator for presentation with the imagery.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices "
    ]
  },
  {
    "text": "The Citizen Interface module of the CCTNS acts as a conduit for the information exchange between citizens and police units/personnel.",
    "id": [
      351,
      530,
      526,
      1152,
      517,
      529,
      389,
      356,
      348,
      391
    ],
    "example": [
      "The Registration module acts as an interface between the police and citizens and it eases the approach, interaction and information exchange between police and complainants.",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "This Center-to-Center infrastructure implements a repository for traffic data and provides a mechanism to exchange device control information between TMCs.",
      "The CCTNS system should support multilingual interface ",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "The CCTNS system must allow a user to be a member of more than one group.",
      "The Prosecution module of the CCTNS aids this interfacing by providing a platform to record entries of the court interactions.",
      "CCTNS V1.0 functionality is designed to focus on delivering value to IOs, records room staff and citizens within the broad crime investigation area.",
      "The CCTNS system should allow a user to stipulate which other users or groups can access cases."
    ]
  },
  {
    "text": "Citizens can use it as a tool to get information or acknowledgements from police.",
    "id": [
      350,
      351,
      360,
      359,
      358,
      363,
      352,
      391,
      348,
      361
    ],
    "example": [
      "Citizens can register their complaints with police and then based on the evidence, facts and following investigation, police shall take the complaint forward.",
      "The Registration module acts as an interface between the police and citizens and it eases the approach, interaction and information exchange between police and complainants.",
      "The police in turn can use it to respond to citizens with very little turnaround time.",
      "It makes reporting easy for police by enabling them to execute different types of queries such as monthly reporting, RTI related etc.",
      "Using the search functionality, police personnel can search for a particular person, type of crime, modus operandi, property etc.",
      "It shows information such as cases assigned, alerts, pending tasks etc hence helping police personnel to plan better and execute with greater efficiency.",
      "After a complaint is initiated, police initiates the investigation process.",
      "The CCTNS system should allow a user to stipulate which other users or groups can access cases.",
      "CCTNS V1.0 functionality is designed to focus on delivering value to IOs, records room staff and citizens within the broad crime investigation area.",
      "It improves overall productivity by helping citizens and police to cut short the drudgery of large amounts of paperwork."
    ]
  },
  {
    "text": "An audit trail is a record of actions taken by either the user or the CCTNS system triggers.",
    "id": [
      379,
      397,
      375,
      381,
      377,
      376,
      380,
      382,
      353,
      383
    ],
    "example": [
      "Once the audit trail functionality has been activated, the CCTNS system must track events without manual intervention, and store in the audit trail information about them.",
      "If the CCTNS system allows users to make unauthorised attempts to access cases, it must log these in the audit trail.",
      "This includes actions taken by users or Administrators, or actions initiated automatically by the CCTNS system as a result of system parameters.",
      "The CCTNS system must ensure that audit trail data is available for inspection on request, so that a specific event can be identified and all related data made accessible, and that this can be achieved by authorised external personnel who have little or no familiarity with the CCTNS system.",
      "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about the user initiating and or carrying out the action.",
      "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about all the actions (create/read/update/delete) that are taken upon the critical entities in the CCTNS system.",
      "The CCTNS system must maintain the audit trail for as long as required, which will be at least for the life of the case to which it refers.",
      "The CCTNS system must be able to export audit trails for specified cases (without affecting the audit trail stored by The CCTNS system).",
      "The Investigation module of the CCTNS facilitates the investigation process and introduces operational efficiencies by automating most of the tasks that take place after initial entries are made during Registration.",
      "This functionality can be used by external auditors who wish to examine or analyse system activity."
    ]
  },
  {
    "text": "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about the date and time of the event.",
    "id": [
      377,
      376,
      379,
      381,
      382,
      380,
      399,
      397,
      378,
      398
    ],
    "example": [
      "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about the user initiating and or carrying out the action.",
      "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about all the actions (create/read/update/delete) that are taken upon the critical entities in the CCTNS system.",
      "Once the audit trail functionality has been activated, the CCTNS system must track events without manual intervention, and store in the audit trail information about them.",
      "The CCTNS system must ensure that audit trail data is available for inspection on request, so that a specific event can be identified and all related data made accessible, and that this can be achieved by authorised external personnel who have little or no familiarity with the CCTNS system.",
      "The CCTNS system must be able to export audit trails for specified cases (without affecting the audit trail stored by The CCTNS system).",
      "The CCTNS system must maintain the audit trail for as long as required, which will be at least for the life of the case to which it refers.",
      "All error messages produced by the CCTNS system must be meaningful, so that they can be appropriately acted upon by the users who are likely to see them.",
      "If the CCTNS system allows users to make unauthorised attempts to access cases, it must log these in the audit trail.",
      "The word “unalterable” is to mean that the audit trail data cannot be modified in any way or deleted by any user.",
      "Any access to cases, and all other activities involving the cases and related documents or data should also need to be stored in the audit trail to ensure legal admissibility and to assist in data recovery."
    ]
  },
  {
    "text": "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about administrative parameters.",
    "id": [
      377,
      376,
      379,
      382,
      381,
      378,
      399,
      380,
      540,
      541
    ],
    "example": [
      "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about the user initiating and or carrying out the action.",
      "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about all the actions (create/read/update/delete) that are taken upon the critical entities in the CCTNS system.",
      "Once the audit trail functionality has been activated, the CCTNS system must track events without manual intervention, and store in the audit trail information about them.",
      "The CCTNS system must be able to export audit trails for specified cases (without affecting the audit trail stored by The CCTNS system).",
      "The CCTNS system must ensure that audit trail data is available for inspection on request, so that a specific event can be identified and all related data made accessible, and that this can be achieved by authorised external personnel who have little or no familiarity with the CCTNS system.",
      "The word “unalterable” is to mean that the audit trail data cannot be modified in any way or deleted by any user.",
      "All error messages produced by the CCTNS system must be meaningful, so that they can be appropriately acted upon by the users who are likely to see them.",
      "The CCTNS system must maintain the audit trail for as long as required, which will be at least for the life of the case to which it refers.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request."
    ]
  },
  {
    "text": "It may be subject to re-department and copying to removable media if required, so long as its contents remain unchanged.",
    "id": [
      455,
      623,
      624,
      1093,
      468,
      461,
      620,
      614,
      612,
      910
    ],
    "example": [
      "Providing printable document versions: If a document is either too long, dispersed over several pages or in a specific layout that is not suitable for online reading, a printer-friendly version of the document should be provided that prints the content in a form acceptable to the user (e.g.",
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible.",
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible.",
      "The Tactical Control System’s operating system and executable software shall be re-programmable without hardware disassembly.",
      "Providing alternative text-only pages: When style sheets and/or frames are turned off it should be possible for the user to read and understand the page; alternatively, the user should be provided with an equivalent alternative text-only page.",
      "Longer pages can be more appropriate when users want to read the content without interruptions or when the page needs to match a paper counterpart.",
      "Reboots should result in minimal system interruptions with the offending CPU reconfiguring and returning to service autonomously.",
      "The CMIB shall have control of hardware warm boots such that an external command from the Master Correlator Control Computer to reboot the CMIB shall have an option to force a hardware warm boot.",
      "The CMIB shall be able to read back the contents of all writeable hardware control registers where meaningful.",
      "This functionality, as a minimum, shall include: formatting, storing, internally routing, and recording the video [SSS190]; creating and storing a freeze frame of the video [SSS191]; retrieving and displaying the video [SSS192]; printing a hard copy of freeze frame video [SSS193]; and processing digital imagery for export and dissemination [SSS194]."
    ]
  },
  {
    "text": "The CCTNS system should be able to provide reports for actions on cases organised by workstation and (where technically appropriate) by network address.",
    "id": [
      391,
      530,
      540,
      536,
      541,
      526,
      523,
      388,
      381,
      542
    ],
    "example": [
      "The CCTNS system should allow a user to stipulate which other users or groups can access cases.",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "The CCTNS system should be developed for a centralized deployment and maintenance ",
      "The CCTNS system should provide for role-based control for the functionality within the CCTNS system ",
      "The CCTNS system must ensure that audit trail data is available for inspection on request, so that a specific event can be identified and all related data made accessible, and that this can be achieved by authorised external personnel who have little or no familiarity with the CCTNS system.",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server."
    ]
  },
  {
    "text": "The CCTNS system must be able to display several entities (cases, suspects) simultaneously.",
    "id": [
      391,
      504,
      530,
      529,
      502,
      384,
      547,
      534,
      517,
      531
    ],
    "example": [
      "The CCTNS system should allow a user to stipulate which other users or groups can access cases.",
      "The CCTNS system must be able to retrieve and display within 5-8 seconds the case which has been accessed within the previous 2 months, regardless of storage capacity or number of cases in the CCTNS system.",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "The CCTNS system must be able to perform a simple search within 5-8 seconds and a advanced search (multiple search criteria) within 10-15 seconds regardless of the storage capacity or number of cases in the CCTNS system.",
      "The CCTNS system must be able to capture and store violations (i.e.A user’s attempts to access a case to which he is denied access), and (where violations can validly be attempted) attempted violations, of access control mechanisms.",
      "The CCTNS system should ensure high scalability and performance through displaying of records on the screen in batches/paged manner. ",
      "The CCTNS system should run on multiple browsers.",
      "The CCTNS system should support multilingual interface ",
      "The CCTNS system should support multi-tier authentication where required "
    ]
  },
  {
    "text": "The user interfaces should be designed to make them user-intuitive.",
    "id": [
      487,
      431,
      434,
      414,
      488,
      404,
      492,
      486,
      409,
      402
    ],
    "example": [
      "User adaptation can also be important for making the user interface more accessible.",
      "Designing for input device independence: User interfaces should be designed to allow activation of controls by a variety of input devices.",
      "Making user interfaces robust: User interfaces should be designed to be as robust as possible in the face of changing technology.",
      "User interfaces should meet its requirements and recommendations.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "Making individualization and adaptation evident: It should be made evident to the user when individualization and/or adaptation are used.",
      "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "The interfaces must be made customizable or user-configurable to the extent possible.(e.g., the displayed columns in the table, move, resize, modify the appearance)."
    ]
  },
  {
    "text": "ICT accessibility: ISO 9241-20 shall be the standard for guidance on ICT accessibility.",
    "id": [
      413,
      415,
      476,
      475,
      419,
      1071,
      411,
      477,
      414,
      495
    ],
    "example": [
      "Software accessibility ISO 9241-171 shall be the standard for guidance on software accessibility.",
      "Content accessibility WCAG 1.0 shall be the standard used for guidance on content accessibility.",
      "Practical guidelines for presenting information to the user are to be found in ISO 9241-12.",
      "The International Standards mentioned below shall be consulted for guidance.",
      "General guidance on achieving self-descriptiveness is given in ISO 9241-110.",
      "The Tactical Control System shall conform with the National Institute for Standard Technology (NIST) Federal Information Processing Standard (FIPS) Publication 151-2 (POSIX.1).",
      "The user interfaces of the CCTNS system should comply with Standard ISO 9241.",
      "Guidance on selecting and using different forms of interaction techniques is to be found in ISO 9241-14 to ISO 9241-17.",
      "User interfaces should meet its requirements and recommendations.",
      "The user interfaces of the CCTNS system should follow the guidelines specified under www.usability.gov "
    ]
  },
  {
    "text": "Splash screens should be avoided unless they provide useful content or feedback about the application state to the user.",
    "id": [
      423,
      430,
      465,
      422,
      468,
      438,
      424,
      487,
      442,
      1221
    ],
    "example": [
      "If a splash screen is used, a navigation option to skip it should be offered.",
      "Horizontal scrolling should be avoided wherever possible.",
      "Using frames with care: If frames are used, care should be taken to avoid possible problems, for example, those involving the use of the back button, bookmarking of pages, or scrolling of information.",
      "Minimizing navigation effort: The number of navigation steps needed to reach a certain piece of content should be minimized as long as different mental models, navigation strategies and tasks of the user are taken into account.",
      "Providing alternative text-only pages: When style sheets and/or frames are turned off it should be possible for the user to read and understand the page; alternatively, the user should be provided with an equivalent alternative text-only page.",
      "Minimizing user errors: Potential user errors as well as the effort needed to recover from errors should be minimized.",
      "Avoiding opening unnecessary windows: Additional windows such as new browser windows or pop-up windows should only be opened if this supports the user’s task.",
      "User adaptation can also be important for making the user interface more accessible.",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "The Incident GUI shall allow the user to enter incident or lane closure information without the use of an Center."
    ]
  },
  {
    "text": "bandwidth between the application and the user).",
    "id": [
      335,
      374,
      10,
      370,
      486,
      57,
      37,
      1156,
      1159,
      1207
    ],
    "example": [
      "However, the Space Fractions system will reside on the Internet so more than one user can access the product and download its content for use on their computer.",
      "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
      "The user communicates through a personal web page on the DigitalHome web server or on a local home server.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "The home web server will provide interaction with and control of the DigitalHome elements.",
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "The software is being designed so that multiple instances of a building block can be deployed by simply “configuring” the building block of operation within a specific agency.",
      "The Web Map application generates a map that can be displayed on an Internet WWW server."
    ]
  },
  {
    "text": "Using familiar terminology for navigation links: Navigation links — particularly links representing the main navigation structure — should be labelled with terms that are familiar to the user, based on his/her general knowledge, prior experience in the application domain or experience of using other systems.",
    "id": [
      418,
      453,
      483,
      451,
      420,
      326,
      491,
      421,
      448,
      481
    ],
    "example": [
      "Making navigation self-descriptive: Navigation should be designed to help users understand where they are, where they have been and where they can go next.",
      "Distinguishing navigation links from controls: Navigation links should be clearly distinguishable from controls activating some action.",
      "Consistency between navigation components and content: If navigation components (or overviews) are shown in conjunction with associated content, consistency between the navigation component and the content shown should be maintained by indicating in the navigation component (e.g.",
      "Using descriptive link labels: The target or purpose of a link should be directly indicated by its label, avoiding generic labels such as “go” or “click here” except where the purpose of the link is clear from its context on the page or the labels have commonly understood semantics in the particular application domain.",
      "Showing users where they are: Each presentation segment (page or window) should provide the user with a clear and sufficient indication of where he or she is in the navigation structure and of the current segment position with respect to the overall structure.",
      "These links are presented within the system interface and lead to various World Wide Web documents.",
      "Taking account of the users’ tasks and information needs: When providing different access paths or navigation structures for different user groups, the tasks and information needs of these user groups should be taken into consideration.",
      "Offering alternative access paths: Alternative access paths for navigating to a specific unit of content should be offered to support different navigation strategies.",
      "Distinguishable within-page links: Within-page links should be clearly distinguishable from other links that lead to a different page.",
      "Linking back to the home page or landmark pages: Each page should contain a link leading to the home page of the application or to a landmark page that is easy to recognize for the user."
    ]
  },
  {
    "text": "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
    "id": [
      486,
      441,
      442,
      368,
      369,
      404,
      444,
      445,
      668,
      480
    ],
    "example": [
      "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient.",
      "Using appropriate formats, units of measurement or currency: When designing user interfaces for use by diverse groups, input and output of information elements such as currency, units of measurement, temperatures, date and time, phone numbers, address or postal codes should be designed so that they are usable.",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
      "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points.",
      "Supporting text skimming: Fast skimming of text should be supported by the provision of clear links, bulleted lists, highlighted keywords, logical headings, and short phrases and sentences.",
      "Software system and application code shall be well documented and written in a generally familiar language or languages.",
      "Appropriate content presentation also plays a key role in accessibility."
    ]
  },
  {
    "text": "in the expected layout, paper format, or orientation).",
    "id": [
      459,
      446,
      472,
      469,
      470,
      456,
      473,
      455,
      444,
      365
    ],
    "example": [
      "Selecting appropriate page lengths The length of a page should be selected so as to support the primary purpose and use of the page.",
      "Readability of text: Text presented on the pages should be readable taking into account the expected display characteristics and spatial arrangement.",
      "In such cases, pages can usually be grouped in different categories, using one layout scheme for each category consistently.",
      "Consistent page layout: Pages should be designed using consistent layout schemes, supporting the user in finding similar information at the same position on different pages.",
      "Overall layout schemes apply to all pages and are preferable when all pages have a similar structure.",
      "Use of “white space”: “White space” on a page i.e.",
      "Placing title information consistently: Page titles should be placed in a consistent location on the different pages.",
      "Providing printable document versions: If a document is either too long, dispersed over several pages or in a specific layout that is not suitable for online reading, a printer-friendly version of the document should be provided that prints the content in a form acceptable to the user (e.g.",
      "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points.",
      "With a proper configuration, information such as act and sections, state specific data, castes, tribes, property information etc."
    ]
  },
  {
    "text": "If profiles are used, it is important to provide users with information about this concept and its implications.",
    "id": [
      493,
      494,
      403,
      486,
      491,
      490,
      488,
      487,
      437,
      435
    ],
    "example": [
      "Making user profiles evident: If predefined user profiles or user-specified profiles are used for individualizing or adapting content, the profile currently used should be made evident.",
      "Allowing users to see and change profiles: If user-specified profiles are used, users should be able to see, modify and delete that profile on demand.",
      "Such configurations must be saved in the user profile.",
      "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient.",
      "Taking account of the users’ tasks and information needs: When providing different access paths or navigation structures for different user groups, the tasks and information needs of these user groups should be taken into consideration.",
      "such as employees of different levels, citizens etc, monitoring the user’s behaviour and adapting to the user’s goals that are inferred from the behaviour observed, recommending information that is potentially more relevant or interesting to the specific user, based on the behaviour of all users or a user group.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "User adaptation can also be important for making the user interface more accessible.",
      "This is particularly important for frequently accessed pages or pages that are important for user navigation and exploration, such as the home page.",
      "This encompasses being able to present content containing newer technologies by older user agents as well as designing content to be usable with future technologies."
    ]
  },
  {
    "text": "The CCTNS system must be available to users: from <xx:00> to <xx:00>; on <all weekdays/xxx days per year>.",
    "id": [
      389,
      386,
      498,
      540,
      529,
      391,
      618,
      541,
      530,
      406
    ],
    "example": [
      "The CCTNS system must allow a user to be a member of more than one group.",
      "The requirements specify the requirements to control the user access to correspondences, files, and records and various functionalities provided within the CCTNS system.",
      "Unplanned downtime for the CCTNS system must not exceed <xx hours/minutes> per <rolling three month period>.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "The CCTNS system should allow a user to stipulate which other users or groups can access cases.",
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The CCTNS system must allow persistent defaults for data entry where desirable."
    ]
  },
  {
    "text": "In this context, performing a search means returning a result list.",
    "id": [
      546,
      551,
      550,
      549,
      319,
      548,
      316,
      454,
      502,
      429
    ],
    "example": [
      "The search results should be fetched from the database in batches of 10 or 20 maximum as configured within the application.",
      "Database Indexes should be applied on the key columns used for searching.",
      "A hierarchical cache should be configured and used for caching of results of most frequently used searches.",
      "Only when the user clicks on a particular record to view its further details should a query be fired to fetch the additional details for this particular record only.",
      "The successful update of a question results in the generation of a text file on the system server.",
      "The search should fetch only the fields that need to be displayed to the user.",
      "Upon the completion of data entry for a question, the administrator will use a submission button to initiate the update process.",
      "Typical action types in user interfaces include manipulating application data, performing searches, communication actions, such as opening a new e-mail window or starting a chat function, and presentation-related actions, such as sorting a list of search results.",
      "The CCTNS system must be able to perform a simple search within 5-8 seconds and a advanced search (multiple search criteria) within 10-15 seconds regardless of the storage capacity or number of cases in the CCTNS system.",
      "This may be done by placing important information at the top and providing links to information that is further down the page."
    ]
  },
  {
    "text": "The customization layer can override and add to the core services based on the specific state requirements and can be plugged with the core services.",
    "id": [
      514,
      515,
      1158,
      513,
      1155,
      488,
      1161,
      402,
      589,
      364
    ],
    "example": [
      "The core services, support layer and security and access control components can be deployed as standard components with necessary configuration changes.",
      "The deployment of the application will be at state level and will be configured and customized as per the state specific extensions.",
      "These building blocks allow the software to be utilized in a number of configurations (by simply altering the configuration parameters of the software).",
      "Each of the components contains multiple services as defined by Service Definition.",
      "In order to create the Center-to-Center infrastructure, interfaces to the existing systems will be created.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "Systems will interface to the “cloud” using a project defined protocol.",
      "The interfaces must be made customizable or user-configurable to the extent possible.(e.g., the displayed columns in the table, move, resize, modify the appearance).",
      "Software tools will be provided to assist the user at all access levels from system wide configuration and control to a low level CMIB command line instruction.",
      "The Configuration module of the CCTNS helps keep the application configured according to the states’ requirements in addition to keeping data elements/rules up to date."
    ]
  },
  {
    "text": "The CCTNS system should be developed on Open Standards ",
    "id": [
      527,
      411,
      516,
      495,
      523,
      530,
      540,
      532,
      517,
      388
    ],
    "example": [
      "The CCTNS system should adopt standardized formats and common metadata elements ",
      "The user interfaces of the CCTNS system should comply with Standard ISO 9241.",
      "The CCTNS systems should be designed with the following broad guidelines: ",
      "The user interfaces of the CCTNS system should follow the guidelines specified under www.usability.gov ",
      "The CCTNS system should be developed for a centralized deployment and maintenance ",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should support secure virtual private network connections ",
      "The CCTNS system should support multilingual interface ",
      "The CCTNS system should provide for role-based control for the functionality within the CCTNS system "
    ]
  },
  {
    "text": "The CCTNS system should support SSL encrypted connections ",
    "id": [
      533,
      536,
      532,
      529,
      531,
      541,
      540,
      537,
      522,
      517
    ],
    "example": [
      "The CCTNS system should use HTTPS as the communication protocol, i.e., HTTP over an encrypted secure socket layer (SSL) ",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should support secure virtual private network connections ",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "The CCTNS system should support multi-tier authentication where required ",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting.",
      "The CCTNS system should be built on a common User Access and Authentication Service to ensure Single-Sign on for the end-user ",
      "The CCTNS system should support multilingual interface "
    ]
  },
  {
    "text": "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries.",
    "id": [
      540,
      541,
      539,
      542,
      537,
      538,
      536,
      543,
      530,
      532
    ],
    "example": [
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs.",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting.",
      "The CCTNS system should ensure high standards of security and access control through preventing SQL Injection.",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should ensure high standards of security and access control through do not allow hard delete and perform only soft tagging the row for deletion.",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The CCTNS system should support secure virtual private network connections "
    ]
  },
  {
    "text": "The CCTNS system should ensure high scalability and performance through using of cache for storing frequent data.",
    "id": [
      547,
      545,
      542,
      541,
      540,
      536,
      544,
      539,
      538,
      519
    ],
    "example": [
      "The CCTNS system should ensure high scalability and performance through displaying of records on the screen in batches/paged manner. ",
      "The CCTNS system should ensure high scalability and performance through leveraging Asynchronous HTTP socket capabilities of web server for scalability and performance.",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should ensure high scalability and performance through using of AJAX based technology to improve user experience.",
      "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs.",
      "The CCTNS system should ensure high standards of security and access control through preventing SQL Injection.",
      "The CCTNS system should work even in an offline mode with the critical functionality "
    ]
  },
  {
    "text": "The CCTNS system should ensure high scalability and performance through hosting all the static content (documents, images) on the web server.",
    "id": [
      545,
      547,
      542,
      544,
      541,
      540,
      519,
      536,
      534,
      532
    ],
    "example": [
      "The CCTNS system should ensure high scalability and performance through leveraging Asynchronous HTTP socket capabilities of web server for scalability and performance.",
      "The CCTNS system should ensure high scalability and performance through displaying of records on the screen in batches/paged manner. ",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The CCTNS system should ensure high scalability and performance through using of AJAX based technology to improve user experience.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should work even in an offline mode with the critical functionality ",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should run on multiple browsers.",
      "The CCTNS system should support secure virtual private network connections "
    ]
  },
  {
    "text": "The Correlator Monitor and Control System provides the physical link between the WIDAR Correlator hardware and the VLA Expansion Project monitor and control system.",
    "id": [
      565,
      564,
      558,
      566,
      567,
      571,
      609,
      606,
      622,
      575
    ],
    "example": [
      "The Correlator Monitor and Control System exists as an integrated part of the overall VLA Expansion Project Monitor and Control Structure.",
      "The format of the document follows that outlined in the IEEE STD 830 document, IEEE The VLA Expansion Project Correlator Monitor and Control System is responsible for correlator configuration, real time monitor/control, and hardware testing/servicing.",
      "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
      "The Correlator Monitor and Control System will provide a level of abstraction to modularize the correlator system within the VLA Expansion Project environment.",
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "The Correlator monitor subsystem will provide VLA Expansion Project system wide access to all correlator system states including the Monitor and Control System supervisor system state.",
      "Network routers/switches shall be employed at the Master Correlator Control Computer-VLA Expansion Project Monitor and Control System interface level to protect the Master Correlator Control Computer from unauthorized access and irrelevant network traffic.",
      "The Master Correlator Control Computer-CMIB, Master Correlator Control Computer-Correlator Power Control Computer, and Master Correlator Control Computer-VLA Expansion Project Monitor and Control System networks shall be on separate physical interfaces.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "Correlator configurations and control instructions will be received from the VLA Expansion Project Monitor and Control System system in a form suitable for translation by the Master Correlator Control Computer."
    ]
  },
  {
    "text": "The Correlator Monitor and Control is a critical component in the Astronomical data path.",
    "id": [
      559,
      813,
      883,
      865,
      590,
      911,
      632,
      636,
      1136,
      929
    ],
    "example": [
      "The Correlator Monitor and Control System shall process and transfer dynamic control data and monitor data.",
      "The Tactical Control System flight route planner will provide payload search area information, such as visual acuity range due to atmospheric conditions, diurnal transition periods for thermal imagery, and lunar and solar terrain shadowing.",
      "Tactical Control System shall provide the capability to monitor payload adherence to the uplinked mission plan.",
      "Tactical Control System shall provide the capability to monitor specific telemetry elements real-time, and record all telemetry elements for future review and processing.",
      "The primary contact with array operations will be via status and error messages channeled through the Monitor and Control System.",
      "Payload data includes the digital and analog imagery and associated telemetry sent to the Tactical Control System from each of these payloads.",
      "Other message internal time stamps can be used as monitor/control parameters as deemed necessary.",
      "The Correlator Monitor and Control System shall be self-monitoring.",
      "The Tactical Control System HCI shall provide the capability to lock onto and hold a coordinate point on the payload imagery window.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions located on the payload imagery display."
    ]
  },
  {
    "text": "It is assumed that the Correlator will receive configuration data in a format that is unambiguous and results in a convergent hardware configuration.",
    "id": [
      578,
      576,
      572,
      1156,
      581,
      602,
      558,
      574,
      1020,
      1249
    ],
    "example": [
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
      "The translation will provide the correlator with specific goal oriented hardware configuration tables to satisfy the configuration requested by the A second interface with a human GUI will also allow for configuration of the correlator hardware, preferably through the same table structures used above.",
      "Some of this information will be provided on a time synchronous basis as required by other systems and other information will only be presented on a request basis.",
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "The Master Correlator Control Computer will accept external data feeds for models, time standards, fiber-link phase corrections and other required data to be packaged with control data delivered to the correlator hardware.",
      "It is assumed that the backend data processing and VLA Expansion Project Monitor and Control System systems will be capable of accepting output data rates generated by the Correlator Monitor and Control System.",
      "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
      "Error and status messages will be provided in a concise time/location referenced format to upper system levels in a content controllable manner.",
      "The RTP interface shall support distributed processing capability.",
      "In this mode the Center-to-Center receives data from all connected systems, including the Incident GUI, and combines the data into a single data store (database)."
    ]
  },
  {
    "text": "The CMIB shall be capable of reading a 16-bit identifier from the host correlator board.",
    "id": [
      615,
      621,
      612,
      1156,
      581,
      1171,
      610,
      622,
      808,
      603
    ],
    "example": [
      "The carrier board for the CMIB shall have an externally visible indicator that will provide a user with a physical indication of CMIB operational status.",
      "The CMIB shall conform to both electrical and physical The CMIB shall contain 64 Mbytes or greater of SDRAM, IDE hard disk interface, minimum of one serial and one parallel interface, PCI/ISA buses, 100BaseT network interface, capacity to boot and run a generic COTS operating system in a near real-time environment from local non-volatile storage.",
      "The CMIB shall be able to read back the contents of all writeable hardware control registers where meaningful.",
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "The Master Correlator Control Computer will accept external data feeds for models, time standards, fiber-link phase corrections and other required data to be packaged with control data delivered to the correlator hardware.",
      "The Center shall provide the link information, including link identifier, link name and link type.",
      "The CMIB daughter board shall communicate with the correlator carrier boards via either the PCI or ISA busses.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "The Tactical Control System shall provide the capability to enter waypoint data in alphanumeric format.",
      "The interface between the CMIB, Master Correlator Control Computer, and Correlator Power Control Computer shall be Ethernet of 100 Mbits/sec or better data rate."
    ]
  },
  {
    "text": "This identifier will be used to form a unique IP address for CMIB network addressing and allow carry over IP addressing for hot swap modules.",
    "id": [
      1016,
      1206,
      1195,
      1174,
      1187,
      1193,
      1152,
      1182,
      621,
      1184
    ],
    "example": [
      "This interface shall allow for addition of future AVs and will provide the generic architecture to ensure interoperability.",
      "TCP/IP shall be used to transmit the DATEX/ASN data.",
      "To support Dynamic Lane control in other centers, the Center shall be able to support the following device control command for a Dynamic Lane, including network identifier, dynamic lane identifier, username, password and lane plan.",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "To support HOV Lane control in other centers, the Center shall be able to support the following device control command for a HOV Lane, including network identifier, HOV Lane identifier, username, password and lane plan.",
      "To support Reversible Lane control in other centers, the Center shall be able to support the following device control command for a Reversible Lane, including network identifier, reversible lane identifier, username, password, plan and duration.",
      "This Center-to-Center infrastructure implements a repository for traffic data and provides a mechanism to exchange device control information between TMCs.",
      "To support HAR control in other centers, the Center shall be able to support the following device control command for a HAR, including network identifier, HAR identifier, username, password and message.",
      "The CMIB shall conform to both electrical and physical The CMIB shall contain 64 Mbytes or greater of SDRAM, IDE hard disk interface, minimum of one serial and one parallel interface, PCI/ISA buses, 100BaseT network interface, capacity to boot and run a generic COTS operating system in a near real-time environment from local non-volatile storage.",
      "To support Traffic Signal control in other centers, the Center shall be able to support the following device control command for a Traffic Signal, including network identifier, traffic signal identifier, username, password and traffic signal plan identifier."
    ]
  },
  {
    "text": "The Master Correlator Control Computer shall have all required disk and file system facilities installed locally such that the EVLA Correlator Monitor and Control System can boot and run in a stand-alone configuration.",
    "id": [
      618,
      644,
      634,
      622,
      661,
      567,
      601,
      658,
      588,
      1090
    ],
    "example": [
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "A system administrator shall have unrestricted access to all aspects of the EVLA Correlator Monitor and Control System.",
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "It is assumed that all auxiliary data needed for real time update of correlator parameters will be provided directly by the VLA Expansion Project Monitor and Control System system or by dedicated servers.",
      "Systems operations should be given unrestricted access to all aspects of the EVLA Correlator Monitor and Control System and should have the authority to grant and revoke privileges on a per-user basis.",
      "All use of the Correlator Monitor and Control System will be through the VCI or Master Correlator Control Computer.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services."
    ]
  },
  {
    "text": "This should allow the correlator CMIBs to boot, configure, and run without any communication outside of the correlator Monitor and Control System network.",
    "id": [
      651,
      607,
      567,
      1094,
      1093,
      627,
      585,
      1229,
      614,
      652
    ],
    "example": [
      "Seamlessness shall be accomplished in a manner that is seamless, in that it does not affect hardware modules or software functionality that it meets at interfaces.",
      "There shall be a redundant communication path between the Master Correlator Control Computer and Correlator Power Control Computer to provide for remote reboot in the event of a networking or computing failure.",
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "Training software shall be alterable without affecting the configuration of the operational software.",
      "The Tactical Control System’s operating system and executable software shall be re-programmable without hardware disassembly.",
      "Aside from a networking or CPU failure, it should never be necessary to directly access a CPU to display error messages.",
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "The remote Center Control GUI shall be designed to execute on a public network (e.g., Internet) and transmit equipment requests to the C-2-C software system.",
      "The CMIB shall have control of hardware warm boots such that an external command from the Master Correlator Control Computer to reboot the CMIB shall have an option to force a hardware warm boot.",
      "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access."
    ]
  },
  {
    "text": "The Correlator Power Control Computer shall be a high availability type general purpose computer capable of supporting a COTS operating system and have the ability to accept a large number of external hardware status signals either directly or through external interface hardware.",
    "id": [
      622,
      700,
      1068,
      567,
      621,
      1090,
      581,
      1066,
      609,
      933
    ],
    "example": [
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "The Tactical Control System hardware will permit long range communications from one to another, data storage expansion, access to other computers to share in processing capability, and multiple external peripherals.",
      "The Tactical Control System hardware shall allow for long range communications from one Tactical Control System to another [SSS375], data storage expansion [SSS376], access to other computers to share in processing capability [SSS377], and multiple external peripherals [SSS378].",
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "The CMIB shall conform to both electrical and physical The CMIB shall contain 64 Mbytes or greater of SDRAM, IDE hard disk interface, minimum of one serial and one parallel interface, PCI/ISA buses, 100BaseT network interface, capacity to boot and run a generic COTS operating system in a near real-time environment from local non-volatile storage.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services.",
      "The Master Correlator Control Computer will accept external data feeds for models, time standards, fiber-link phase corrections and other required data to be packaged with control data delivered to the correlator hardware.",
      "The Tactical Control System hardware will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links.",
      "Network routers/switches shall be employed at the Master Correlator Control Computer-VLA Expansion Project Monitor and Control System interface level to protect the Master Correlator Control Computer from unauthorized access and irrelevant network traffic.",
      "The Tactical Control System shall have the functionality necessary to manage all aspects of C4I system interfaces to include receiving, processing, and transmitting tactical information to include but not limited to character based text messages, NITF 2.0 imagery files, and RS-170A video."
    ]
  },
  {
    "text": "The Correlator Power Control Computer shall have all required disk and file system facilities installed locally such that the EVLA Correlator Monitor and Control System can boot and run in a stand-alone configuration.",
    "id": [
      618,
      644,
      634,
      622,
      601,
      661,
      658,
      1090,
      638,
      648
    ],
    "example": [
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "It is assumed that all auxiliary data needed for real time update of correlator parameters will be provided directly by the VLA Expansion Project Monitor and Control System system or by dedicated servers.",
      "A system administrator shall have unrestricted access to all aspects of the EVLA Correlator Monitor and Control System.",
      "Systems operations should be given unrestricted access to all aspects of the EVLA Correlator Monitor and Control System and should have the authority to grant and revoke privileges on a per-user basis.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services.",
      "The software part of the EVLA Correlator Monitor and Control System shall be able to perform without total system restart due to internal failure between system maintenance windows.",
      "Operating system software shall either have source code available or come with sufficient diagnostics and customer support."
    ]
  },
  {
    "text": "The Correlator Monitor and Control System processors shall be capable of meeting all data processing deadlines and anticipated future requirements The Correlator Monitor and Control System processors shall be capable of responding to correlator hardware inputs in a deterministic fashion with sufficient performance to avoid data loss, corruption or overflows.",
    "id": [
      585,
      622,
      1069,
      578,
      1072,
      591,
      559,
      560,
      640,
      573
    ],
    "example": [
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "The Tactical Control System hardware shall support the data rate characteristics of the AV, data link and payload to ensure interoperability.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
      "The Tactical Control System shall have sufficient throughput to support the processing requirements of the selected data link.",
      "The ability of the Correlator System to achieve and maintain high reliability and uptime will be vitally dependent upon reliable operation and rapid diagnosis and repair of faults in the hardware and software systems.",
      "The Correlator Monitor and Control System shall process and transfer dynamic control data and monitor data.",
      "The Correlator Monitor and Control System shall monitor correlator and correlator subsystem health and take corrective action autonomously to recover from hardware and computing system faults.",
      "The EVLA Correlator Monitor and Control System shall be able to continue processing of all correlator configuration/control events until the queues of parameters are exhausted and external communications are restored.",
      "The Correlator Monitor and Control System will be a fully observable system with the only limits placed on information access being those imposed by hardware, bandwidth, and/or security restrictions."
    ]
  },
  {
    "text": "Software tools and pre-built applications that do not have source code available shall come with a complete diagnostic package and customer support.",
    "id": [
      648,
      589,
      634,
      644,
      633,
      370,
      667,
      108,
      196,
      412
    ],
    "example": [
      "Operating system software shall either have source code available or come with sufficient diagnostics and customer support.",
      "Software tools will be provided to assist the user at all access levels from system wide configuration and control to a low level CMIB command line instruction.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "Software shall be provided that allows an authorized user full access to all messaging, monitor, and control traffic.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "Complete and comprehensible hardware systems specifications and configuration information shall be readily available.",
      "Although the product produced under this document will be a “prototype” version, all modules and components of this prototype version shall be designed and implemented in such a manner that it may be incorporated in a fully specified commercial version of the DigitalHome System.",
      "This document is designed to provide information to both the client and the technical designers of the software.",
      "Application user interfaces to meet its requirements and recommendations."
    ]
  },
  {
    "text": "Users’ needs and expectations from the EVLA Correlator Monitor and Control System will be different.",
    "id": [
      488,
      489,
      432,
      431,
      409,
      659,
      655,
      91,
      638,
      619
    ],
    "example": [
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "individualization designing content and navigation differently for varying user groups or roles i.e.",
      "The ability to choose between different input devices for activating controls such as links, fields and buttons is important both for users who prefer a certain input mode, mobile users and users with disabilities.",
      "Designing for input device independence: User interfaces should be designed to allow activation of controls by a variety of input devices.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "Development, testing and maintenance personnel, on the other hand, require access to some parts of the EVLA Correlator Monitor and Control System, but not all, indicating that an access level is needed that allows privileges to be granted on a per-user and what-do-you-need-to-do basis.",
      "This could be done via a username and associated password scheme that would authenticate and authorize the user access to the EVLA Correlator Monitor and Control System and, if applicable, grant the user access to restricted or controlled parts of the EVLA Correlator Monitor and Control System.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices ",
      "The software part of the EVLA Correlator Monitor and Control System shall be able to perform without total system restart due to internal failure between system maintenance windows.",
      "Each computer system in the Correlator Monitor and Control System shall have a hardware based watchdog timer configured to reboot the EVLA Correlator Monitor and Control System in the case of a system hang."
    ]
  },
  {
    "text": "All login attempts shall be done in a secure manner.",
    "id": [
      618,
      633,
      660,
      955,
      642,
      654,
      399,
      1070,
      661,
      1061
    ],
    "example": [
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "Software shall be provided that allows an authorized user full access to all messaging, monitor, and control traffic.",
      "All users of the EVLA Correlator Monitor and Control System shall login using some form of unique identification.",
      "All digital messages received by the Tactical Control System shall be automatically checked for errors and corrected when possible.",
      "All system processing and interconnect hardware shall be readily accessible for maintenance, repair, replacement and reconfiguration.",
      "All users of the Correlator Monitor and Control System must be uniquely identified.",
      "All error messages produced by the CCTNS system must be meaningful, so that they can be appropriately acted upon by the users who are likely to see them.",
      "For each OUTRIDER system, the Tactical Control System shall provide full independent computer redundancy.",
      "A system administrator shall have unrestricted access to all aspects of the EVLA Correlator Monitor and Control System.",
      "All Tactical Control System users, operators, maintainers and other personnel having access to Tactical Control System shall be cleared to the highest sensitivity of the data that the Tactical Control System processes, stores and transfers."
    ]
  },
  {
    "text": "Each user shall have a set of system access properties that defines the user’s privileges within the EVLA Correlator Monitor and Control System.",
    "id": [
      655,
      658,
      659,
      660,
      663,
      618,
      661,
      386,
      633,
      596
    ],
    "example": [
      "This could be done via a username and associated password scheme that would authenticate and authorize the user access to the EVLA Correlator Monitor and Control System and, if applicable, grant the user access to restricted or controlled parts of the EVLA Correlator Monitor and Control System.",
      "Systems operations should be given unrestricted access to all aspects of the EVLA Correlator Monitor and Control System and should have the authority to grant and revoke privileges on a per-user basis.",
      "Development, testing and maintenance personnel, on the other hand, require access to some parts of the EVLA Correlator Monitor and Control System, but not all, indicating that an access level is needed that allows privileges to be granted on a per-user and what-do-you-need-to-do basis.",
      "All users of the EVLA Correlator Monitor and Control System shall login using some form of unique identification.",
      "The administrator shall have the ability to edit a user’s system access properties.",
      "All computers within the Correlator Monitor and Control System system shall have the ability for authorized users to directly access individual systems for maintenance and monitoring through remote logins.",
      "A system administrator shall have unrestricted access to all aspects of the EVLA Correlator Monitor and Control System.",
      "The requirements specify the requirements to control the user access to correspondences, files, and records and various functionalities provided within the CCTNS system.",
      "Software shall be provided that allows an authorized user full access to all messaging, monitor, and control traffic.",
      "A few authorized individuals may be allowed access to parts of the EVLA Correlator Monitor and Control System that are usually considered restricted."
    ]
  },
  {
    "text": "The administrator shall have the ability to create and add a new user to the EVLA Correlator Monitor and Control System.",
    "id": [
      663,
      662,
      19,
      18,
      104,
      655,
      370,
      23,
      660,
      91
    ],
    "example": [
      "The administrator shall have the ability to edit a user’s system access properties.",
      "The administrator shall have the ability to remove a user from the EVLA Correlator Monitor and Control System.",
      "For example, a Master User shall be able to add a user account or change the default parameter settings.",
      "A Master user will be designated, who shall be able to change the configuration of the system.",
      "Upon installation, a DigitalHome user account shall be established.",
      "This could be done via a username and associated password scheme that would authenticate and authorize the user access to the EVLA Correlator Monitor and Control System and, if applicable, grant the user access to restricted or controlled parts of the EVLA Correlator Monitor and Control System.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "A DigitalHome Technician will have rights beyond the DigitalHome General User, capable of setting up and making changes in the configuration of the system (e.g.,setting system parameters and establishing user accounts), and starting and stopping operation of the DigitalHome System.",
      "All users of the EVLA Correlator Monitor and Control System shall login using some form of unique identification.",
      "A user shall be able to override planned parameter values, through the DigitalHome website, or if available, through manual switches on household devices "
    ]
  },
  {
    "text": "The administrator shall have the ability to block all access to the EVLA Correlator Monitor and Control System for all users or selectively by user.",
    "id": [
      662,
      652,
      663,
      655,
      609,
      661,
      596,
      973,
      658,
      1096
    ],
    "example": [
      "The administrator shall have the ability to remove a user from the EVLA Correlator Monitor and Control System.",
      "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access.",
      "The administrator shall have the ability to edit a user’s system access properties.",
      "This could be done via a username and associated password scheme that would authenticate and authorize the user access to the EVLA Correlator Monitor and Control System and, if applicable, grant the user access to restricted or controlled parts of the EVLA Correlator Monitor and Control System.",
      "Network routers/switches shall be employed at the Master Correlator Control Computer-VLA Expansion Project Monitor and Control System interface level to protect the Master Correlator Control Computer from unauthorized access and irrelevant network traffic.",
      "A system administrator shall have unrestricted access to all aspects of the EVLA Correlator Monitor and Control System.",
      "A few authorized individuals may be allowed access to parts of the EVLA Correlator Monitor and Control System that are usually considered restricted.",
      "The Tactical Control System shall restrict operator access to this capability via password protection.",
      "Systems operations should be given unrestricted access to all aspects of the EVLA Correlator Monitor and Control System and should have the authority to grant and revoke privileges on a per-user basis.",
      "The Tactical Control System software shall restrict the operator(s) from exercising levels of interaction not achievable by the system."
    ]
  },
  {
    "text": "These UAVs shall include the Tactical Unmanned Aerial Vehicle (TUAV) and the Medium Altitude and Endurance (MAE) UAV (henceforth referred to as Outrider and Predator respectively), their associated payloads, and other network communication systems.",
    "id": [
      675,
      682,
      737,
      1087,
      916,
      726,
      684,
      731,
      741,
      789
    ],
    "example": [
      "Tactical Control System will also be capable of receiving and processing information from High Altitude and Endurance (HAE) UAVs, their associated payloads, future development UAVs and payloads.",
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System shall meet the applicable capability and characteristic criteria established by the Operational Requirements Document (ORD) CAF 003-90-I-A for the RQ-1A Predator Medium Altitude Endurance Unmanned Aerial Vehicle/System (MAE UAV) and the Close Range – Tactical Unmanned Aerial Vehicle (CR-TUAV).",
      "auto-search and automatic target tracking), and future Tactical UAVs.",
      "The Tactical Control System shall be capable of receiving secondary HAE UAV payload imagery.",
      "The Tactical Control System will export and disseminate UAV imagery products, tactical communication messages, as well as mission plans and target coordinates.",
      "The Tactical Control System consists of the software, software-related hardware and the extra ground support hardware necessary for the control of the Outrider, and the Predator UAV, and future tactical UAVs.",
      "The primary function of the Tactical Control System is to provide command and control of the payload, Air Vehicle (AV), data link, and other necessary support equipment in order to employ tactical UAVs to conduct reconnaissance, surveillance, target acquisition, and target identification missions.",
      "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems."
    ]
  },
  {
    "text": "Design and development of the Tactical Control System will be conducted in two phases.",
    "id": [
      764,
      678,
      978,
      934,
      1051,
      727,
      704,
      979,
      785,
      761
    ],
    "example": [
      "In the Normal Operations Mode the Tactical Control System shall support target coordinate development.",
      "During Phase 2, Tactical Control System Low Rate Initial Production (LRIP) will commence.",
      "The Tactical Control System will interface with external systems to conduct mission coordination and operations.",
      "The Tactical Control System shall plan and conduct a mission.",
      "System safety and health hazards, if any, shall be identified and evaluated during Phase I of the Tactical Control System development.",
      "The Tactical Control System will also receive, process, and display tasking orders, and operational information from Service specific mission planning systems.",
      "The Tactical Control System will be connected with Advanced Field Artillery Tactical Data System (AFATDS).",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from service specific mission planning systems.",
      "In the Normal Operations Mode the Tactical Control System shall support mission planning."
    ]
  },
  {
    "text": "The Tactical Control System will control of the UAV, less launch and recovery, plus all the functions of level three for the multiple UAV.",
    "id": [
      742,
      682,
      741,
      683,
      684,
      789,
      788,
      731,
      835,
      1048
    ],
    "example": [
      "The Tactical Control System will provide control of the UAV, less launch and recovery, plus all the functions of level three from UAV.",
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
      "The Tactical Control System has capability to have full function and control of the UAV from takeoff to landing for multiple UAV.",
      "The Tactical Control System consists of the software, software-related hardware and the extra ground support hardware necessary for the control of the Outrider, and the Predator UAV, and future tactical UAVs.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The primary function of the Tactical Control System is to provide command and control of the payload, Air Vehicle (AV), data link, and other necessary support equipment in order to employ tactical UAVs to conduct reconnaissance, surveillance, target acquisition, and target identification missions.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall monitor the uplink and downlink to each UAV under its control."
    ]
  },
  {
    "text": "The Startup State shall be comprised of the following modes: Normal Startup Mode and Recovery Startup ",
    "id": [
      747,
      746,
      744,
      755,
      754,
      750,
      582,
      753,
      757,
      620
    ],
    "example": [
      "The Tactical Control System will execute the particular startup mode which corresponds with the manner in which the Tactical Control System ",
      "Upon application of power the Tactical Control System shall enter the Startup State.",
      "The states of operation of the Tactical Control System shall include Startup, Operation, and Shutdown.",
      "Recovery of the Tactical Control System HWCIs shall include startup of HWCIs, download of software, startup of CSCIs, and establishment of the state of readiness of all interfaces.",
      "Initialization of the Tactical Control System HWCIs shall include startup of HWCIs, download of software, startup of CSCIs, execution of Startup FD/L, and establishment of the state of readiness of all interfaces.",
      "During startup, the Tactical Control System shall determine which of the 5 levels of interaction are achievable by the Tactical Control System configuration.",
      "The ability to attempt recovery from failure or hot-swapped hardware devices will be built into this system.",
      "When executing in the Normal Startup Mode, the Tactical Control System shall provide the system functionality necessary to initialize the system to place it in the Operations State within 60 seconds from the time power is supplied and the Tactical Control System application is launched.",
      "For recovery from abnormal termination, Tactical Control System shall prompt the operator to select the type of recovery to be executed: (1)Resume in the Same Modes And Data; (2)Resume in the Same Modes but Review and Modify the Command Data as Necessary; or, (3) Perform a Command Shutdown and Startup Via the Normal ",
      "Reboots should result in minimal system interruptions with the offending CPU reconfiguring and returning to service autonomously."
    ]
  },
  {
    "text": "The Tactical Control System in the Recovery Startup Mode shall provide the system functionality to resume the Operations ",
    "id": [
      748,
      749,
      864,
      757,
      747,
      746,
      1077,
      755,
      970,
      861
    ],
    "example": [
      "When the Tactical Control System Software is terminated normally the Tactical Control System shall enter the Normal Startup Mode of operation upon application of power.",
      "When the Tactical Control System software is halted due to an unplanned power interruption as well as abnormal program termination, then the Tactical Control System shall enter the Recovery Startup Mode upon application of power.",
      "The Tactical Control System shall allow the operator to initiate the emergency recovery feature of the AV, if the AV has an emergency recovery feature.",
      "For recovery from abnormal termination, Tactical Control System shall prompt the operator to select the type of recovery to be executed: (1)Resume in the Same Modes And Data; (2)Resume in the Same Modes but Review and Modify the Command Data as Necessary; or, (3) Perform a Command Shutdown and Startup Via the Normal ",
      "The Tactical Control System will execute the particular startup mode which corresponds with the manner in which the Tactical Control System ",
      "Upon application of power the Tactical Control System shall enter the Startup State.",
      "The Tactical Control System shall be capable of restoring power in sufficient time to avoid loss of critical mission data and loss of air vehicle control during power outages.",
      "Recovery of the Tactical Control System HWCIs shall include startup of HWCIs, download of software, startup of CSCIs, and establishment of the state of readiness of all interfaces.",
      "As a minimum, Tactical Control System shall provide Startup FD/L for the operator workstation.",
      "As an objective, the Tactical Control System shall support an automatic launch and recovery system."
    ]
  },
  {
    "text": "The Tactical Control System hardware and software shall execute periodic Fault Detection/Location (FD/L) while in the Normal Operations Mode and Training Mode, to include a periodic determination of level of interaction.",
    "id": [
      966,
      967,
      968,
      774,
      776,
      969,
      1143,
      866,
      863,
      762
    ],
    "example": [
      "Tactical Control System shall be capable of executing payload maintenance software and displaying appropriate status results.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "Tactical Control System shall be capable of executing workstation and peripheral equipment maintenance software and displaying appropriate status results.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform fault detection/location (FD/L).",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring.",
      "Fault Detection/Location (FD/L) to the Line Replaceable Unit (LRU) level shall be provided to indicate the readiness status of Tactical Control System, if inherent to the COTS hardware and software utilized.",
      "The Tactical Control System HCI shall provide continuously-available, on-screen control functions for time and missioncritical operations, to include as a minimum print, freeze, declassification, mark VCR, declutter, cease RF transmission.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "In the Normal Operations Mode the Tactical Control System shall support mission control and monitoring."
    ]
  },
  {
    "text": "In the Training Operations Mode the Tactical Control System shall support mission planning.",
    "id": [
      767,
      761,
      934,
      764,
      762,
      978,
      768,
      979,
      780,
      727
    ],
    "example": [
      "In the Training Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "In the Normal Operations Mode the Tactical Control System shall support mission planning.",
      "The Tactical Control System shall plan and conduct a mission.",
      "In the Normal Operations Mode the Tactical Control System shall support target coordinate development.",
      "In the Normal Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "The Tactical Control System will interface with external systems to conduct mission coordination and operations.",
      "In the Training Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "The Tactical Control System will allow the operator to conduct mission planning.",
      "The Tactical Control System will also receive, process, and display tasking orders, and operational information from Service specific mission planning systems."
    ]
  },
  {
    "text": "In the Training Operations Mode the Tactical Control System shall support payload product Mmanagement.",
    "id": [
      767,
      763,
      782,
      768,
      833,
      907,
      835,
      741,
      882,
      880
    ],
    "example": [
      "In the Training Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "In the Normal Operations Mode the Tactical Control System shall support payload product management.",
      "The Tactical Control System will allow the operator to conduct payload product management. ",
      "In the Training Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Tactical Control System shall provide the system functionality necessary to generate a payload plan.",
      "The Tactical Control System will have the functionality necessary to manage all aspects of payload product handling to include receiving, processing, displaying, and performing limited exploitation.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
      "The Tactical Control System shall provide override of payload automated as well as preprogrammed inputs.",
      "The Tactical Control System shall permit the operator to control the payload using all methods supported by the payload installed in the selected AV."
    ]
  },
  {
    "text": "In the Training Operations Mode the Tactical Control System shall support target coordinate development.",
    "id": [
      764,
      767,
      768,
      934,
      761,
      978,
      979,
      762,
      780,
      930
    ],
    "example": [
      "In the Normal Operations Mode the Tactical Control System shall support target coordinate development.",
      "In the Training Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "In the Training Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Tactical Control System shall plan and conduct a mission.",
      "In the Normal Operations Mode the Tactical Control System shall support mission planning.",
      "The Tactical Control System will interface with external systems to conduct mission coordination and operations.",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "In the Normal Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "The Tactical Control System will allow the operator to conduct mission planning.",
      "The Tactical Control System will have the functionality to determine target coordinates, and estimate target coordinate accuracy."
    ]
  },
  {
    "text": "Upon the selection of a shutdown command the Tactical Control System shall enter the Shutdown State, which will cause the Tactical Control System to be placed in a condition where power can be removed without impacting operations as well as causing damage to the system, and from which restart of the system can be accomplished normally.",
    "id": [
      748,
      749,
      1077,
      1047,
      757,
      802,
      760,
      949,
      970,
      947
    ],
    "example": [
      "When the Tactical Control System Software is terminated normally the Tactical Control System shall enter the Normal Startup Mode of operation upon application of power.",
      "When the Tactical Control System software is halted due to an unplanned power interruption as well as abnormal program termination, then the Tactical Control System shall enter the Recovery Startup Mode upon application of power.",
      "The Tactical Control System shall be capable of restoring power in sufficient time to avoid loss of critical mission data and loss of air vehicle control during power outages.",
      "The Tactical Control System shall be capable of restoring power in sufficient time to avoid loss of air vehicle control during power outages.",
      "For recovery from abnormal termination, Tactical Control System shall prompt the operator to select the type of recovery to be executed: (1)Resume in the Same Modes And Data; (2)Resume in the Same Modes but Review and Modify the Command Data as Necessary; or, (3) Perform a Command Shutdown and Startup Via the Normal ",
      "The Tactical Control System shall provide the capability to override validation faults after the fault is acknowledged by the operator.",
      "The operator shall have the capability to command the system to the Shutdown State from all modes under the Operations State.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate analog communication with peripheral devices.",
      "As a minimum, Tactical Control System shall provide Startup FD/L for the operator workstation.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate digital communication with peripheral devices."
    ]
  },
  {
    "text": "The Tactical Control System will allow the operator to conduct targeting.",
    "id": [
      781,
      780,
      782,
      863,
      784,
      931,
      930,
      783,
      852,
      976
    ],
    "example": [
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "The Tactical Control System will allow the operator to conduct mission planning.",
      "The Tactical Control System will allow the operator to conduct payload product management. ",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System shall have the functionality to allow the operator to generate a UAV mission plan.",
      "The Tactical Control System shall support a target location function where the operator can request the current ground location of the payload field-of-view center.",
      "The Tactical Control System will have the functionality to determine target coordinates, and estimate target coordinate accuracy.",
      "The Tactical Control System will allow the operator to conduct C4I system interface.",
      "The Tactical Control System shall allow the operator to command the flight behavior characteristics inherent to the selected AV.",
      "The Tactical Control System shall allow an Authorized Operator to execute a software debug capability and view the resulting debug diagnostic information."
    ]
  },
  {
    "text": "The Tactical Control System Mission plan shall include all necessary information required to be interoperable with the service specific mission planning systems including the Tactical Aircraft Mission Planning System (TAMPS), Aviation Mission Planning System (AMPS), and Air Force Mission Support System (AFMSS).",
    "id": [
      797,
      785,
      798,
      913,
      992,
      994,
      786,
      989,
      722,
      833
    ],
    "example": [
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from service specific mission planning systems.",
      "The Tactical Control System shall provide the system functionality necessary to upload a flight route plan and payload plan (if applicable) to the AV via the selected system data link as well as direct ground connection.",
      "The Tactical Control System shall be in compliance with Common Imagery Ground Surface Station (CIGSS), United States Imagery Standards (USIS), Video Working Group Standards Architecture, National Imagery Transmission Format (NITF) Version 2.0, and Global Command Control Systems (GCCS) when processing payload imagery data.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System will be connected with Tactical Aircraft Mission Planning System (TAMPS)",
      "The Tactical Control System shall provide the system functionality necessary to generate a payload plan."
    ]
  },
  {
    "text": "The Tactical Control System mission planning function shall provide a graphical user interface that gives the operator the ability to define waypoints on a map based display using a pointing device with full keyset redundancy.",
    "id": [
      819,
      807,
      825,
      1126,
      1131,
      881,
      1122,
      828,
      1144,
      831
    ],
    "example": [
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall provide the operator with a clearly indicated map scale.",
      "The Tactical Control System shall provide for multi-level information display tailoring by the operator.",
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control.",
      "The Tactical Control System shall provide a graphical user interface display for the purpose of controlling the payload.",
      "The Tactical Control System shall provide access to the DII Style Manager so that pointing device characteristics can be modified.",
      "The Tactical Control System shall display an icon, in variable sizes, indicating target position and type at coordinates selected by the operator.",
      "The Tactical Control System HCI shall provide for the capability to automatically designate target locations from the payload screen onto the map screen.",
      "The Tactical Control System shall provide the capability to graphically display Line of Sight versus terrain profile (DTED)."
    ]
  },
  {
    "text": "The Tactical Control System shall allow the operator to define the desired AV route in waypoint format, and shall provide the capability to include up to 500 waypoints in each flight route plan.",
    "id": [
      820,
      814,
      798,
      819,
      854,
      797,
      807,
      1137,
      845,
      824
    ],
    "example": [
      "The Tactical Control System shall provide the capability to create waypoints that define the desired flight path, define AV Altitude and Airspeed associated with the waypoint.",
      "The Tactical Control System flight route planner will be able to designate flight corridors and restricted airspace.",
      "The Tactical Control System shall provide the system functionality necessary to upload a flight route plan and payload plan (if applicable) to the AV via the selected system data link as well as direct ground connection.",
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "The Tactical Control System shall have the capability to command the AV to use the navigation methods inherent to the selected AV.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System HCI shall provide the capability to display operator definable “Lock Out” zones around waypoints, Launch and Recovery Point (LRP), as well as any selected point on the AV flight path.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System shall provide the capability to display waypoint data in alphanumeric format."
    ]
  },
  {
    "text": "The algorithmic accuracy of all flight planning calculations shall not deviate by more than 10% when compared with a mission flown by a validated 6 degree-of-freedom air vehicle simulator.",
    "id": [
      818,
      845,
      1079,
      850,
      817,
      181,
      1078,
      743,
      1046,
      1040
    ],
    "example": [
      "The flight route plan, as a minimum, shall provide the necessary AV commands to autonomously execute a programmed flight and return to a designated recovery area.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System throughput shall not exceed 50% of the throughput capability delivered over any 10 second period, and as an objective throughput shall not exceed 25% of throughput capability delivered over any 10 second period.",
      "The Tactical Control System shall support operation of the AV via all flight modes, to include manual controls.",
      "The Tactical Control System shall analyze the flight route plan selected for uplink to determine that the flight constraints of the AV and the limitation of the data link are not violated prior to transmission of the flight route plan to the AV.",
      "Although the APAF data system and associated software will be developed with the highest quality possible, there are no requirements concerned with software quality.",
      "The Tactical Control System shall have an uninterrupted power supply for critical phases (landing and takeoff as a minimum) of mission execution.",
      "The Tactical Control System will provide capability to have full function and control of the UAV from takeoff to landing.",
      "The Tactical Control System shall be designed such that no single software error results in an unsafe command to be transmitted to the air vehicle.",
      "The Tactical Control System shall provide adequate capability to allow the operator to operate each UAV within its certified operational flight envelope."
    ]
  },
  {
    "text": "The Tactical Control System shall have the capability to load a map onto the display, to zoom in and out, to scroll, to print, and to clear a map on the map display.",
    "id": [
      807,
      1120,
      1132,
      792,
      819,
      793,
      831,
      825,
      1144,
      885
    ],
    "example": [
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall be capable of displaying a window within a window format to include, as a minimum, displaying a video window overlaid on a map screen as well as a map screen overlaid on a video screen.",
      "The Tactical Control System HCI shall provide the capability to select and amplify an object and point on a map as well as payload screen.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions on the map display.",
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "As an objective, the Tactical Control System shall have the capability to import as well as create and modify map display overlays for fire support coordination measures [SSS547], airspace control measures [SSS548], and threat identification measures.",
      "The Tactical Control System shall provide the capability to graphically display Line of Sight versus terrain profile (DTED).",
      "The Tactical Control System shall provide the operator with a clearly indicated map scale.",
      "The Tactical Control System HCI shall provide for the capability to automatically designate target locations from the payload screen onto the map screen.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal."
    ]
  },
  {
    "text": "The Tactical Control System shall display an icon indicating Launch, Handover, and Recovery site (when applicable).",
    "id": [
      828,
      1131,
      826,
      829,
      861,
      863,
      827,
      1104,
      807,
      1137
    ],
    "example": [
      "The Tactical Control System shall display an icon, in variable sizes, indicating target position and type at coordinates selected by the operator.",
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control.",
      "The Tactical Control System shall display an icon indicating AV position when receiving downlink from the desired AV.",
      "The Tactical Control System shall display icons indicating Tactical Control System position and Ground Data Terminal (GDT) position.",
      "As an objective, the Tactical Control System shall support an automatic launch and recovery system.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System shall display an icon indicating payload center field of view and footprint when receiving downlink from the desired AV.",
      "Tactical Control System Warning messages shall be color coded and flashed based on mission criticality.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System HCI shall provide the capability to display operator definable “Lock Out” zones around waypoints, Launch and Recovery Point (LRP), as well as any selected point on the AV flight path."
    ]
  },
  {
    "text": "The Tactical Control System shall provide interactive displays necessary to command the flight of an AV.",
    "id": [
      807,
      893,
      843,
      819,
      856,
      881,
      845,
      840,
      854,
      874
    ],
    "example": [
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall provide an interactive display for the purpose of controlling the data link terminal.",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System shall provide a graphical user interface display for the purpose of controlling the payload.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System shall have the capability to control and monitor multiple types of AVs.",
      "The Tactical Control System shall have the capability to command the AV to use the navigation methods inherent to the selected AV.",
      "The Tactical Control System will have the capability to control and monitor the AV payload(s)."
    ]
  },
  {
    "text": "Bingo fuel is the minimum amount of fuel necessary to return to the designated Recovery site with reserve fuel.",
    "id": [
      870,
      816,
      810,
      1081,
      815,
      818,
      1080,
      1014,
      884,
      232
    ],
    "example": [
      "The Tactical Control System shall be capable of displaying fuel parameters to the operator to include as a minimum, remaining fuel, flow rate, and bingo fuel.",
      "At every waypoint and every 5 minutes, the Tactical Control System shall compute the AV's flight range based on remaining fuel.",
      "The Tactical Control System flight route planner will perform fuel calculations.",
      "As an objective a 75% spare memory storage capacity over storage used shall be provided.",
      "The Tactical Control System shall present to the operator the estimated time of arrival and fuel status at each programmed waypoint of the proposed mission plan.",
      "The flight route plan, as a minimum, shall provide the necessary AV commands to autonomously execute a programmed flight and return to a designated recovery area.",
      "The Tactical Control System shall be capable of providing a 50% spare memory storage capacity over delivered storage used.",
      "As a minimum this information will include the location of all data terminals, launch and recovery sites, and the controlling Tactical Control System.",
      "The Tactical Control System shall display the current search footprint and the search history of the payload on the map.",
      "The user's score must be kept as local data within the Space Fractions system so that the results may be given at the end of the Space Fractions system."
    ]
  },
  {
    "text": "Data terminal control shall include, but is not limited to, antenna pointing control, transmitter control, and receiver control.",
    "id": [
      857,
      859,
      888,
      899,
      897,
      860,
      1014,
      901,
      904,
      858
    ],
    "example": [
      "This control will include control of the ADT antenna and of the ADT transmitter and receiver.",
      "This control will including its pointing direction and mode of transmission (e.g. omni and directional).",
      "As a minimum the Tactical Control System LOS data terminal control modes shall include acquisition, autotrack, search, manual point, omni directional, as well as directional modes of operation, if applicable to the selected data link.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver functions of the selected data terminal.",
      "The Tactical Control System shall provide the functionality to control the power, transmitter signal strength, and frequencies used by ADT for data link communication.",
      "As a minimum this information will include the location of all data terminals, launch and recovery sites, and the controlling Tactical Control System.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall provide the functionality to control the ADT antenna."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal.",
    "id": [
      899,
      897,
      901,
      967,
      980,
      887,
      921,
      966,
      852,
      1126
    ],
    "example": [
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver functions of the selected data terminal.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System operator shall be able to select the content of the overlay information.",
      "Tactical Control System shall be capable of executing payload maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall allow the operator to command the flight behavior characteristics inherent to the selected AV.",
      "The Tactical Control System shall provide for multi-level information display tailoring by the operator."
    ]
  },
  {
    "text": "External storage can be utilized for this purpose.",
    "id": [
      383,
      1152,
      333,
      643,
      1073,
      426,
      1203,
      700,
      152,
      951
    ],
    "example": [
      "This functionality can be used by external auditors who wish to examine or analyse system activity.",
      "This Center-to-Center infrastructure implements a repository for traffic data and provides a mechanism to exchange device control information between TMCs.",
      "By presenting these resources in a separate window, the system maintains the player's context within the main system environment, enabling easy return to the system after exploring the external content.",
      "This excludes items that due to their physical location, are not practical to configure for ready access.",
      "To meet growth requirements, the Tactical Control System shall be capable of adding additional storage without major hardware reconfiguration.",
      "They can superimpose the primary window, hiding relevant information.",
      "The Data Collector shall be designed to support the storage of TMDD data elements and message set information.",
      "The Tactical Control System hardware will permit long range communications from one to another, data storage expansion, access to other computers to share in processing capability, and multiple external peripherals.",
      "Computer resources include computer hardware, computer software, and computer communication.",
      "Processing will include formatting, storing, routing, and display."
    ]
  },
  {
    "text": "The Tactical Control System shall display live and recorded imagery data, with as well as without annotation and overlay, upon operator request.",
    "id": [
      923,
      903,
      959,
      945,
      740,
      964,
      948,
      920,
      739,
      756
    ],
    "example": [
      "RS170A video and digital imagery shall be routed to Tactical Control System functions and displayed upon operator request.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall send and receive annotated and un-annotated digital imagery.",
      "The Tactical Control System will provide direct receipt of imagery and/or data from UAV.",
      "The Tactical Control System shall be equipped to view incoming and outgoing, both annotated and un-annotated analog imagery.",
      "The Tactical Control System shall send and receive analog imagery in RS-170A format with as well as without overlay.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "The Tactical Control System will provide receipt and transmission of secondary imagery and/or data from UAV.",
      "The Tactical Control System shall be capable of automatically recording system state data, interface communications and other information necessary to support event reconstruction."
    ]
  },
  {
    "text": "The Tactical Control System shall have the functionality to develop an estimate of the error in computed target coordinates, and associate the error estimate with the appropriate target.",
    "id": [
      930,
      1042,
      929,
      792,
      928,
      787,
      866,
      931,
      1144,
      958
    ],
    "example": [
      "The Tactical Control System will have the functionality to determine target coordinates, and estimate target coordinate accuracy.",
      "For mission planning, the Tactical Control System shall provide terrain avoidance warning and minimum reception altitude calculations for line of sight flights.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions located on the payload imagery display.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions on the map display.",
      "The Tactical Control System shall have the capability to display Near-Real Time (NRT) imagery to include, as a minimum, date/time group, target location coordinates when the target is in the center of the field of view, north seeking arrow, and AV position and heading.",
      "The Tactical Control System shall facilitate automated processing of mission plan data received via C4I interfaces in order to extract the appropriate mission planning data.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "The Tactical Control System shall support a target location function where the operator can request the current ground location of the payload field-of-view center.",
      "The Tactical Control System HCI shall provide for the capability to automatically designate target locations from the payload screen onto the map screen.",
      "The Tactical Control System shall prepare annotated as well as un-annotated analog imagery for transmission. "
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of entering DII-COE compliant (C4I) networks.",
    "id": [
      702,
      983,
      701,
      996,
      991,
      960,
      768,
      943,
      950,
      765
    ],
    "example": [
      "The Tactical Control System will be capable of entering DII/COE compliant networks.",
      "The Tactical Control System will be interoperable with C4I systems.",
      "The Tactical Control System integration with C4I systems will be accomplished through development of interfaces that permit information exchange between the Tactical Control System and specified C4I systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with CCTV.",
      "The Tactical Control System shall have the functionality to monitor the status of all C4I interfaces, and display appropriate control information.",
      "In the Training Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Tactical Control System will have the capability to manage all operational C4I interfaces across all 5 levels of interaction.",
      "The Tactical Control System will have the functionality to process received C4I messages and to prepare C4I messages for transmission.",
      "In the Normal Operations Mode the Tactical Control System shall support C4I systems interface."
    ]
  },
  {
    "text": "The Tactical Control System shall establish analog communication with C4I systems and terminate the communication once it is completed.",
    "id": [
      946,
      949,
      947,
      748,
      1049,
      749,
      778,
      1138,
      757,
      950
    ],
    "example": [
      "The Tactical Control System shall establish digital communication with the C4I systems and terminate the communication upon completion.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate analog communication with peripheral devices.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate digital communication with peripheral devices.",
      "When the Tactical Control System Software is terminated normally the Tactical Control System shall enter the Normal Startup Mode of operation upon application of power.",
      "Upon detection of loss of link, the Tactical Control System shall attempt to reestablish communications with the air vehicle.",
      "When the Tactical Control System software is halted due to an unplanned power interruption as well as abnormal program termination, then the Tactical Control System shall enter the Recovery Startup Mode upon application of power.",
      "Shutdown of the Tactical Control System shall include storage as well as deletion, as specified by the operator, of mission data files, shutdown of appropriate functions, shutdown of HCIs, and proper termination of all active interfaces.",
      "The Tactical Control System HCI shall provide for a rapid means to cancel aural warnings.",
      "For recovery from abnormal termination, Tactical Control System shall prompt the operator to select the type of recovery to be executed: (1)Resume in the Same Modes And Data; (2)Resume in the Same Modes but Review and Modify the Command Data as Necessary; or, (3) Perform a Command Shutdown and Startup Via the Normal ",
      "The Tactical Control System will have the functionality to process received C4I messages and to prepare C4I messages for transmission."
    ]
  },
  {
    "text": "The Tactical Control System shall be equipped to prepare both annotated and un-annotated digital imagery for transmission.",
    "id": [
      958,
      959,
      954,
      945,
      964,
      1011,
      1030,
      1009,
      920,
      756
    ],
    "example": [
      "The Tactical Control System shall prepare annotated as well as un-annotated analog imagery for transmission. ",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall have the capability to review incoming annotated as well as un-annotated digital imagery.",
      "The Tactical Control System shall send and receive annotated and un-annotated digital imagery.",
      "The Tactical Control System shall be equipped to view incoming and outgoing, both annotated and un-annotated analog imagery.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall have the functionality to output digital message data and imagery to a hard copy printer.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "The Tactical Control System shall be capable of automatically recording system state data, interface communications and other information necessary to support event reconstruction."
    ]
  },
  {
    "text": "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
    "id": [
      964,
      959,
      954,
      945,
      1011,
      920,
      1030,
      885,
      958,
      957
    ],
    "example": [
      "The Tactical Control System shall be equipped to view incoming and outgoing, both annotated and un-annotated analog imagery.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall have the capability to review incoming annotated as well as un-annotated digital imagery.",
      "The Tactical Control System shall send and receive annotated and un-annotated digital imagery.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
      "The Tactical Control System shall prepare annotated as well as un-annotated analog imagery for transmission. ",
      "The Tactical Control System shall provide the capability to log all incoming and outgoing formatted tactical messages."
    ]
  },
  {
    "text": "As a minimum, the Tactical Control System shall restrict Operator access to this capability via password protection.",
    "id": [
      977,
      973,
      1096,
      652,
      752,
      970,
      822,
      1037,
      1127,
      947
    ],
    "example": [
      "As a minimum, the Tactical Control System will restrict Operator access to this capability via password protection.",
      "The Tactical Control System shall restrict operator access to this capability via password protection.",
      "The Tactical Control System software shall restrict the operator(s) from exercising levels of interaction not achievable by the system.",
      "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access.",
      "The Tactical Control System shall inform the operator if the operator attempts to execute a function prohibited as a result of the determined level of interaction.",
      "As a minimum, Tactical Control System shall provide Startup FD/L for the operator workstation.",
      "A de-clutter capability shall be provided that allows the operator to display only a selected number of the most significant threats.",
      "The Tactical Control System safety requirements are intended to eliminate as well as control potential hazards to equipment and personnel involved in the Tactical Control System.",
      "The Tactical Control System shall provide maximum automated system software support to system status monitoring and alerting of the Tactical Control System operator when a preset system parameter goes under as well as over a set threshold.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate digital communication with peripheral devices."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of importing map information via operator procedure and shall be capable of incorporating vector format and Compressed ADRG (CADRG) maps.",
    "id": [
      793,
      975,
      824,
      915,
      808,
      819,
      959,
      805,
      1011,
      1030
    ],
    "example": [
      "As an objective, the Tactical Control System shall have the capability to import as well as create and modify map display overlays for fire support coordination measures [SSS547], airspace control measures [SSS548], and threat identification measures.",
      "The Tactical Control System shall be capable of importing National Imagery Mapping Agency (NIMA) Digital Terrain Elevation Data (DTED), Digital Feature Analysis Data (DFAD), Arc Digitized Raster Graphic and scanned hard copy maps, via compact disk.",
      "The Tactical Control System shall provide the capability to display waypoint data in alphanumeric format.",
      "The Tactical Control System shall have a built-in text entry capability including the ability to annotate textual information on imagery.",
      "The Tactical Control System shall provide the capability to enter waypoint data in alphanumeric format.",
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery.",
      "The Tactical Control System shall provide the capability to print waypoint data in alphanumeric format.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the capability to interface with equipment necessary to provide connectivity with standard DoD tactical (VHF, UHF, and UHF/VHF) radios, Mobile Subscriber Equipment, and military and commercial satellite communications equipment.",
    "id": [
      860,
      1012,
      685,
      939,
      996,
      994,
      989,
      993,
      999,
      986
    ],
    "example": [
      "The Tactical Control System shall provide the functionality to control the power, transmitter signal strength, and frequencies used by ADT for data link communication.",
      "The Tactical Control System shall have an interface between the Tactical Control System and DoD standard power supply equipment.",
      "The Tactical Control System will also provide connectivity to specifically identified Command, Control, Communications, Computers, and ",
      "The Tactical Control System shall have the ability to interface with Service specific ground and airborne Ultra High Frequency (UHF), Very High Frequency (VHF), UHF/VHF, and High Frequency (HF) radios for digital message transmission while using the same radios for record traffic.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSTARS GSM."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ASAS.",
    "id": [
      989,
      998,
      994,
      999,
      1001,
      996,
      993,
      1005,
      1003,
      995
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TBMCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ETRAC.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS."
    ]
  },
  {
    "text": "The Service Mission Planners will consist of AMPS, AFMSS, and TAMPS.",
    "id": [
      720,
      727,
      979,
      722,
      992,
      698,
      790,
      173,
      785,
      721
    ],
    "example": [
      "The Tactical Control System will be connected with Army Mission Planning System (AMPS)",
      "The Tactical Control System will also receive, process, and display tasking orders, and operational information from Service specific mission planning systems.",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "The Tactical Control System will be connected with Tactical Aircraft Mission Planning System (TAMPS)",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The individual armed services will identify Tactical Control System computing hardware, the desired level of Tactical Control System functionality, the battlefield C4I connectivity, and the particular type of air vehicle and payloads to be operated depending upon the deployment concept and area of operations.",
      "A Mission Plan shall include a Flight Route Plan for a selected AV, a Payload Plan for the selected payload, and a Communications Plan.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made avaiable to the ASPERA=3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from service specific mission planning systems.",
      "The Tactical Control System will be connected with Air Force Mission Support System (AFMSS)"
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
    "id": [
      1005,
      989,
      998,
      994,
      999,
      996,
      995,
      993,
      988,
      1001
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TBMCS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
    "id": [
      998,
      989,
      994,
      999,
      1005,
      996,
      995,
      988,
      993,
      1001
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TBMCS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
    "id": [
      989,
      999,
      994,
      996,
      998,
      1005,
      1001,
      988,
      987,
      993
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TBMCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS."
    ]
  },
  {
    "text": "The Tactical Control System shall as a minimum, allow Operator(s) to print freeze-frame video, C4I Messages, Mission Plans, FD/L information, and current map display.",
    "id": [
      1029,
      970,
      1143,
      906,
      947,
      921,
      1009,
      822,
      967,
      1142
    ],
    "example": [
      "The Tactical Control System shall, as a minimum, allow the Operator(s) to print freeze-frame video, C4I Messages, Mission Plans, FD/L information, and current map display to an internal printer.",
      "As a minimum, Tactical Control System shall provide Startup FD/L for the operator workstation.",
      "The Tactical Control System HCI shall provide continuously-available, on-screen control functions for time and missioncritical operations, to include as a minimum print, freeze, declassification, mark VCR, declutter, cease RF transmission.",
      "The Tactical Control System shall be capable of presenting to the operator a visual depiction of the minimum and maximum data link operational ranges.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate digital communication with peripheral devices.",
      "The Tactical Control System operator shall be able to select the content of the overlay information.",
      "The Tactical Control System shall have the functionality to output digital message data and imagery to a hard copy printer.",
      "A de-clutter capability shall be provided that allows the operator to display only a selected number of the most significant threats.",
      "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
      "The Tactical Control System HCI shall provide for on-screen information to include, as a minimum, overlays, headers, cursors, alphanumeric annotation, waypoints, crosshairs, designed to be visible against the complete spectrum of map and payload video backgrounds."
    ]
  },
  {
    "text": "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment.",
    "id": [
      1012,
      1005,
      993,
      996,
      980,
      981,
      1034,
      995,
      994,
      989
    ],
    "example": [
      "The Tactical Control System shall have an interface between the Tactical Control System and DoD standard power supply equipment.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide the system functionality to allow interfacing with external systems via a local area network.",
      "The Tactical Control System shall have an interface to an uninterruptible power supply.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS."
    ]
  },
  {
    "text": "This interface shall allow the information from the data server to be made available to other components of the Tactical Control System.",
    "id": [
      937,
      1156,
      980,
      1010,
      887,
      1006,
      886,
      1022,
      996,
      988
    ],
    "example": [
      "The Tactical Control System shall have the capability to interoperate with a data server to receive, extract, and push intelligence data.",
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall provide interfaces with the respective UAV program-provided data links for command and control.",
      "The Tactical Control System shall provide the system functionality necessary to record data obtained via the data link.",
      "The Tactical Control System shall provide an internal interface for the SAR Processor in order to disseminate SAR information (to include imagery and telemetry) to other components of the Tactical Control System.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N."
    ]
  },
  {
    "text": "An RS-170A video interface shall be provided for the system to output and input analog imagery and overlays to and from a Video Cassette Recorder (VCR) for recording and playback.",
    "id": [
      1027,
      948,
      923,
      1025,
      1074,
      910,
      844,
      938,
      137,
      975
    ],
    "example": [
      "The Tactical Control System shall be able to route VCR recorded payload video to the C4I Interfaces.",
      "The Tactical Control System shall send and receive analog imagery in RS-170A format with as well as without overlay.",
      "RS170A video and digital imagery shall be routed to Tactical Control System functions and displayed upon operator request.",
      "The Tactical Control System will provide an interface between the Tactical Control System and a video cassette recorder.",
      "The Tactical Control System computer system shall contain a CD-ROM drive that is compatible with National Imagery and Mapping Agency (NIMA), CD-ROM Digital Terrain Elevation Data (DTED), Digital Feature Analysis Data (DFAD), and embedded training media.",
      "This functionality, as a minimum, shall include: formatting, storing, internally routing, and recording the video [SSS190]; creating and storing a freeze frame of the video [SSS191]; retrieving and displaying the video [SSS192]; printing a hard copy of freeze frame video [SSS193]; and processing digital imagery for export and dissemination [SSS194].",
      "AV telemetry data shall be available to support other Tactical Control System functions as required.",
      "The Tactical Control System shall have the capability to use cable to deliver live video imagery in multiple locations.",
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be stored on a local SwRI archive for data availability and re-processing, and to support the ASPERA-3 team.",
      "The Tactical Control System shall be capable of importing National Imagery Mapping Agency (NIMA) Digital Terrain Elevation Data (DTED), Digital Feature Analysis Data (DFAD), Arc Digitized Raster Graphic and scanned hard copy maps, via compact disk."
    ]
  },
  {
    "text": "The Tactical Control System shall be able to access data storage devices.",
    "id": [
      1030,
      1011,
      886,
      1010,
      980,
      937,
      1032,
      887,
      988,
      856
    ],
    "example": [
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "The Tactical Control System shall provide the system functionality necessary to record data obtained via the data link.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall have the capability to interoperate with a data server to receive, extract, and push intelligence data.",
      "The Tactical Control System shall provide a tape drive for storage and retrieval of Tactical Control System data.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data "
    ]
  },
  {
    "text": "The Tactical Control System design shall provide protection against injury to Tactical Control System operators and maintenance personnel.",
    "id": [
      1037,
      1065,
      1059,
      1045,
      995,
      802,
      1046,
      1128,
      1127,
      1005
    ],
    "example": [
      "The Tactical Control System safety requirements are intended to eliminate as well as control potential hazards to equipment and personnel involved in the Tactical Control System.",
      "The Tactical Control System hardware shall be mounted as well as ruggedized to withstand inter and intra theater movement.",
      "The Tactical Control System shall be designed to protect its communication and data links against enemy Electronic Warfare (EW) threats, physical anti-radiation weaponry and physical destruction.",
      "The Tactical Control System shall be designed such that no single hardware failure results in an unsafe command to be transmitted to the air vehicle.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the capability to override validation faults after the fault is acknowledged by the operator.",
      "The Tactical Control System shall be designed such that no single software error results in an unsafe command to be transmitted to the air vehicle.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System shall provide maximum automated system software support to system status monitoring and alerting of the Tactical Control System operator when a preset system parameter goes under as well as over a set threshold.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG."
    ]
  },
  {
    "text": "Using risk assessment procedures defined in DoD 5200.28(D), a risk index and the minimum security requirements for Tactical Control System shall be determined.",
    "id": [
      1052,
      930,
      1042,
      1051,
      797,
      794,
      696,
      906,
      1037,
      847
    ],
    "example": [
      "Risk levels and a program to manage the probability and severity of hazards shall also be developed.",
      "The Tactical Control System will have the functionality to determine target coordinates, and estimate target coordinate accuracy.",
      "For mission planning, the Tactical Control System shall provide terrain avoidance warning and minimum reception altitude calculations for line of sight flights.",
      "System safety and health hazards, if any, shall be identified and evaluated during Phase I of the Tactical Control System development.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "Upon completion of radar cross section analysis and characterization by the Government for each UAV type, Tactical Control System shall utilize a UAV signature versus threat lookup table (database) that identities the lethality of the threat to the UAV [SSS065], and shall provide the capability of displaying aircraft signature versus threat, before and during flight.",
      "To the extent possible, the Tactical Control System will use standard DoD components in order to achieve commonality.",
      "The Tactical Control System shall be capable of presenting to the operator a visual depiction of the minimum and maximum data link operational ranges.",
      "The Tactical Control System safety requirements are intended to eliminate as well as control potential hazards to equipment and personnel involved in the Tactical Control System.",
      "The Tactical Control System shall provide the capability to enter AV preset limits which, as a minimum, will include airspeed limits, altitude limits, and fuel limits."
    ]
  },
  {
    "text": "Links that provide communications between the Tactical Control System and other systems shall be secured in a manner appropriate for the sensitivities of the material passed through such links, in accordance with DoD Directive C-5200.5, “Communication Security (COMSEC)” dated 21 April 1990.",
    "id": [
      685,
      985,
      1054,
      1068,
      950,
      933,
      1059,
      887,
      1010,
      701
    ],
    "example": [
      "The Tactical Control System will also provide connectivity to specifically identified Command, Control, Communications, Computers, and ",
      "For external communications to C4I systems the Tactical Control System shall utilize the Universal Communication Processor as well as the Common Message Processor (CMP) Government Off The Shelf (GOTS) software capabilities of the DII/COE to communicate with C4I systems using Tactical Communication (TACOMM) messages.",
      "Therefore, as per DoD Regulation 5000.2-R, dated March 15, 1996, the Tactical Control System shall meet security requirements in accordance with DoD Directive 5200.28(D), “Security Requirements for Automated Information Systems” dated March 21, 1988.",
      "The Tactical Control System hardware shall allow for long range communications from one Tactical Control System to another [SSS375], data storage expansion [SSS376], access to other computers to share in processing capability [SSS377], and multiple external peripherals [SSS378].",
      "The Tactical Control System will have the functionality to process received C4I messages and to prepare C4I messages for transmission.",
      "The Tactical Control System shall have the functionality necessary to manage all aspects of C4I system interfaces to include receiving, processing, and transmitting tactical information to include but not limited to character based text messages, NITF 2.0 imagery files, and RS-170A video.",
      "The Tactical Control System shall be designed to protect its communication and data links against enemy Electronic Warfare (EW) threats, physical anti-radiation weaponry and physical destruction.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System integration with C4I systems will be accomplished through development of interfaces that permit information exchange between the Tactical Control System and specified C4I systems."
    ]
  },
  {
    "text": "All hardware, software, documentation, and sensitive information processed by Tactical Control System shall be physically protected, minimally at the level determined by the risk index computed in to prevent intentional as well as unintentional disclosure, destruction, and modification.",
    "id": [
      1059,
      573,
      1014,
      977,
      973,
      1037,
      652,
      1069,
      907,
      609
    ],
    "example": [
      "The Tactical Control System shall be designed to protect its communication and data links against enemy Electronic Warfare (EW) threats, physical anti-radiation weaponry and physical destruction.",
      "The Correlator Monitor and Control System will be a fully observable system with the only limits placed on information access being those imposed by hardware, bandwidth, and/or security restrictions.",
      "As a minimum this information will include the location of all data terminals, launch and recovery sites, and the controlling Tactical Control System.",
      "As a minimum, the Tactical Control System will restrict Operator access to this capability via password protection.",
      "The Tactical Control System shall restrict operator access to this capability via password protection.",
      "The Tactical Control System safety requirements are intended to eliminate as well as control potential hazards to equipment and personnel involved in the Tactical Control System.",
      "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access.",
      "The Tactical Control System hardware shall support the data rate characteristics of the AV, data link and payload to ensure interoperability.",
      "The Tactical Control System will have the functionality necessary to manage all aspects of payload product handling to include receiving, processing, displaying, and performing limited exploitation.",
      "Network routers/switches shall be employed at the Master Correlator Control Computer-VLA Expansion Project Monitor and Control System interface level to protect the Master Correlator Control Computer from unauthorized access and irrelevant network traffic."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of operation within environments specified in the System/Subsystem Design Document for the land-based shelter and shipboard environments.",
    "id": [
      1148,
      1147,
      980,
      982,
      695,
      1065,
      833,
      797,
      1013,
      994
    ],
    "example": [
      "The Tactical Control System shall have an objective capability to be integrated and operated from ships.",
      "The Tactical Control System shall have a capability to be integrated and operated from land based platforms.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide external interfaces to launch and recovery systems.",
      "The Tactical Control System will provide software portability, scaleable functionality, and support for operational configurations tailored to the users’ needs.",
      "The Tactical Control System hardware shall be mounted as well as ruggedized to withstand inter and intra theater movement.",
      "The Tactical Control System shall provide the system functionality necessary to generate a payload plan.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall have an interface to a source of current navigation information.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS."
    ]
  },
  {
    "text": "Each control console shall have a display windows that provides graphic presentations of downlinked telemetry data.",
    "id": [
      1099,
      1098,
      1120,
      893,
      1142,
      1126,
      807,
      1091,
      1125,
      881
    ],
    "example": [
      "Each control console shall have a display windows that provides aircraft flight data or payload data in the foreground, with downlinked video in the background.",
      "Each control console shall have a display windows that provides the aircraft position, Tactical Control System position, flight path, and waypoint graphics in the foreground, which are positioned in relation to a map displayed in the background.",
      "The Tactical Control System shall be capable of displaying a window within a window format to include, as a minimum, displaying a video window overlaid on a map screen as well as a map screen overlaid on a video screen.",
      "The Tactical Control System shall provide an interactive display for the purpose of controlling the data link terminal.",
      "The Tactical Control System HCI shall provide for on-screen information to include, as a minimum, overlays, headers, cursors, alphanumeric annotation, waypoints, crosshairs, designed to be visible against the complete spectrum of map and payload video backgrounds.",
      "The Tactical Control System shall provide for multi-level information display tailoring by the operator.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "Tactical Control System software shall provide a windows based graphic operator interface.",
      "The Tactical Control System shall use graphical representations to convey information, such as system status, C4I links, and AV-GDT links.",
      "The Tactical Control System shall provide a graphical user interface display for the purpose of controlling the payload."
    ]
  },
  {
    "text": "Each control console shall have a display windows that presents the interface menus for workstation software.",
    "id": [
      1098,
      1099,
      1091,
      635,
      1120,
      589,
      1090,
      238,
      1124,
      1247
    ],
    "example": [
      "Each control console shall have a display windows that provides the aircraft position, Tactical Control System position, flight path, and waypoint graphics in the foreground, which are positioned in relation to a map displayed in the background.",
      "Each control console shall have a display windows that provides aircraft flight data or payload data in the foreground, with downlinked video in the background.",
      "Tactical Control System software shall provide a windows based graphic operator interface.",
      "A Graphical User Interface shall be provided as an interface to the Correlator Monitor and Control System test software that allows for a convenient and configurable tool to access the Correlator Monitor and Control System remotely through the VCI.",
      "The Tactical Control System shall be capable of displaying a window within a window format to include, as a minimum, displaying a video window overlaid on a map screen as well as a map screen overlaid on a video screen.",
      "Software tools will be provided to assist the user at all access levels from system wide configuration and control to a low level CMIB command line instruction.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services.",
      "At the main title screen, the user will be able to view a general help screen to reveal basic instructions on system play.",
      "The Tactical Control System shall provide a capability for porting an off-the-shelf, complex control joystick with multiple toggle and multi-position switches as part of the Tactical Control System hardware suite.",
      "The Remote Control GUI shall be implemented using C/C++ and ESRI Map Objects."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
    "id": [
      1043,
      802,
      1106,
      863,
      752,
      866,
      1041,
      781,
      841,
      1127
    ],
    "example": [
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
      "The Tactical Control System shall provide the capability to override validation faults after the fault is acknowledged by the operator.",
      "The Tactical Control System operator shall be required to enter an acknowledgment prior to disabling the display of critical warning flags for any AV, Payload, ADT, GDT, and Tactical Control System faults.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System shall inform the operator if the operator attempts to execute a function prohibited as a result of the determined level of interaction.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "Appropriate cautions and warnings shall be provided to the operator if the air vehicle deviates into unsafe flight regime.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "Tactical Control System shall notify the operator when AV performance parameters are out of limits.",
      "The Tactical Control System shall provide maximum automated system software support to system status monitoring and alerting of the Tactical Control System operator when a preset system parameter goes under as well as over a set threshold."
    ]
  },
  {
    "text": "When performing a given task during mission execution, the operator shall be given appropriate warning messages from other concurrently-executing subsystem tasks.",
    "id": [
      1043,
      752,
      863,
      1115,
      1107,
      801,
      855,
      781,
      1106,
      853
    ],
    "example": [
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
      "The Tactical Control System shall inform the operator if the operator attempts to execute a function prohibited as a result of the determined level of interaction.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The operational tasks to be performed concurrently by the operator during normal operation will be determined by appropriate task analysis and function allocation.",
      "A combination of visual and auditory outputs will be provided to alert the Tactical Control System operator to situations which may require operator response.",
      "The Tactical Control System shall notify the operator of all discrepancies found during the mission plan check as well as indicate successful completion of the mission plan check.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, UAV navigation methods by sending the proper control commands to the UAV.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "The Tactical Control System operator shall be required to enter an acknowledgment prior to disabling the display of critical warning flags for any AV, Payload, ADT, GDT, and Tactical Control System faults.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, flight behaviors by sending the proper control commands to the UAV."
    ]
  },
  {
    "text": "The volume of these auditory tones shall be adjustable by the operator via keyboard and trackball input to at least 20dB above the speech interference level at the operator’s ear.",
    "id": [
      1110,
      1107,
      902,
      939,
      82,
      901,
      859,
      69,
      894,
      904
    ],
    "example": [
      "In addition to displayed alert messages to the Tactical Control System operator, auditory alerts to include tones shall also be provided.",
      "A combination of visual and auditory outputs will be provided to alert the Tactical Control System operator to situations which may require operator response.",
      "The operator shall be able to manually override the automatic frequency selection if desired.",
      "The Tactical Control System shall have the ability to interface with Service specific ground and airborne Ultra High Frequency (UHF), Very High Frequency (VHF), UHF/VHF, and High Frequency (HF) radios for digital message transmission while using the same radios for record traffic.",
      "A DigitalHome system shall be able to activate both light and sound alarms: one sound alarm and one light alarm subsystem, with multiple lights.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
      "This control will including its pointing direction and mode of transmission (e.g. omni and directional).",
      "A thermostat unit shall communicate, through wireless signals, with the master control unit.",
      "The Tactical Control System shall provide automatic pointing commands for directional antennas, and shall allow for the manual pointing of directional antennas when desired by the operator.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal."
    ]
  },
  {
    "text": "The Tactical Control System shall provide automated Tactical Control System system information, control options, and logical and simple operator guidance and support for immediate and adaptive responding to crisis situations.",
    "id": [
      1128,
      992,
      780,
      727,
      978,
      995,
      989,
      1005,
      994,
      999
    ],
    "example": [
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System will allow the operator to conduct mission planning.",
      "The Tactical Control System will also receive, process, and display tasking orders, and operational information from Service specific mission planning systems.",
      "The Tactical Control System will interface with external systems to conduct mission coordination and operations.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS."
    ]
  },
  {
    "text": "The use of ITS standards will create a system that is reusable for other ITS application areas and will provide the State of Texas with a baseline system that can be cost effectively extended in the future.",
    "id": [
      999,
      1150,
      733,
      107,
      694,
      1001,
      28,
      1016,
      994,
      989
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "This Software Requirements Specification (SRS) provides the requirements for the Center-to-Center (C2C) Communications Network that is based on a Texas Department of Transportation (TxDOT) C2C project.",
      "Communications procedures, formats, and interfaces will be interoperable with selected standard DoD C4I systems, architectures, and protocols.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "To the extent possible, the Tactical Control System will use standard Department of Defense (DoD) software components to achieve commonality.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TBMCS.",
      "Where possible, the DigitalHome project will employ widely used, accepted, and available hardware and software technology and standards, both for product elements and for development tools.",
      "This interface shall allow for addition of future AVs and will provide the generic architecture to ensure interoperability.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS."
    ]
  },
  {
    "text": "The Center shall support the information about each lane closure, including network identifier, lane closure id, closure description.",
    "id": [
      1192,
      1173,
      1194,
      1170,
      1183,
      1175,
      1171,
      1201,
      1189,
      1197
    ],
    "example": [
      "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
      "The Center shall support the information about each incident, including network identifier, incident description and roadway.",
      "The Center shall support the following status information about each Dynamic Lane, including network identifier, link identifier, dynamic lane identifier, dynamic lane name and failure state.",
      "For each roadway network it maintains, the Center shall provide the network name and link data information.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the following status information about each LCS, including network identifier, LCS identifier, LCS name, Location and Status.",
      "The Center shall provide the link information, including link identifier, link name and link type.",
      "The Center shall support the following information about network device status, including network identifier, number of DMSs, number of LCSs, DMS status data, LCS status data and CCTV status data.",
      "The Center shall support the following status information about each School Zone, including network identifier, link identifier, school zone identifier and school zone name.",
      "The Center shall support the following status information about each Bus Location, including network identifier, link identifier, bus identifier, bus name, location and schedule adherece."
    ]
  },
  {
    "text": "The Center shall provide the following status information about each DMS, including network identifier, DMS identifier, DMS name.",
    "id": [
      1175,
      1201,
      1183,
      1185,
      1192,
      1174,
      1181,
      1179,
      1194,
      1200
    ],
    "example": [
      "The Center shall support the following status information about each LCS, including network identifier, LCS identifier, LCS name, Location and Status.",
      "The Center shall support the following information about network device status, including network identifier, number of DMSs, number of LCSs, DMS status data, LCS status data and CCTV status data.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the following status information about each ESS, including network identifier, environmental sensor identifier, environment sensor name, type, location and status.",
      "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "The Center shall support the following status information about each HAR, including network identifier, HAR identifier, HAR name, location and status.",
      "The Center shall support the status information about each ramp meter, including network identifier, Ramp Meter identifier, Ramp Meter name, Location and Status.",
      "The Center shall support the following status information about each Dynamic Lane, including network identifier, link identifier, dynamic lane identifier, dynamic lane name and failure state.",
      "The Center shall support the following status information about each Vehicle Priority, including vehicle identifier, network identifier, link identifier and intersection identifier."
    ]
  },
  {
    "text": "To support LCS control in other centers, the Center shall be able to support the following device control command for a LCS, including network identifier, LCS identifier, username and Password.",
    "id": [
      1174,
      1193,
      1195,
      1184,
      1190,
      1182,
      1175,
      1187,
      1201,
      1180
    ],
    "example": [
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "To support Reversible Lane control in other centers, the Center shall be able to support the following device control command for a Reversible Lane, including network identifier, reversible lane identifier, username, password, plan and duration.",
      "To support Dynamic Lane control in other centers, the Center shall be able to support the following device control command for a Dynamic Lane, including network identifier, dynamic lane identifier, username, password and lane plan.",
      "To support Traffic Signal control in other centers, the Center shall be able to support the following device control command for a Traffic Signal, including network identifier, traffic signal identifier, username, password and traffic signal plan identifier.",
      "To support School Zone control in other centers, the Center shall be able to support the following device control command for a School Zone, including network identifier, school zone identifier, username, password and plan.",
      "To support HAR control in other centers, the Center shall be able to support the following device control command for a HAR, including network identifier, HAR identifier, username, password and message.",
      "The Center shall support the following status information about each LCS, including network identifier, LCS identifier, LCS name, Location and Status.",
      "To support HOV Lane control in other centers, the Center shall be able to support the following device control command for a HOV Lane, including network identifier, HOV Lane identifier, username, password and lane plan.",
      "The Center shall support the following information about network device status, including network identifier, number of DMSs, number of LCSs, DMS status data, LCS status data and CCTV status data.",
      "To support Ramp Meter control in other centers, the Center shall be able to support the following device control command for a ramp meter, including network identifier, Ramp Meter identifier, username, password and plan."
    ]
  },
  {
    "text": "The Center shall provide the information status information about each CCTV, including network identifier, CCTV identifier, CCTV name, Location and Status.",
    "id": [
      1177,
      1176,
      1201,
      1178,
      1233,
      1183,
      1175,
      1185,
      1200,
      1181
    ],
    "example": [
      "To support video snapshots, the Center shall be able to support the status information, including network identifier, CCTV identifier, CCTV name and status.",
      "To support CCTV control in other centers, the Center shall be able to support the following CCTV control request, including network identifier, CCTV identifier, username, Password.",
      "The Center shall support the following information about network device status, including network identifier, number of DMSs, number of LCSs, DMS status data, LCS status data and CCTV status data.",
      "To support CCTV switching in other centers, the Center shall be able to support the following CCTV switching command, including network identifier, username, Password and video channel input identifier.",
      "Once an Center is selected, the user shall be able to select a CCTV from a list and provide the following information.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the following status information about each LCS, including network identifier, LCS identifier, LCS name, Location and Status.",
      "The Center shall support the following status information about each ESS, including network identifier, environmental sensor identifier, environment sensor name, type, location and status.",
      "The Center shall support the following status information about each Vehicle Priority, including vehicle identifier, network identifier, link identifier and intersection identifier.",
      "The Center shall support the following status information about each HAR, including network identifier, HAR identifier, HAR name, location and status."
    ]
  },
  {
    "text": "The Center shall support the following status information about each Light/Commuter Location, including network identifier, link identifier, commuter or light rail identifier, commuter or light rail name, location and schedule adherence.",
    "id": [
      1198,
      1197,
      1191,
      1183,
      1196,
      1199,
      1192,
      1200,
      1188,
      1189
    ],
    "example": [
      "The Center shall support the following status information about each Light/Commuter Stop, including network identifier, link identifier, commuter or light rail stop identifier, commuter or light rail stop name, location and routes.",
      "The Center shall support the following status information about each Bus Location, including network identifier, link identifier, bus identifier, bus name, location and schedule adherece.",
      "The Center shall support the following status information about each Railroad Crossing, including network identifier, link identifier, rail crossing identifier, rail crossing name, location and status.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the following status information about each Bus Stop, including network identifier, link identifier, relative link location, name and location.",
      "The Center shall support the following status information about each Park and Ride Lot, including network identifier, park and ride lot identifier, park and ride lot name, location, status and capacity.",
      "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
      "The Center shall support the following status information about each Vehicle Priority, including vehicle identifier, network identifier, link identifier and intersection identifier.",
      "The Center shall support the following status information about each Parking Lot, including network identifier, parking lot identifier, parking lot name, location and status.",
      "The Center shall support the following status information about each School Zone, including network identifier, link identifier, school zone identifier and school zone name."
    ]
  },
  {
    "text": "The device status requestor and Center shall support the following information for command timeframe request, including network identifier, device type, days commands accepted and times commands accepted.",
    "id": [
      1202,
      1184,
      1193,
      1174,
      1240,
      1195,
      1201,
      1182,
      1183,
      1197
    ],
    "example": [
      "The device status requestor and Center shall support the following information for command timeframe request, including network identifier and device type.",
      "To support Traffic Signal control in other centers, the Center shall be able to support the following device control command for a Traffic Signal, including network identifier, traffic signal identifier, username, password and traffic signal plan identifier.",
      "To support Reversible Lane control in other centers, the Center shall be able to support the following device control command for a Reversible Lane, including network identifier, reversible lane identifier, username, password, plan and duration.",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "For each device command/control status request sent by the Remote GUI, the status returned from the network identifier will be displayed in a scrollable list on the GUI.",
      "To support Dynamic Lane control in other centers, the Center shall be able to support the following device control command for a Dynamic Lane, including network identifier, dynamic lane identifier, username, password and lane plan.",
      "The Center shall support the following information about network device status, including network identifier, number of DMSs, number of LCSs, DMS status data, LCS status data and CCTV status data.",
      "To support HAR control in other centers, the Center shall be able to support the following device control command for a HAR, including network identifier, HAR identifier, username, password and message.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the following status information about each Bus Location, including network identifier, link identifier, bus identifier, bus name, location and schedule adherece."
    ]
  },
  {
    "text": "The GUI shall provide a list of previously entered lane closures.",
    "id": [
      1224,
      1223,
      1227,
      1228,
      1222,
      1192,
      1194,
      1226,
      1225,
      1239
    ],
    "example": [
      "The GUI shall provide a list of previously entered incidents.",
      "The Incident GUI shall allow the user to input the following information for each lane closure.",
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "The Incident GUI shall allow the user to input the following information for each incident.",
      "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
      "The Center shall support the following status information about each Dynamic Lane, including network identifier, link identifier, dynamic lane identifier, dynamic lane name and failure state.",
      "The GUI shall allow a user to delete a previously entered incident.",
      "The GUI shall allow the data about an incident to be modified.",
      "Once an Center is selected, the user shall be able to select a Dynamic Lane from a list and provide the following information, including Target Dynamic Lane and Plan."
    ]
  },
  {
    "text": "The user shall be provided with the capability to select a network identifier for a device command/control request.",
    "id": [
      1202,
      1230,
      1240,
      1184,
      1174,
      633,
      1229,
      655,
      900,
      898
    ],
    "example": [
      "The device status requestor and Center shall support the following information for command timeframe request, including network identifier and device type.",
      "When the GUI application is initiated, the user shall be prompted for the following information, including User name and Password.",
      "For each device command/control status request sent by the Remote GUI, the status returned from the network identifier will be displayed in a scrollable list on the GUI.",
      "To support Traffic Signal control in other centers, the Center shall be able to support the following device control command for a Traffic Signal, including network identifier, traffic signal identifier, username, password and traffic signal plan identifier.",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "Software shall be provided that allows an authorized user full access to all messaging, monitor, and control traffic.",
      "The remote Center Control GUI shall be designed to execute on a public network (e.g., Internet) and transmit equipment requests to the C-2-C software system.",
      "This could be done via a username and associated password scheme that would authenticate and authorize the user access to the EVLA Correlator Monitor and Control System and, if applicable, grant the user access to restricted or controlled parts of the EVLA Correlator Monitor and Control System.",
      "The operator shall be able to manually override the automatic mode selection of the selected data terminal, if desired.",
      "The operator shall be able to manually override the automatic function selection of the selected data terminal, if desired."
    ]
  },
  {
    "text": "Once an Center is selected, the user shall be able to issue a CCTV switching command, including Source (input) and Destination port (output).",
    "id": [
      1178,
      1233,
      1176,
      1177,
      1229,
      1184,
      1231,
      1236,
      1193,
      1174
    ],
    "example": [
      "To support CCTV switching in other centers, the Center shall be able to support the following CCTV switching command, including network identifier, username, Password and video channel input identifier.",
      "Once an Center is selected, the user shall be able to select a CCTV from a list and provide the following information.",
      "To support CCTV control in other centers, the Center shall be able to support the following CCTV control request, including network identifier, CCTV identifier, username, Password.",
      "To support video snapshots, the Center shall be able to support the status information, including network identifier, CCTV identifier, CCTV name and status.",
      "The remote Center Control GUI shall be designed to execute on a public network (e.g., Internet) and transmit equipment requests to the C-2-C software system.",
      "To support Traffic Signal control in other centers, the Center shall be able to support the following device control command for a Traffic Signal, including network identifier, traffic signal identifier, username, password and traffic signal plan identifier.",
      "Once an Center is selected, the user shall be able to select a DMS from a list and provide the following information, including Target DMS, Message to be displayed and Beacons On/Off.",
      "Once an Center is selected, the user shall be able to select a Traffic Signal from a list and provide the following information, including Target Traffic Signal and Plan.",
      "To support Reversible Lane control in other centers, the Center shall be able to support the following device control command for a Reversible Lane, including network identifier, reversible lane identifier, username, password, plan and duration.",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password."
    ]
  },
  {
    "text": "Once an Center is selected, the user shall be able to select a Reversible Lane from a list and provide the following information, including Target Reversible Lane and Plan.",
    "id": [
      1239,
      1236,
      1232,
      1234,
      1238,
      1231,
      1193,
      1235,
      1237,
      1195
    ],
    "example": [
      "Once an Center is selected, the user shall be able to select a Dynamic Lane from a list and provide the following information, including Target Dynamic Lane and Plan.",
      "Once an Center is selected, the user shall be able to select a Traffic Signal from a list and provide the following information, including Target Traffic Signal and Plan.",
      "Once an Center is selected, the user shall be able to select a LCS from a list and provide the following information, including Target LCS and Assignment of lane arrows.",
      "Once an Center is selected, the user shall be able to select a Ramp Meter from a list and provide the following information, including Target Ramp Meter and Plan.",
      "Once an Center is selected, the user shall be able to select a School Zone from a list and provide the following information, including Target School Zone and Plan.",
      "Once an Center is selected, the user shall be able to select a DMS from a list and provide the following information, including Target DMS, Message to be displayed and Beacons On/Off.",
      "To support Reversible Lane control in other centers, the Center shall be able to support the following device control command for a Reversible Lane, including network identifier, reversible lane identifier, username, password, plan and duration.",
      "Once an Center is selected, the user shall be able to select a HAR from a list and provide the following information, including Target HAR and Text to be sent to the HAR.",
      "Once an Center is selected, the user shall be able to select a HOV from a list and provide the following information, including Target HOV and Plan.",
      "To support Dynamic Lane control in other centers, the Center shall be able to support the following device control command for a Dynamic Lane, including network identifier, dynamic lane identifier, username, password and lane plan."
    ]
  },
  {
    "text": "The Center-to-Center shall execute in a Microsoft Windows NT environment.",
    "id": [
      1241,
      1244,
      1091,
      1245,
      1159,
      557,
      1247,
      509,
      1229,
      692
    ],
    "example": [
      "The Center-to-Center Server shall execute in a Microsoft Windows NT environment.",
      "The Center-to-Center shall be implemented in the C/C++ programming language.",
      "Tactical Control System software shall provide a windows based graphic operator interface.",
      "The Center-to-Center web interface shall be implemented using C/C++ and ESRI ARC IMS.",
      "The software is being designed so that multiple instances of a building block can be deployed by simply “configuring” the building block of operation within a specific agency.",
      "It is the primary interface by which the correlator is configured, operated, and serviced.",
      "The Remote Control GUI shall be implemented using C/C++ and ESRI Map Objects.",
      "The proposed functional architecture is modeled around centralized deployment to facilitate ease of maintenance and leverage advancement in open standards and web technologies.",
      "The remote Center Control GUI shall be designed to execute on a public network (e.g., Internet) and transmit equipment requests to the C-2-C software system.",
      "The Tactical Control System will operate in an open architecture and be capable of being hosted on computers that are typically supported by the using Service."
    ]
  }
]