[
  {
    "text": "The user communicates through a personal web page on the DigitalHome web server or on a local home server.",
    "id": [
      45,
      43,
      10,
      42,
      63,
      44,
      1208,
      46,
      1022,
      18
    ],
    "example": [
      "The home web server will provide ability to establish and maintain DigitalHome User Accounts.",
      "The home web server will provide interaction with and control of the DigitalHome elements.",
      "The DigitalHome web server communicates, through a home wireless gateway device, with the sensor and controller devices in the home.",
      "A DigitalHome System shall have the capability to establish an individual home web server hosted on a home computer.",
      "The communication center of the DigitalHome system shall be a DigitalHome home web server, through which a user shall be able to monitor and control home devices and systems.",
      "The home web server will provide storage of DigitalHome plans and data.",
      "The Web Map application generates a map that can be displayed on an Internet WWW server.",
      "The home web server will provide backup service for user account information, user plans and a home database.",
      "Remotely hosted applications shall communicate in a client server relationship via the defined data server interface.",
      "Although the general user is not familiar with the technical features of the DigitalHome system, he/she is familiar with the use of a web interface and can perform simple web operations (logging in and logging out, browsing web pages, and submitting information and requests via a web interface)."
    ]
  },
  {
    "text": "The sensor part of the thermostat has a sensitivity range between 14ºF and 104ºF (-10ºC and 40ºC).",
    "id": [
      51,
      52,
      50,
      72,
      69,
      70,
      55,
      53,
      65,
      73
    ],
    "example": [
      "The thermostat shall provide a reading of the current temperature in the space where the thermostat is located.",
      "The controller part of thermostat shall provides a “set point” temperature that is used to control the flow of heat energy (by switching heating or cooling devices on or off as needed) to achieve the set point temperature.",
      "The system shall include digital programmable thermostats, which shall be used to monitor and regulate the temperature of an enclosed space.",
      "The thermostats may be controlled individually or collectively, so that temperature can be controlled at different levels in different home spaces.",
      "A DigitalHome user shall be able to read the temperature at a thermostat position.",
      "A DigitalHome user shall be able to set the thermostat temperatures to between 60 °F and 80 °F, inclusive, at one degree increments.",
      "The humidistat shall provide a “set point” humidity that is used to control humidifiers and dehumidifiers achieve the set point humidity.",
      "The system shall include digital programmable humidistats, which shall be used to monitor and regulate the humidity of an enclosed space.",
      "The DigitalHome shall be equipped with various environmental controllers and sensors (temperature controller-sensors: thermostats, humidity controller-sensors: humidistats, contact sensors, security sound and light alarms, and power switches).",
      "A single thermostat shall be placed in an enclosed space (e.g., a room in the house) for which the air temperature is to be controlled."
    ]
  },
  {
    "text": "For each humidistat, up to twenty-four one hour settings per day for every day of the week can be scheduled.",
    "id": [
      74,
      96,
      99,
      82,
      75,
      72,
      95,
      70,
      102,
      629
    ],
    "example": [
      "For each thermostat, up to twenty-four one hour settings per day for every day of the week can be scheduled.",
      "For a given month and year, a user shall be able to create or modify a month plan that specifies for each day, for up to four daily time periods, the environmental parameter settings (temperature, humidity, contact sensors and power switches).",
      "The month report shall contain daily average, maximum (with time) and minimum (with time) values of temperature and humidity for each thermostat and humidistat, respectively.",
      "A DigitalHome user shall be able to set the humidity level for a humidistat, from 30% to 60%, inclusive a 1% increments.",
      "If a thermostat device allows a user to make a manual temperature setting, the setting shall remain in effect until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "The thermostats may be controlled individually or collectively, so that temperature can be controlled at different levels in different home spaces.",
      "DigitalHome Planner shall provide a user with the capability to direct the system to set various preset home parameters (temperature, humidity, security contacts, and on/off appliance/light status) for certain time periods.",
      "A DigitalHome user shall be able to set the thermostat temperatures to between 60 °F and 80 °F, inclusive, at one degree increments.",
      "Displays of environmental conditions (temperature, humidity, contact sensors and power switches) shall be updated at least every two seconds.",
      "Other message internal time stamps can be used as monitor/control parameters as deemed necessary."
    ]
  },
  {
    "text": "The system shall be able to provide information about the state of a power switch (OFF or ON), indicating the whether an appliance connected to the power switch is OFF or ON.",
    "id": [
      93,
      58,
      59,
      56,
      611,
      89,
      92,
      1012,
      94,
      91
    ],
    "example": [
      "The system shall be able to change the state of a power switch (OFF to ON, or ON to OFF), in turn changing the state of an appliance connected to the power switch.",
      "The system shall include digital programmable power switches which shall be used to monitor the current state of an appliance (e.g., a coffee maker is off or on).",
      "The system shall be able to use a power switch to change the state of the appliance (e.g., from “off” to “on”).",
      "The system shall include magnetic alarm contact switches which shall be used to monitor entry through a door or window when the switch is active.",
      "The UPS devices need the ability to signal the Correlator Monitor and Control System when a power outage has occurred and keep the Correlator Monitor and Control System apprised of time remaining on backup power.",
      "A DigitalHome system shall be able to activate both light and sound alarms: one sound alarm and one light alarm subsystem, with multiple lights.",
      "The Appliance Manager shall be able to manage up to one hundred 115 volt, 10 amp power switches.",
      "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment.",
      "If a user changes the state of power switch device manually, the device shall remain in that state until the end of the planned or default time period, at which time the planned or default setting will be used for the next time period.",
      "The DigitalHome programmable Appliance Manager shall provide for management of a home’s small appliances, including lighting units, by allowing a user to turn them on or off as desired."
    ]
  },
  {
    "text": "The DigitalHome System must be highly reliable with no more than 1 failure per 10,000 hours of operation.",
    "id": [
      584,
      623,
      109,
      499,
      955,
      541,
      568,
      610,
      516,
      572
    ],
    "example": [
      "The ability of the Correlator System to achieve and maintain high reliability and uptime will be vitally dependent upon reliable operation and rapid diagnosis and repair of faults in the hardware and software systems.",
      "The Correlator Monitor and Control System processors shall be capable of meeting all data processing deadlines and anticipated future requirements The Correlator Monitor and Control System processors shall be capable of responding to correlator hardware inputs in a deterministic fashion with sufficient performance to avoid data loss, corruption or overflows.",
      "Although there are no specific safety requirements, high system reliability is important to insure there are no system failures in carrying out user requests.",
      "In the event of any software or hardware failure, it must be possible to restore the CCTNS system (with inline synchronization) within no more than <xx> hours.",
      "All digital messages received by the Tactical Control System shall be automatically checked for errors and corrected when possible.",
      "The CCTNS system should ensure high scalability and performance through using of cache for storing frequent data.",
      "The Correlator Monitor and Control System will be a fully observable system with the only limits placed on information access being those imposed by hardware, bandwidth, and/or security restrictions.",
      "Where applicable, all computers and peripherals shall be powered though UPS type devices with sufficient capacity for the computers to safely coordinate a system wide shutdown of the correlator hardware in the event of a prolonged power outage.",
      "The CCTNS system should be designed in manner that operational data is not lost in case of any failure of equipment or communication network.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network."
    ]
  },
  {
    "text": "This Software Requirements Specification (SRS) identifies the requirements for the ASPERA-3 Processing and Archiving Facility (APAF) ground data system for the Mars Express mission.",
    "id": [
      165,
      172,
      122,
      128,
      119,
      173,
      171,
      3,
      146,
      178
    ],
    "example": [
      "The APAF data system requirements for delivering the ASPERA-3 IDFS data, Mars Express Orbit/Attitude IDFS data, and software are described in the following table.",
      "ASPERA-3 data shall be provided to NASA PDS in PDS-compliant form.",
      "The ASPERA-3 Processing and Archiving Facility (APAF) is a ground data system responsible for processing all of the ASPERA-3 telemetry.",
      "In addition, validation and archiving of all ASPERA-3 scientific data in the NASA Planetary Data System (PDS) within 6 months of receipt in a form useable by the general scientific community is to be provided by the APAF.",
      "The ASPERA-3 instrument package will be flown on the Mars Express mission of the European Space Agency (ESA) and will be launched in June 2003 according to the current schedule.",
      "ASPERA-3 data shall be calibrated and validated prior to depositing in the NASA PDS.",
      "ASPERA-3 IDFS data and MEX OA IDFS data shall be provided to NASA PDS.",
      "The DigitalHome Software Requirements Specification (SRS) is based on the DigitalHome Customer Need Statement.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made avaiable to the ASPERA=3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives."
    ]
  },
  {
    "text": "ASPERA-3 contains a number of different sensors that will measure the particles, neutral atoms, and fields in the near Martian environment.",
    "id": [
      125,
      142,
      171,
      905,
      124,
      122,
      119,
      814,
      178,
      146
    ],
    "example": [
      "There are six components of the ASPERA-3 package, plus the orbit and attitude data from the spacecraft: Data Processing Unit(DPU), Electron Spectrometer(ELS), Ion Mass Analyzer(IMA), Neutral Particle Detector(NPD), Neutral Particle Imager(NPI), Scanning Unit(SU), Orbit/Attitude(OA).",
      "Web-based displays defined by ASPERA-3 team shall be provided where any available ASPERA-3 data (as opposed to just the most current) can be used for science analysis to support the ASPERA-3 team in meeting mission goals and objectives.",
      "ASPERA-3 IDFS data and MEX OA IDFS data shall be provided to NASA PDS.",
      "The Tactical Control System shall have the functionality to process payload product data from Electro Optical (EO), Infrared (IR), and Synthetic Aperture Radar (SAR) payloads.",
      "The first step in defining the IDFS data sets is to identify the physical instruments that make up the ASPERA-3 experiment and any ancillary data necessary for scientific analysis.",
      "The ASPERA-3 Processing and Archiving Facility (APAF) is a ground data system responsible for processing all of the ASPERA-3 telemetry.",
      "The ASPERA-3 instrument package will be flown on the Mars Express mission of the European Space Agency (ESA) and will be launched in June 2003 according to the current schedule.",
      "The Tactical Control System flight route planner will provide payload search area information, such as visual acuity range due to atmospheric conditions, diurnal transition periods for thermal imagery, and lunar and solar terrain shadowing.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made avaiable to the ASPERA=3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives."
    ]
  },
  {
    "text": "The APAF ground data system is to provide data processing algorithms and support to IRF for the ASPERA-3 science team (including Co-I’s) in preparation for the Mission Operations and Data Analysis (MO&DA) phase of the Mars Express mission.",
    "id": [
      146,
      178,
      122,
      119,
      171,
      128,
      135,
      142,
      177,
      173
    ],
    "example": [
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made avaiable to the ASPERA=3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "The ASPERA-3 Processing and Archiving Facility (APAF) is a ground data system responsible for processing all of the ASPERA-3 telemetry.",
      "The ASPERA-3 instrument package will be flown on the Mars Express mission of the European Space Agency (ESA) and will be launched in June 2003 according to the current schedule.",
      "ASPERA-3 IDFS data and MEX OA IDFS data shall be provided to NASA PDS.",
      "In addition, validation and archiving of all ASPERA-3 scientific data in the NASA Planetary Data System (PDS) within 6 months of receipt in a form useable by the general scientific community is to be provided by the APAF.",
      "The APAF system shall acquire from ESOC the telemetry data of the ASPERA-3 Experiment and Mars Express Orbit/Attitude to automatically process the data on a daily basis.",
      "Web-based displays defined by ASPERA-3 team shall be provided where any available ASPERA-3 data (as opposed to just the most current) can be used for science analysis to support the ASPERA-3 team in meeting mission goals and objectives.",
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "ASPERA-3 data shall be calibrated and validated prior to depositing in the NASA PDS."
    ]
  },
  {
    "text": "Each requirement shall be: assigned a project-unique identifier.",
    "id": [
      416,
      418,
      1164,
      551,
      673,
      1203,
      1168,
      651,
      166,
      553
    ],
    "example": [
      "Application user interfaces to meet its requirements and recommendations.",
      "User interfaces should meet its requirements and recommendations.",
      "The following sections define the requirements for the Center-to-Center project.",
      "The primary goal of this document is to provide a complete and accurate list of requirements for the VLA Expansion Project Correlator Monitor and Control System.",
      "The SSS further specifies the methods to be used to ensure that each requirement has been met.",
      "The Center shall support the following status information about each Vehicle Priority, including vehicle identifier, network identifier, link identifier and intersection identifier.",
      "The Requirement Category Mnemonic is a two-letter mnemonic for each functional area.",
      "All users of the Correlator Monitor and Control System must be uniquely identified.",
      "The mnemonic, DR, is used in the requirement identifiers to show that these requirements are Delivery Requirements.",
      "The document may also be of interest to VLA Expansion Project project scientists and engineers or as a reference for individuals involved in similar projects with similar requirements."
    ]
  },
  {
    "text": "Intermediate files of cleaned-up ASPERA-3 and MEX OA telemetry shall be generated in the event that cleaned-up telemetry is not provided by ESOC to support the ASPERA-3 team in meeting mission goals and objectives.",
    "id": [
      140,
      170,
      168,
      169,
      143,
      138,
      123,
      173,
      171,
      178
    ],
    "example": [
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be stored on a local SwRI archive for data availability and re-processing, and to support the ASPERA-3 team.",
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry that are electronically distributed shall be provided to the ASPERA-3 Co-I’s within 24 hours of acquiring ASPERA-3 and MEX OA telemetry as long as the transmission and processing are error-free to support the ASPERA-3 team in meeting MEX mission goals and objectives.",
      "ASPERA-3 IDFS data that are electronically distributed shall be provided to the ASPERA-3 Co-I’s within 24 hours of acquiring ASPERA-3 telemetry as long as the transmission and processing are error-free to support the ASPERA-3 team in meeting MEX mission goals and objectives ",
      "MEX OA IDFS data that are electronically distributed shall be provided to the ASPERA-3 Co-I’s within 24 hours of acquiring MEX OA telemetry as long as the transmission and processing are error-free to support the ASPERA-3 team in meeting MEX mission goals and objectives.",
      "The web-based displays defined by the ASPERA-3 team to be used for science analysis shall be password protected until the ASPERA-3 data is made public to support the ASPERA-3 team in meeting mission goals and objectives.",
      "The ASPERA-3 and MEX OA telemetry data shall be stored on a local SwRI archive for data availability and re-processing.",
      "The APAF data system acquires the telemetry data via NISN, processes the data into IDFS data sets, distributes the IDFS data sets to the ASPERA-3 team, provides web-based displays of the most current data for public view, stores the telemetry and IDFS data sets on a local SwRI archive, and submits the ASPERA-3 IDFS data sets to PDS for long-term archival.",
      "ASPERA-3 data shall be calibrated and validated prior to depositing in the NASA PDS.",
      "ASPERA-3 IDFS data and MEX OA IDFS data shall be provided to NASA PDS.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made avaiable to the ASPERA=3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives."
    ]
  },
  {
    "text": "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
    "id": [
      177,
      146,
      178,
      142,
      168,
      175,
      143,
      140,
      692,
      123
    ],
    "example": [
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made avaiable to the ASPERA=3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Web-based displays defined by ASPERA-3 team shall be provided where any available ASPERA-3 data (as opposed to just the most current) can be used for science analysis to support the ASPERA-3 team in meeting mission goals and objectives.",
      "ASPERA-3 IDFS data that are electronically distributed shall be provided to the ASPERA-3 Co-I’s within 24 hours of acquiring ASPERA-3 telemetry as long as the transmission and processing are error-free to support the ASPERA-3 team in meeting MEX mission goals and objectives ",
      "SwRI shall provide IDFS data processing algorithms to IRF.",
      "The web-based displays defined by the ASPERA-3 team to be used for science analysis shall be password protected until the ASPERA-3 data is made public to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Any APAF-generated intermediate files of ASPERA-3 and MEX OA cleaned-up telemetry shall be stored on a local SwRI archive for data availability and re-processing, and to support the ASPERA-3 team.",
      "The software will provide the UAV operator the necessary tools for computer related communications, mission tasking, mission planning, mission execution, data receipt, data processing, limited data exploitation, and data dissemination.",
      "The APAF data system acquires the telemetry data via NISN, processes the data into IDFS data sets, distributes the IDFS data sets to the ASPERA-3 team, provides web-based displays of the most current data for public view, stores the telemetry and IDFS data sets on a local SwRI archive, and submits the ASPERA-3 IDFS data sets to PDS for long-term archival."
    ]
  },
  {
    "text": "All internal interfaces are left to the design.",
    "id": [
      148,
      1036,
      644,
      1093,
      642,
      1091,
      641,
      648,
      581,
      1072
    ],
    "example": [
      "All internal data requirements are left to the design.",
      "All Tactical Control System internal data decisions will be left to the design and the requirement specifications for system components.",
      "All software processes shall be killable, restartable, debuggable and testable with minimal impact on normal system operations.",
      "Training software shall be alterable without affecting the configuration of the operational software.",
      "All software application modules shall be debuggable.",
      "The Tactical Control System software shall be non-proprietary and have unlimited data rights.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "Seamlessness shall be accomplished in a manner that is seamless, in that it does not affect hardware modules or software functionality that it meets at interfaces.",
      "All use of the Correlator Monitor and Control System will be through the VCI or Master Correlator Control Computer.",
      "For each OUTRIDER system, the Tactical Control System shall provide full independent computer redundancy."
    ]
  },
  {
    "text": "There shall be a UNIX-based APAF system development computer.",
    "id": [
      158,
      556,
      1089,
      698,
      631,
      159,
      563,
      995,
      988,
      570
    ],
    "example": [
      "There shall be a UNIX-based APAF system production computer with an archival system.",
      "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services.",
      "The Tactical Control System will use the computing hardware specified by the service specific procurement contracts.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "There shall be a web server for the APAF system for web-based displays and information change.",
      "The Correlator Monitor and Control System will provide a level of abstraction to modularize the correlator system within the VLA Expansion Project environment.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JDISS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "Correlator configurations and control instructions will be received from the VLA Expansion Project Monitor and Control System system in a form suitable for translation by the Master Correlator Control Computer."
    ]
  },
  {
    "text": "SwRI shall provide software support for the APAF system.",
    "id": [
      164,
      177,
      161,
      146,
      178,
      175,
      159,
      1089,
      1243,
      187
    ],
    "example": [
      "SwRI shall provide APAF system maintenance.",
      "IDFS data access software developed by SwRI shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "The SwRI software team shall provide system maintenance and software support.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made available to the ASPERA-3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "Science analysis software developed by SwRI to analyze IDFS-formatted data shall be made avaiable to the ASPERA=3 Co-I’s to support the ASPERA-3 team in meeting mission goals and objectives.",
      "SwRI shall provide IDFS data processing algorithms to IRF.",
      "There shall be a web server for the APAF system for web-based displays and information change.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services.",
      "The web server application shall use ESRI's ARC Internet Map Server (ARC IMS) product for creating of map images.",
      "Some of the software quality factors that will be considered when developing the APAF data system include: reliability, maintainability, availability, flexibility, portability, testability, and usability."
    ]
  },
  {
    "text": "The APAF data system will not impose hazards to personnel, property, or the environment.",
    "id": [
      150,
      183,
      185,
      193,
      182,
      186,
      188,
      516,
      573,
      192
    ],
    "example": [
      "There are no security requirements associated with the APAF ground data system.",
      "There are no installation-dependent requirements for the operation of the APAF data system.",
      "Therefore, there are no safety requirements of the APAF ground data system.",
      "There are no requirements of the APAF data system that need special treatment or consideration at this time.",
      "The APAF data system is not required to operate in more than one state or mode.",
      "Although the APAF data system and associated software will be developed with the highest quality possible, there are no requirements concerned with software quality.",
      "There are no requirements that constrain the design and implementation of the APAF software.",
      "The CCTNS system should be designed in manner that operational data is not lost in case of any failure of equipment or communication network.",
      "Ancillary monitor data including system health, error messages and configuration echoes will be spooled such that temporary loss of network communication with the VLA Expansion Project Monitor and Control System network will not result in loss of monitor data.",
      "In addition, the APAF Operations Procedures Document shall provide installation and operations procedures of the APAF system in enough detail where there are no training-related requirements for users and operators of the APAF data system."
    ]
  },
  {
    "text": "This is the Software Requirements Specification (SRS) for the \"Space Fractions\" system.",
    "id": [
      3,
      195,
      1150,
      207,
      165,
      263,
      172,
      6,
      672,
      121
    ],
    "example": [
      "The DigitalHome Software Requirements Specification (SRS) is based on the DigitalHome Customer Need Statement.",
      "The SRS will include the details of the system's requirements, interface, design issues, and components.",
      "This Software Requirements Specification (SRS) provides the requirements for the Center-to-Center (C2C) Communications Network that is based on a Texas Department of Transportation (TxDOT) C2C project.",
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document.",
      "The APAF data system requirements for delivering the ASPERA-3 IDFS data, Mars Express Orbit/Attitude IDFS data, and software are described in the following table.",
      "The following table summarizes the external interface requirements for the Space Fractions system.",
      "ASPERA-3 data shall be provided to NASA PDS in PDS-compliant form.",
      "Hence, the SRS is not intended as a comprehensive or complete specification of DigitalHome requirements.",
      "This TACTICAL CONTROL SYSTEM (TCS) - SYSTEM / SUBSYSTEM SPECIFICATION (SSS) - VERSION 1.0 identifies, specifies, and establishes the detailed system requirements for the Tactical control system as set forth by the OPERATIONAL REQUIREMENTS DOCUMENT FOR THE UNMANNED AERIAL VEHICLE (UAV) TACTICAL CONTROL SYSTEM (TCS) - VERSION 5.0.",
      "These data products will be put into a form known as the Instrument Data File Set (IDFS)."
    ]
  },
  {
    "text": "Bobby particularly likes to play systems where Bobby can excel.",
    "id": [
      218,
      258,
      217,
      253,
      219,
      247,
      220,
      305,
      216,
      280
    ],
    "example": [
      "Bobby enjoys playing competitive sports and using computers, especially to play systems.",
      "This gives Bobby the competition he requires and allows Alice to have a unique experience the next time through the program.",
      "Bobby is a sixth grade male student learning fractions who is very competitive.",
      "Bobby will be captivated by the storyline and will wish to progress as fast as possible.",
      "Bobby has used computers since age five.",
      "The information and interface will be effective so that Bobby will easily recognize what to do to start the system immediately and Alice will have no problems navigating through the help section to understand the rules and systemplay.",
      "Bobby is only somewhat interested in learning about fractions.",
      "This simple, intuitive input method ensures that players of all ages and skill levels can easily make their selection without confusion or frustration.",
      "However, Alice is really interested in learning fractions and enjoys working with other students.",
      "This menu aims to equip players with the necessary knowledge to start playing and offer additional learning resources, thereby enriching the overall game experience."
    ]
  },
  {
    "text": "The Space Fractions system will not be dependent on any other software and is not a component of another program.",
    "id": [
      228,
      150,
      183,
      188,
      186,
      1093,
      185,
      191,
      648,
      1091
    ],
    "example": [
      "The Space Fractions system does not require any new hardware.",
      "There are no security requirements associated with the APAF ground data system.",
      "There are no installation-dependent requirements for the operation of the APAF data system.",
      "There are no requirements that constrain the design and implementation of the APAF software.",
      "Although the APAF data system and associated software will be developed with the highest quality possible, there are no requirements concerned with software quality.",
      "Training software shall be alterable without affecting the configuration of the operational software.",
      "Therefore, there are no safety requirements of the APAF ground data system.",
      "Since the members of the SwRI software team are experienced with data system and IDFS processing software development, there are no training-related requirements for developers of the APAF data system.",
      "Seamlessness shall be accomplished in a manner that is seamless, in that it does not affect hardware modules or software functionality that it meets at interfaces.",
      "The Tactical Control System software shall be non-proprietary and have unlimited data rights."
    ]
  },
  {
    "text": "The purpose of the Space Fractions system is to process player inputs during gameplay, specifically for calculating spaceship velocity adjustments based on fraction inputs. ",
    "id": [
      267,
      269,
      265,
      270,
      287,
      232,
      237,
      235,
      241,
      322
    ],
    "example": [
      "If the input is valid, the Space Fractions system calculates the velocity adjustment by converting the fraction into a decimal value and applying it to the spaceship's current velocity.",
      "The output of this process is the adjusted velocity of the spaceship, represented as a decimal value.",
      "The inputs will consist of fractions entered by the player using the game's interface. ",
      "The output timing is immediate, ensuring responsive gameplay. The range of output values is determined by the game's physics rules and the maximum and minimum velocity constraints set within the Space Fractions system.",
      "If the player opts to start the Space Fractions system, the system transitions to the game sequence, where gameplay begins immediately. ",
      "The Space Fractions system will have a series of fraction questions (testing arithmetic, equivalence, graphical interpretation, and improper versus proper fraction skills) that sequentially form a storyline related to the introduction.",
      "The user's score must be kept as local data within the Space Fractions system so that the results may be given at the end of the Space Fractions system.",
      "The administrator of the Space Fractions system may wish to design a custom system complete with custom fraction questions.",
      "Upon starting the Space Fractions system, the user is taken through a brief introductory movie to provide background story and information that will help them complete the fraction questions.",
      "This file contains the updated question data, structured in a format that the system sequence can dynamically read and incorporate into the gameplay."
    ]
  },
  {
    "text": "The source of these inputs is the player's interaction with the game's user interface during specific gameplay moments that require velocity adjustment.",
    "id": [
      254,
      289,
      265,
      284,
      300,
      282,
      288,
      286,
      304,
      486
    ],
    "example": [
      "The systemplay will be dynamic and adaptive to provide different storylines based on the user's progress.",
      "This dual-path output allows for a customized experience that caters to the player's immediate preference, whether it be diving into the game or seeking additional information and resources.",
      "The inputs will consist of fractions entered by the player using the game's interface. ",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page.",
      "Additionally, the sequence customizes the storyline's progression based on the player's performance at critical junctures, offering a dynamic and personalized gaming experience.",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "Alternatively, if the player selects the option to visit the Denominators' web page, the system facilitates this redirection, opening the web page either within the game environment or in a separate browser window, depending on the game's design and platform capabilities.",
      "The output of interacting with the main menu is determined by the player's choice.",
      "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
      "User adaptation can also be important for making the user interface more accessible."
    ]
  },
  {
    "text": "Upon receiving the fraction inputs, the Space Fractions system will validate the integrity and format of the data to ensure they are integers and that the denominator is not zero.",
    "id": [
      266,
      237,
      267,
      607,
      595,
      126,
      572,
      320,
      623,
      137
    ],
    "example": [
      "These inputs will be in the form of two integers representing the numerator and denominator of a fraction. ",
      "The user's score must be kept as local data within the Space Fractions system so that the results may be given at the end of the Space Fractions system.",
      "If the input is valid, the Space Fractions system calculates the velocity adjustment by converting the fraction into a decimal value and applying it to the spaceship's current velocity.",
      "The CMIB shall be able to read back the contents of all writeable hardware control registers where meaningful.",
      "It is assumed that the Correlator will receive configuration data in a format that is unambiguous and results in a convergent hardware configuration.",
      "Each of the physical components will be divided into logical groups (called virtual instruments) in which each logical group will be formatted as an IDFS data set.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
      "This step is crucial for maintaining the quality and integrity of the system content. Once the data passes the validation process, the update for that specific question is finalized.",
      "The Correlator Monitor and Control System processors shall be capable of meeting all data processing deadlines and anticipated future requirements The Correlator Monitor and Control System processors shall be capable of responding to correlator hardware inputs in a deterministic fashion with sufficient performance to avoid data loss, corruption or overflows.",
      "The APAF system shall process the engineering and ancillary information necessary for calibration and science validation into IDFS data sets."
    ]
  },
  {
    "text": "This adjusted velocity is applied to the game's physics engine to update the spaceship's speed in real-time.",
    "id": [
      269,
      270,
      267,
      254,
      300,
      230,
      287,
      322,
      323,
      291
    ],
    "example": [
      "The output of this process is the adjusted velocity of the spaceship, represented as a decimal value.",
      "The output timing is immediate, ensuring responsive gameplay. The range of output values is determined by the game's physics rules and the maximum and minimum velocity constraints set within the Space Fractions system.",
      "If the input is valid, the Space Fractions system calculates the velocity adjustment by converting the fraction into a decimal value and applying it to the spaceship's current velocity.",
      "The systemplay will be dynamic and adaptive to provide different storylines based on the user's progress.",
      "Additionally, the sequence customizes the storyline's progression based on the player's performance at critical junctures, offering a dynamic and personalized gaming experience.",
      "The Space Fractions system will have an introductory movie to set up the storyline.",
      "If the player opts to start the Space Fractions system, the system transitions to the game sequence, where gameplay begins immediately. ",
      "This file contains the updated question data, structured in a format that the system sequence can dynamically read and incorporate into the gameplay.",
      "This system allows for real-time updates to the game's content without the need for system restarts or interruptions, enabling a seamless integration of new or revised educational material into the game sequence.",
      "This sequence is designed to challenge and educate players on fractions while advancing the plot, thereby keeping the educational content engaging and contextually relevant."
    ]
  },
  {
    "text": "The introductory movie serves to immerse players into the game's universe, setting the stage for the storyline and providing critical information to assist users in solving fraction-related puzzles.",
    "id": [
      241,
      291,
      230,
      297,
      273,
      298,
      299,
      278,
      290,
      272
    ],
    "example": [
      "Upon starting the Space Fractions system, the user is taken through a brief introductory movie to provide background story and information that will help them complete the fraction questions.",
      "This sequence is designed to challenge and educate players on fractions while advancing the plot, thereby keeping the educational content engaging and contextually relevant.",
      "The Space Fractions system will have an introductory movie to set up the storyline.",
      "The system sequence includes \"critical points\" where the storyline can diverge based on whether the player answers these pivotal questions correctly, adding an element of narrative depth and personalization to the gameplay experience.",
      "This action allows players the option to skip the introductory movie at any point, facilitating a direct transition to the main menu of the game for those who prefer to dive straight into gameplay or who are revisiting the game and already familiar with its storyline.",
      "After completing a predetermined set of questions, the player is directed to the concluding scene of the game, providing closure to the educational journey.",
      "The output from this component consists of plot-based questions that incorporate fractions, tailored to both challenge the player's mathematical skills and advance the game's narrative.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "The primary function of the system sequence is to engage players with a series of multiple-choice questions focused on fractions. These questions are integrated within a storyline that naturally follows the introductory narrative of the game.",
      "This engaging start is designed to enhance understanding and interest in the game's educational objectives."
    ]
  },
  {
    "text": "The primary input for this component is the user's interaction in the form of a mouse click. ",
    "id": [
      238,
      281,
      304,
      457,
      436,
      274,
      445,
      486,
      251,
      283
    ],
    "example": [
      "Input will consist entirely of mouse clicks for the user to choose answer options and to set preferences.",
      "Players interact with the main menu through mouse clicks on specific buttons.",
      "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
      "Typical action types in user interfaces include manipulating application data, performing searches, communication actions, such as opening a new e-mail window or starting a chat function, and presentation-related actions, such as sorting a list of search results.",
      "The ability to choose between different input devices for activating controls such as links, fields and buttons is important both for users who prefer a certain input mode, mobile users and users with disabilities.",
      "The system continuously listens for a mouse click event during the playback.",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "User adaptation can also be important for making the user interface more accessible.",
      "The user will be given a problem and then must click the correct solution.",
      "The system remains in a passive listening state until an input is received in the form of a mouse click on one of the menu options."
    ]
  },
  {
    "text": "As soon as the player enters the introductory movie component, the movie begins to play automatically.",
    "id": [
      287,
      275,
      278,
      273,
      241,
      284,
      265,
      312,
      276,
      246
    ],
    "example": [
      "If the player opts to start the Space Fractions system, the system transitions to the game sequence, where gameplay begins immediately. ",
      "If a click is detected, the movie is immediately terminated, and the system transitions the user to the game's main menu, bypassing the rest of the movie. If no click is registered, the movie plays in its entirety, after which the Space Fractions system automatically proceeds to the main menu.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "This action allows players the option to skip the introductory movie at any point, facilitating a direct transition to the main menu of the game for those who prefer to dive straight into gameplay or who are revisiting the game and already familiar with its storyline.",
      "Upon starting the Space Fractions system, the user is taken through a brief introductory movie to provide background story and information that will help them complete the fraction questions.",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page.",
      "The inputs will consist of fractions entered by the player using the game's interface. ",
      "Furthermore, this component offers a clear and direct pathway for the player to either revisit the game's content through the main menu or gracefully exit the game, thereby closing their current session.",
      "This process ensures a seamless experience, whether the player chooses to watch the movie or skip it.",
      "To start the Space Fractions system, the user will click on the corresponding button."
    ]
  },
  {
    "text": "If the movie is skipped or once it concludes, the subsequent output is the transition to the game's main menu, where players can start their adventure or access various game settings.",
    "id": [
      273,
      306,
      312,
      278,
      304,
      275,
      286,
      288,
      284,
      287
    ],
    "example": [
      "This action allows players the option to skip the introductory movie at any point, facilitating a direct transition to the main menu of the game for those who prefer to dive straight into gameplay or who are revisiting the game and already familiar with its storyline.",
      "Upon reaching the ending scene, the system momentarily pauses to allow the player to make their choice between continuing their exploration of the game's content by returning to the main menu or concluding their session by exiting the game.",
      "Furthermore, this component offers a clear and direct pathway for the player to either revisit the game's content through the main menu or gracefully exit the game, thereby closing their current session.",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
      "If a click is detected, the movie is immediately terminated, and the system transitions the user to the game's main menu, bypassing the rest of the movie. If no click is registered, the movie plays in its entirety, after which the Space Fractions system automatically proceeds to the main menu.",
      "The output of interacting with the main menu is determined by the player's choice.",
      "Alternatively, if the player selects the option to visit the Denominators' web page, the system facilitates this redirection, opening the web page either within the game environment or in a separate browser window, depending on the game's design and platform capabilities.",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page.",
      "If the player opts to start the Space Fractions system, the system transitions to the game sequence, where gameplay begins immediately. "
    ]
  },
  {
    "text": "One button initiates the game, leading players directly into the gameplay experience.",
    "id": [
      278,
      287,
      281,
      246,
      284,
      286,
      295,
      282,
      304,
      265
    ],
    "example": [
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "If the player opts to start the Space Fractions system, the system transitions to the game sequence, where gameplay begins immediately. ",
      "Players interact with the main menu through mouse clicks on specific buttons.",
      "To start the Space Fractions system, the user will click on the corresponding button.",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page.",
      "The output of interacting with the main menu is determined by the player's choice.",
      "If the player selects the correct answer, a confirmation message is displayed, and the component transitions to the next question, maintaining engagement and providing positive reinforcement.",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
      "The inputs will consist of fractions entered by the player using the game's interface. "
    ]
  },
  {
    "text": "Additionally, it presents players with the option to either conclude their current session or navigate back to the main menu for further exploration or replay.",
    "id": [
      312,
      306,
      304,
      278,
      273,
      288,
      284,
      286,
      282,
      289
    ],
    "example": [
      "Furthermore, this component offers a clear and direct pathway for the player to either revisit the game's content through the main menu or gracefully exit the game, thereby closing their current session.",
      "Upon reaching the ending scene, the system momentarily pauses to allow the player to make their choice between continuing their exploration of the game's content by returning to the main menu or concluding their session by exiting the game.",
      "Player interaction with the ending scene is facilitated through mouse clicks, allowing them to choose between exiting the system or returning to the main menu. ",
      "The main menu is designed to serve as the initial interface that players interact with upon starting the game or returning to it after a session. ",
      "This action allows players the option to skip the introductory movie at any point, facilitating a direct transition to the main menu of the game for those who prefer to dive straight into gameplay or who are revisiting the game and already familiar with its storyline.",
      "Alternatively, if the player selects the option to visit the Denominators' web page, the system facilitates this redirection, opening the web page either within the game environment or in a separate browser window, depending on the game's design and platform capabilities.",
      "Depending on the player's choice, the system then executes one of two actions: either initiating the game sequence or redirecting the player to the Denominators' web page.",
      "The output of interacting with the main menu is determined by the player's choice.",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "This dual-path output allows for a customized experience that caters to the player's immediate preference, whether it be diving into the game or seeking additional information and resources."
    ]
  },
  {
    "text": "The Math Umbrella component is designed to serve as an educational resource hub within the system, providing players with easy access to a curated selection of external S2S projects that are specifically tailored to sixth graders. ",
    "id": [
      332,
      325,
      279,
      324,
      229,
      196,
      314,
      327,
      280,
      331
    ],
    "example": [
      "This functionality facilitates a seamless integration of supplemental educational resources, ensuring that players have the opportunity to engage with a broader range of topics and materials at their own pace.",
      "Players interact with the Math Umbrella through a series of links.",
      "It offers a concise help section that guides players on how to engage with the game effectively and also includes links to both the primary game component and an external educational resource, the Denominators' web page.",
      "These projects are organized by mathematical topics, such as fractions, to complement and enhance the learning experience within the game. ",
      "The umbrella will be a singular component, providing links to projects relating to fractions, decimals, and percents in a format accessible over the World Wide Web.",
      "The Space Fractions system is a learning tool created to help improve fraction-solving skills for sixth-grade students.",
      "Its primary function is to facilitate the updating and editing of questions within the system sequence, ensuring that the game's educational content remains current, accurate, and engaging for players. By providing an easy-to-use interface for content modification, this tool supports the game's adaptability and longevity in educational settings.",
      "Each link corresponds to a different S2S project, allowing players to choose which external resources they wish to explore based on their interests or areas where they seek further understanding.",
      "This menu aims to equip players with the necessary knowledge to start playing and offer additional learning resources, thereby enriching the overall game experience.",
      "The chosen S2S project is opened in a separate window, allowing the player to explore the additional mathematical content without leaving or closing the Space Fractions system."
    ]
  },
  {
    "text": "This component aims to extend the educational value of the system by integrating additional, topic-relevant resources that support and deepen the player's understanding of mathematics.",
    "id": [
      324,
      332,
      314,
      272,
      280,
      279,
      291,
      196,
      325,
      282
    ],
    "example": [
      "These projects are organized by mathematical topics, such as fractions, to complement and enhance the learning experience within the game. ",
      "This functionality facilitates a seamless integration of supplemental educational resources, ensuring that players have the opportunity to engage with a broader range of topics and materials at their own pace.",
      "Its primary function is to facilitate the updating and editing of questions within the system sequence, ensuring that the game's educational content remains current, accurate, and engaging for players. By providing an easy-to-use interface for content modification, this tool supports the game's adaptability and longevity in educational settings.",
      "This engaging start is designed to enhance understanding and interest in the game's educational objectives.",
      "This menu aims to equip players with the necessary knowledge to start playing and offer additional learning resources, thereby enriching the overall game experience.",
      "It offers a concise help section that guides players on how to engage with the game effectively and also includes links to both the primary game component and an external educational resource, the Denominators' web page.",
      "This sequence is designed to challenge and educate players on fractions while advancing the plot, thereby keeping the educational content engaging and contextually relevant.",
      "The Space Fractions system is a learning tool created to help improve fraction-solving skills for sixth-grade students.",
      "Players interact with the Math Umbrella through a series of links.",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements."
    ]
  },
  {
    "text": "Reliability will be ensured by extensive testing by the team members and mentors, if available.",
    "id": [
      585,
      584,
      161,
      587,
      539,
      545,
      535,
      673,
      731,
      1250
    ],
    "example": [
      "These individuals will be responsible for performing corrective and preventive maintenance along with periodic performance tests and upgrades.",
      "The ability of the Correlator System to achieve and maintain high reliability and uptime will be vitally dependent upon reliable operation and rapid diagnosis and repair of faults in the hardware and software systems.",
      "The SwRI software team shall provide system maintenance and software support.",
      "These individuals are responsible for developing the software and will interact with the EVLA Correlator Monitor and Control System to ensure that it is functioning properly.",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "The CCTNS system should ensure high scalability and performance through displaying of records on the screen in batches/paged manner. ",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries.",
      "The SSS further specifies the methods to be used to ensure that each requirement has been met.",
      "Tasks will be evaluated and allocated based on operator skills and proficiencies.",
      "The Center-to-Center shall be able to operate in test mode."
    ]
  },
  {
    "text": "There are no additional requirements at this time.",
    "id": [
      193,
      498,
      181,
      183,
      188,
      189,
      1123,
      228,
      192,
      1065
    ],
    "example": [
      "There are no requirements of the APAF data system that need special treatment or consideration at this time.",
      "Unplanned downtime for the CCTNS system must not exceed <xx hours/minutes> per <rolling three month period>.",
      "This section identifies the requirements considered but not part of the APAF ground data system requirements.",
      "There are no installation-dependent requirements for the operation of the APAF data system.",
      "There are no requirements that constrain the design and implementation of the APAF software.",
      "There are no identified requirements related to personnel that will use the software.",
      "The shall provide the functionality to have a maximum delay time of 1 second from operator command to system acknowledgement and response.[SSS 559] ",
      "The Space Fractions system does not require any new hardware.",
      "In addition, the APAF Operations Procedures Document shall provide installation and operations procedures of the APAF system in enough detail where there are no training-related requirements for users and operators of the APAF data system.",
      "This section not applicable, therefore tailored out."
    ]
  },
  {
    "text": "FUNCTIONAL REQUIREMENTS SPECIFICATION V1.0 (DRAFT) ",
    "id": [
      206,
      60,
      416,
      207,
      1073,
      418,
      672,
      551,
      419,
      346
    ],
    "example": [
      "Section three is a detailed requirements specification targeted toward technical designers.",
      "This section provides a description of the functional requirements.",
      "Application user interfaces to meet its requirements and recommendations.",
      "Specific requirements and expectations regarding the components of the product are given in this portion of the SRS document.",
      "The Tactical Control System shall conform with the National Institute for Standard Technology (NIST) Federal Information Processing Standard (FIPS) Publication 151-2 (POSIX.1).",
      "User interfaces should meet its requirements and recommendations.",
      "This TACTICAL CONTROL SYSTEM (TCS) - SYSTEM / SUBSYSTEM SPECIFICATION (SSS) - VERSION 1.0 identifies, specifies, and establishes the detailed system requirements for the Tactical control system as set forth by the OPERATIONAL REQUIREMENTS DOCUMENT FOR THE UNMANNED AERIAL VEHICLE (UAV) TACTICAL CONTROL SYSTEM (TCS) - VERSION 5.0.",
      "The primary goal of this document is to provide a complete and accurate list of requirements for the VLA Expansion Project Correlator Monitor and Control System.",
      "Content accessibility WCAG 1.0 shall be the standard used for guidance on content accessibility.",
      "The Functional Requirements Specifications (FRS) report provides the detailed description of the functionalities required for the first version of the CCTNS."
    ]
  },
  {
    "text": "The key guiding principle behind the functional design of CCTNS V1.0 is to focus on the critical functionality that provides value to the police personnel at the cutting edge which in turn can improve the outcomes in the areas of “Investigation of Crime” and “Detection of Criminals”.",
    "id": [
      348,
      347,
      364,
      517,
      356,
      526,
      523,
      350,
      536,
      542
    ],
    "example": [
      "The functionality of the CCTNS application is focused on providing value to the police personnel, especially the officers operating at the cutting edge and easing the day to day operations of the police function.",
      "CCTNS V1.0 functionality is designed to focus on delivering value to IOs, records room staff and citizens within the broad crime investigation area.",
      "It shows information such as cases assigned, alerts, pending tasks etc hence helping police personnel to plan better and execute with greater efficiency.",
      "The CCTNS system should be designed to have satisfactory performance even in Police Stations connected on low-bandwidth ",
      "The Search module of the CCTNS gives police personnel the ability to execute a basic or advanced search on cases.",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "The Registration module acts as an interface between the police and citizens and it eases the approach, interaction and information exchange between police and complainants.",
      "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs.",
      "The CCTNS system should ensure high scalability and performance through using of AJAX based technology to improve user experience."
    ]
  },
  {
    "text": "Based on the guiding principles stated above, nine different function blocks have been identified and the detailed functionality of each block was determined.",
    "id": [
      4,
      147,
      149,
      1164,
      1165,
      127,
      38,
      478,
      60,
      367
    ],
    "example": [
      "It is made up of a list of the principal features of the system.",
      "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the internal interfaces.",
      "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the virtual instrument data items.",
      "The following sections define the requirements for the Center-to-Center project.",
      "Requirements are listed in separate sections and in table format for each functional area.",
      "Each of the seven components described above will have an associated Software Design Document (SDD) that will define and fully describe all of the data products contained within each individual virtual instrument.",
      "To make marketing and development decisions, the following sections describe operational environment concerns and constraints.",
      "Guidance on selecting and using different forms of interaction techniques is to be found in ISO 9241-14 to ISO 9241-17.",
      "This section provides a description of the functional requirements.",
      "The functional requirements for each of the modules are provided as A1 to A7 in separate enclosures."
    ]
  },
  {
    "text": "It makes reporting easy for police by enabling them to execute different types of queries such as monthly reporting, RTI related etc.",
    "id": [
      364,
      348,
      360,
      294,
      350,
      356,
      361,
      408,
      454,
      317
    ],
    "example": [
      "It shows information such as cases assigned, alerts, pending tasks etc hence helping police personnel to plan better and execute with greater efficiency.",
      "The functionality of the CCTNS application is focused on providing value to the police personnel, especially the officers operating at the cutting edge and easing the day to day operations of the police function.",
      "Citizens can use it as a tool to get information or acknowledgements from police.",
      "This method ensures a straightforward and accessible approach for users to demonstrate their understanding and apply their knowledge of fractions.",
      "The Registration module acts as an interface between the police and citizens and it eases the approach, interaction and information exchange between police and complainants.",
      "The Search module of the CCTNS gives police personnel the ability to execute a basic or advanced search on cases.",
      "The police in turn can use it to respond to citizens with very little turnaround time.",
      "The CCTNS system must provide End User and Administrator functions which are easy to use and intuitive throughout.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "Each question is managed on a separate page within the tool, and navigation between questions is streamlined through the use of a button to progress from one question to the next, ensuring a smooth and organized content update process."
    ]
  },
  {
    "text": "The CCTNS system must be able to capture and store violations (i.e.A user’s attempts to access a case to which he is denied access), and (where violations can validly be attempted) attempted violations, of access control mechanisms.",
    "id": [
      399,
      392,
      394,
      409,
      504,
      404,
      649,
      391,
      533,
      505
    ],
    "example": [
      "If the CCTNS system allows users to make unauthorised attempts to access cases, it must log these in the audit trail.",
      "The CCTNS system must allow the user to limit access to cases to specified users or user groups.",
      "The CCTNS system should allow a user to stipulate which other users or groups can access cases.",
      "The CCTNS system must allow persistent defaults for data entry where desirable.",
      "The CCTNS system must be able to retrieve and display within 5-8 seconds the case which has been accessed within the previous 2 months, regardless of storage capacity or number of cases in the CCTNS system.",
      "The CCTNS system must be able to display several entities (cases, suspects) simultaneously.",
      "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access.",
      "The requirements specify the requirements to control the user access to correspondences, files, and records and various functionalities provided within the CCTNS system.",
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting.",
      "The CCTNS system must be able to retrieve and display within 20 seconds the case which has not been accessed within the previous 2 months, regardless of storage capacity or number of cases in the CCTNS system."
    ]
  },
  {
    "text": "The CCTNS system should provide for role-based control for the functionality within the CCTNS system ",
    "id": [
      521,
      526,
      523,
      414,
      391,
      411,
      389,
      529,
      536,
      495
    ],
    "example": [
      "The CCTNS system should be developed for a centralized deployment and maintenance ",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "The user interfaces of the CCTNS system should comply with Standard ISO 9241.",
      "The requirements specify the requirements to control the user access to correspondences, files, and records and various functionalities provided within the CCTNS system.",
      "Where the CCTNS system employs a graphical user interface, it must allow users to customise it.",
      "The CCTNS system should be able to provide reports for actions on cases organised by workstation and (where technically appropriate) by network address.",
      "The CCTNS system should support secure virtual private network connections ",
      "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs.",
      "The user interfaces of the CCTNS system should follow the guidelines specified under www.usability.gov "
    ]
  },
  {
    "text": "The CCTNS system must allow only admin-users to set up user profiles and allocate users to groups.",
    "id": [
      395,
      520,
      524,
      392,
      154,
      393,
      394,
      650,
      403,
      409
    ],
    "example": [
      "The CCTNS system must allow changes to security attributes for groups or users (such as access rights, security level, privileges, password allocation and management) to be made only by super-user.",
      "The CCTNS system should be built on a common User Access and Authentication Service to ensure Single-Sign on for the end-user ",
      "The CCTNS system should be designed for access through browser-based systems and must impose minimal requirements on the client device ",
      "The CCTNS system must allow the user to limit access to cases to specified users or user groups.",
      "The APAF system web server shall be password protected where appropriate to allow only pertinent ASPERA-3 team members access.",
      "The CCTNS system must allow a user to be a member of more than one group.",
      "The CCTNS system should allow a user to stipulate which other users or groups can access cases.",
      "Authorized users are expected to be restricted to software and hardware development, testing, maintenance and operations personnel.",
      "The CCTNS system must employ a single set of user interface rules, or a small number of sets to provide a familiar and common look and feel for the application.",
      "The CCTNS system must allow persistent defaults for data entry where desirable."
    ]
  },
  {
    "text": "If a user performs a quick or advanced search, the CCTNS system must never include in the search result list any record which the user does not have the right to access.",
    "id": [
      396,
      653,
      399,
      392,
      379,
      1219,
      501,
      409,
      398,
      382
    ],
    "example": [
      "If a user requests access to, or searches for, a case which he does not have the right to access, the CCTNS system must provide one of the following responses (selectable at configuration time): display title and metadata;display the existence of a case but not its title or other metadata;do not display any case information or indicate its existence in any way.",
      "If a user cannot be identified, they will not be given access.",
      "If the CCTNS system allows users to make unauthorised attempts to access cases, it must log these in the audit trail.",
      "The CCTNS system must allow the user to limit access to cases to specified users or user groups.",
      "The CCTNS system must keep an unalterable audit trail capable of automatically capturing and storing information about the user initiating and or carrying out the action.",
      "The Incident GUI shall allow the user to enter incident or lane closure information without the use of an Center.",
      "The CCTNS system must be able to perform a simple search within 5-8 seconds and a advanced search (multiple search criteria) within 10-15 seconds regardless of the storage capacity or number of cases in the CCTNS system.",
      "The CCTNS system must allow persistent defaults for data entry where desirable.",
      "Note that the requirement in the third option (i.e.the most stringent) implies that the CCTNS system must not include such cases in any count of search results; this level of security is normally appropriate for cases dealing with matters such as national security.",
      "The word “unalterable” is to mean that the audit trail data cannot be modified in any way or deleted by any user."
    ]
  },
  {
    "text": "Frequently-executed System transactions must be designed so that they can be completed with a small number of interactions (e.g.mouse clicks).",
    "id": [
      18,
      559,
      377,
      457,
      371,
      408,
      1159,
      405,
      403,
      564
    ],
    "example": [
      "Although the general user is not familiar with the technical features of the DigitalHome system, he/she is familiar with the use of a web interface and can perform simple web operations (logging in and logging out, browsing web pages, and submitting information and requests via a web interface).",
      "The Correlator Monitor and Control System shall perform limited amounts of real-time data processing and probing such as providing tools to collect and display auto correlation products.",
      "This includes actions taken by users or Administrators, or actions initiated automatically by the CCTNS system as a result of system parameters.",
      "Typical action types in user interfaces include manipulating application data, performing searches, communication actions, such as opening a new e-mail window or starting a chat function, and presentation-related actions, such as sorting a list of search results.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The CCTNS system must provide End User and Administrator functions which are easy to use and intuitive throughout.",
      "These building blocks allow the software to be utilized in a number of configurations (by simply altering the configuration parameters of the software).",
      "The interfaces must be made customizable or user-configurable to the extent possible.(e.g., the displayed columns in the table, move, resize, modify the appearance).",
      "The CCTNS system must employ a single set of user interface rules, or a small number of sets to provide a familiar and common look and feel for the application.",
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors."
    ]
  },
  {
    "text": "Providing text equivalents for non-text media objects: All non-text media objects, such as graphical images or video, should be provided with alternative equivalent textual descriptions and/or with equivalent text-based functionality.",
    "id": [
      469,
      446,
      445,
      458,
      454,
      447,
      480,
      444,
      483,
      468
    ],
    "example": [
      "Providing alternative text-only pages: When style sheets and/or frames are turned off it should be possible for the user to read and understand the page; alternatively, the user should be provided with an equivalent alternative text-only page.",
      "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points.",
      "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e.",
      "Providing printable document versions: If a document is either too long, dispersed over several pages or in a specific layout that is not suitable for online reading, a printer-friendly version of the document should be provided that prints the content in a form acceptable to the user (e.g.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "Supporting text skimming: Fast skimming of text should be supported by the provision of clear links, bulleted lists, highlighted keywords, logical headings, and short phrases and sentences.",
      "Appropriate content presentation also plays a key role in accessibility.",
      "Using appropriate formats, units of measurement or currency: When designing user interfaces for use by diverse groups, input and output of information elements such as currency, units of measurement, temperatures, date and time, phone numbers, address or postal codes should be designed so that they are usable.",
      "Consistency between navigation components and content: If navigation components (or overviews) are shown in conjunction with associated content, consistency between the navigation component and the content shown should be maintained by indicating in the navigation component (e.g.",
      "Providing alternatives to frame-based presentation: If frames are used, an alternative way of presenting relevant information without frames should be provided."
    ]
  },
  {
    "text": "Acceptable opening / download times: Application pages should be designed and implemented so that there are acceptable opening times and download times for the expected range of technical contexts of use (e.g.",
    "id": [
      416,
      418,
      480,
      407,
      369,
      370,
      371,
      463,
      462,
      487
    ],
    "example": [
      "Application user interfaces to meet its requirements and recommendations.",
      "User interfaces should meet its requirements and recommendations.",
      "Appropriate content presentation also plays a key role in accessibility.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
      "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "Short pages are generally more appropriate for homepages, navigation pages, or overview pages that need to be read quickly.",
      "Selecting appropriate page lengths The length of a page should be selected so as to support the primary purpose and use of the page.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e."
    ]
  },
  {
    "text": "Providing clear error messages: The content of error messages shown on the pages or special error pages should clearly state the reason why the error occurred and, if possible, actions the user can take to resolve the error.",
    "id": [
      402,
      401,
      443,
      569,
      626,
      108,
      268,
      271,
      625,
      372
    ],
    "example": [
      "Ideally, each error message will be accompanied by explanatory text and an indication of the action(s) which the user can take in response to the error.",
      "All error messages produced by the CCTNS system must be meaningful, so that they can be appropriately acted upon by the users who are likely to see them.",
      "Users expect error messages to be in the same language as the user interface.",
      "Error and status messages will be provided in a concise time/location referenced format to upper system levels in a content controllable manner.",
      "Personnel interested in error messages should be able to easily filter the error message stream.",
      "All DigitalHome operations shall incorporate exception handling so that the system responds to a user with a clear, descriptive message when an error or an exceptional condition occurs.",
      "The processing includes error handling for invalid inputs, such as displaying an error message to the player and requesting a new input.",
      "In cases of invalid inputs, the output is an error message displayed on the user interface, guiding the player to provide a valid fraction.",
      "All system error and debug messages shall be categorized in a logical fashion such that message traffic can be filtered as to content, detail, and message rate.",
      "The solution should send alerts (e.g., email, SMS) to the user if the user chooses to whenever any action has been taken on the alert."
    ]
  },
  {
    "text": "Text quality: The quality of textual content with respect to spelling and grammar should be sufficient so as not to impede readability.",
    "id": [
      446,
      451,
      447,
      448,
      483,
      458,
      474,
      470,
      670,
      462
    ],
    "example": [
      "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points.",
      "Avoiding link overload: Text pages containing large proportions of links should be formatted so that the presence of links does not impede the readability of the text.",
      "Supporting text skimming: Fast skimming of text should be supported by the provision of clear links, bulleted lists, highlighted keywords, logical headings, and short phrases and sentences.",
      "ISO 9241-303 shall be consulted for screen text legibility requirements.",
      "Consistency between navigation components and content: If navigation components (or overviews) are shown in conjunction with associated content, consistency between the navigation component and the content shown should be maintained by indicating in the navigation component (e.g.",
      "Providing printable document versions: If a document is either too long, dispersed over several pages or in a specific layout that is not suitable for online reading, a printer-friendly version of the document should be provided that prints the content in a form acceptable to the user (e.g.",
      "Placing title information consistently: Page titles should be placed in a consistent location on the different pages.",
      "Consistent page layout: Pages should be designed using consistent layout schemes, supporting the user in finding similar information at the same position on different pages.",
      "Software shall be written in a style that is easily readable and using practices that allow for minimal confusion.",
      "Selecting appropriate page lengths The length of a page should be selected so as to support the primary purpose and use of the page."
    ]
  },
  {
    "text": "Readability of text: Text presented on the pages should be readable taking into account the expected display characteristics and spatial arrangement.",
    "id": [
      446,
      462,
      470,
      474,
      480,
      447,
      448,
      464,
      458,
      454
    ],
    "example": [
      "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points.",
      "Selecting appropriate page lengths The length of a page should be selected so as to support the primary purpose and use of the page.",
      "Consistent page layout: Pages should be designed using consistent layout schemes, supporting the user in finding similar information at the same position on different pages.",
      "Placing title information consistently: Page titles should be placed in a consistent location on the different pages.",
      "Appropriate content presentation also plays a key role in accessibility.",
      "Supporting text skimming: Fast skimming of text should be supported by the provision of clear links, bulleted lists, highlighted keywords, logical headings, and short phrases and sentences.",
      "ISO 9241-303 shall be consulted for screen text legibility requirements.",
      "Longer pages can be more appropriate when users want to read the content without interruptions or when the page needs to match a paper counterpart.",
      "Providing printable document versions: If a document is either too long, dispersed over several pages or in a specific layout that is not suitable for online reading, a printer-friendly version of the document should be provided that prints the content in a form acceptable to the user (e.g.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand."
    ]
  },
  {
    "text": "Use of “white space”: “White space” on a page i.e.",
    "id": [
      461,
      460,
      459,
      450,
      915,
      462,
      1216,
      441,
      473,
      1097
    ],
    "example": [
      "While white space is an important means of visually organizing the different content elements on a page, if the distance between the blocks of information displayed becomes too large, rapid skimming of the page can be impeded.",
      "space filled only with the background color should be used in such a way that it does not impair the visual skimming of the page.",
      "in the expected layout, paper format, or orientation).",
      "Within-page links are shown with dashed rather than solid underlines ",
      "Annotation includes operator generated comments as well as graphics which are superimposed on the imagery.",
      "Selecting appropriate page lengths The length of a page should be selected so as to support the primary purpose and use of the page.",
      "The map shall be capable of displaying the following for a DMS.",
      "This is particularly important for frequently accessed pages or pages that are important for user navigation and exploration, such as the home page.",
      "In such cases, pages can usually be grouped in different categories, using one layout scheme for each category consistently.",
      "Each control console shall have a display windows that provides the aircraft position, Tactical Control System position, flight path, and waypoint graphics in the foreground, which are positioned in relation to a map displayed in the background."
    ]
  },
  {
    "text": "Color should never be the only means of coding.",
    "id": [
      465,
      1107,
      460,
      491,
      434,
      456,
      467,
      1212,
      444,
      1106
    ],
    "example": [
      "Using colour: Colour should be used with care, taking into account human capabilities and restrictions in perceiving colour, and not as the only means of conveying information.",
      "The color codes and flash frequencies will follow MIL-STD 1472 guidelines.",
      "space filled only with the background color should be used in such a way that it does not impair the visual skimming of the page.",
      "Making individualization and adaptation evident: It should be made evident to the user when individualization and/or adaptation are used.",
      "Horizontal scrolling should be avoided wherever possible.",
      "Distinguishing navigation links from controls: Navigation links should be clearly distinguishable from controls activating some action.",
      "When frames are used, it is important to title each frame, and to describe its purpose and how frames relate to one another other.",
      "Each link displayed on the map shall be color coded to provide a graphical depiction of speeds.",
      "Using appropriate formats, units of measurement or currency: When designing user interfaces for use by diverse groups, input and output of information elements such as currency, units of measurement, temperatures, date and time, phone numbers, address or postal codes should be designed so that they are usable.",
      "Tactical Control System Warning messages shall be color coded and flashed based on mission criticality."
    ]
  },
  {
    "text": "Some users may have difficulties in perceiving certain colors or color combinations (color-blindness).",
    "id": [
      431,
      429,
      465,
      436,
      488,
      487,
      110,
      655,
      268,
      466
    ],
    "example": [
      "They could make it cognitively more difficult to understand the navigation structure with negative effects on both usability and accessibility.",
      "Opening new windows can distract, confuse or impede users for a variety of reasons.",
      "Using colour: Colour should be used with care, taking into account human capabilities and restrictions in perceiving colour, and not as the only means of conveying information.",
      "The ability to choose between different input devices for activating controls such as links, fields and buttons is important both for users who prefer a certain input mode, mobile users and users with disabilities.",
      "individualization designing content and navigation differently for varying user groups or roles i.e.",
      "Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e.",
      "Such failures might affect the safety of home dwellers (e.g., security breaches, inadequate lighting in dark spaces, inappropriate temperature and humidity for people who are in ill-health, or powering certain appliances when young children are present).",
      "Users’ needs and expectations from the EVLA Correlator Monitor and Control System will be different.",
      "The processing includes error handling for invalid inputs, such as displaying an error message to the player and requesting a new input.",
      "Using frames with care: If frames are used, care should be taken to avoid possible problems, for example, those involving the use of the back button, bookmarking of pages, or scrolling of information."
    ]
  },
  {
    "text": "In addition, when designing multimedia information presentations, the design principles and recommendations described in ISO 14915-1 to ISO 14915-3 should be taken into account.",
    "id": [
      477,
      418,
      478,
      475,
      479,
      203,
      448,
      444,
      416,
      422
    ],
    "example": [
      "Practical guidelines for presenting information to the user are to be found in ISO 9241-12.",
      "User interfaces should meet its requirements and recommendations.",
      "Guidance on selecting and using different forms of interaction techniques is to be found in ISO 9241-14 to ISO 9241-17.",
      "Observing principles of human perception When designing application pages, the general principles of human perception should be taken into account.",
      "ISO 9241-14 gives guidance about menus, ISO 9241-15 about command dialogues, ISO 9241-16 about direct manipulation and ISO 9241-17 about forms.",
      "The definitions section is intended to assist the technical designers as well as the client in clarifying the terms used throughout the document.",
      "ISO 9241-303 shall be consulted for screen text legibility requirements.",
      "Using appropriate formats, units of measurement or currency: When designing user interfaces for use by diverse groups, input and output of information elements such as currency, units of measurement, temperatures, date and time, phone numbers, address or postal codes should be designed so that they are usable.",
      "Application user interfaces to meet its requirements and recommendations.",
      "General guidance on achieving self-descriptiveness is given in ISO 9241-110."
    ]
  },
  {
    "text": "highlighting) the topic currently visible in the content area.",
    "id": [
      433,
      472,
      480,
      462,
      249,
      282,
      441,
      446,
      423,
      454
    ],
    "example": [
      "This may be done by placing important information at the top and providing links to information that is further down the page.",
      "Frequently, however, different pages have different purposes and types of content.",
      "Appropriate content presentation also plays a key role in accessibility.",
      "Selecting appropriate page lengths The length of a page should be selected so as to support the primary purpose and use of the page.",
      "Next, the user progresses through a series of questions in the form of cartoon images that comprise the main story.",
      "Another button or hyperlink connects players to the Denominators' web page, providing an opportunity to explore educational content or resources related to the game's thematic elements.",
      "This is particularly important for frequently accessed pages or pages that are important for user navigation and exploration, such as the home page.",
      "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points.",
      "Showing users where they are: Each presentation segment (page or window) should provide the user with a clear and sufficient indication of where he or she is in the navigation structure and of the current segment position with respect to the overall structure.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand."
    ]
  },
  {
    "text": "The planned downtime for the CCTNS system must not exceed <xx> hours per <rolling three month period>.",
    "id": [
      498,
      499,
      496,
      516,
      500,
      622,
      1144,
      540,
      507,
      1123
    ],
    "example": [
      "Unplanned downtime for the CCTNS system must not exceed <xx hours/minutes> per <rolling three month period>.",
      "In the event of any software or hardware failure, it must be possible to restore the CCTNS system (with inline synchronization) within no more than <xx> hours.",
      "The CCTNS system must be available to users: from <xx:00> to <xx:00>; on <all weekdays/xxx days per year>.",
      "The CCTNS system should be designed in manner that operational data is not lost in case of any failure of equipment or communication network.",
      "The CCTNS system must provide adequate response times for commonly performed functions under both standard and peak conditions ",
      "This requirement is to allow correlator power monitoring and control to continue in the event of an Monitor and Control System network failure.",
      "The Tactical Control System HCI shall provide continuously-available, on-screen control functions for time and missioncritical operations, to include as a minimum print, freeze, declassification, mark VCR, declutter, cease RF transmission.",
      "The CCTNS system should ensure high standards of security and access control through do not allow hard delete and perform only soft tagging the row for deletion.",
      "The CCTNS system be scaleable and must not have any features which would preclude use in small or large police stations, with varying numbers of cases handled.",
      "The shall provide the functionality to have a maximum delay time of 1 second from operator command to system acknowledgement and response.[SSS 559] "
    ]
  },
  {
    "text": "The number of incidents of unplanned downtime for the CCTNS system must not exceed <x> per <rolling three month period>.",
    "id": [
      498,
      499,
      496,
      500,
      409,
      507,
      505,
      101,
      389,
      504
    ],
    "example": [
      "Unplanned downtime for the CCTNS system must not exceed <xx hours/minutes> per <rolling three month period>.",
      "In the event of any software or hardware failure, it must be possible to restore the CCTNS system (with inline synchronization) within no more than <xx> hours.",
      "The CCTNS system must be available to users: from <xx:00> to <xx:00>; on <all weekdays/xxx days per year>.",
      "The CCTNS system must provide adequate response times for commonly performed functions under both standard and peak conditions ",
      "The CCTNS system must allow persistent defaults for data entry where desirable.",
      "The CCTNS system be scaleable and must not have any features which would preclude use in small or large police stations, with varying numbers of cases handled.",
      "The CCTNS system must be able to retrieve and display within 20 seconds the case which has not been accessed within the previous 2 months, regardless of storage capacity or number of cases in the CCTNS system.",
      "The month report shall provide a section that indicates the periods of time when the DigitalHome System was not in operation.",
      "The CCTNS system should be able to provide reports for actions on cases organised by workstation and (where technically appropriate) by network address.",
      "The CCTNS system must be able to retrieve and display within 5-8 seconds the case which has been accessed within the previous 2 months, regardless of storage capacity or number of cases in the CCTNS system."
    ]
  },
  {
    "text": "This requirement is intended to allow for rapid retrieval of frequently-used cases, on the understanding that frequency of use is typically correlated with recent use.",
    "id": [
      506,
      447,
      364,
      504,
      404,
      502,
      501,
      567,
      454,
      505
    ],
    "example": [
      "This requirement is intended to allow for cases where cases used infrequently are stored on slower media than more active records.",
      "Supporting text skimming: Fast skimming of text should be supported by the provision of clear links, bulleted lists, highlighted keywords, logical headings, and short phrases and sentences.",
      "It shows information such as cases assigned, alerts, pending tasks etc hence helping police personnel to plan better and execute with greater efficiency.",
      "The CCTNS system must be able to retrieve and display within 5-8 seconds the case which has been accessed within the previous 2 months, regardless of storage capacity or number of cases in the CCTNS system.",
      "The CCTNS system must be able to display several entities (cases, suspects) simultaneously.",
      "In this context, performing a search means returning a result list.",
      "The CCTNS system must be able to perform a simple search within 5-8 seconds and a advanced search (multiple search criteria) within 10-15 seconds regardless of the storage capacity or number of cases in the CCTNS system.",
      "Some of this information will be provided on a time synchronous basis as required by other systems and other information will only be presented on a request basis.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "The CCTNS system must be able to retrieve and display within 20 seconds the case which has not been accessed within the previous 2 months, regardless of storage capacity or number of cases in the CCTNS system."
    ]
  },
  {
    "text": "The CCTNS systems should be designed with the following broad guidelines: ",
    "id": [
      495,
      414,
      519,
      521,
      518,
      535,
      536,
      407,
      537,
      516
    ],
    "example": [
      "The user interfaces of the CCTNS system should follow the guidelines specified under www.usability.gov ",
      "The user interfaces of the CCTNS system should comply with Standard ISO 9241.",
      "The CCTNS system should be developed on Open Standards ",
      "The CCTNS system should be developed for a centralized deployment and maintenance ",
      "The CCTNS system should be implemented using Service Oriented Architecture (SOA) and have a modular design ",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries.",
      "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should be designed in manner that operational data is not lost in case of any failure of equipment or communication network."
    ]
  },
  {
    "text": "The CCTNS system should support multilingual interface ",
    "id": [
      523,
      526,
      527,
      520,
      407,
      528,
      525,
      531,
      532,
      408
    ],
    "example": [
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The CCTNS system should support multi-tier authentication where required ",
      "The CCTNS system should be built on a common User Access and Authentication Service to ensure Single-Sign on for the end-user ",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "The CCTNS system should support SSL encrypted connections ",
      "The CCTNS system must support multiple types of communication services for remote access ",
      "The CCTNS system should run on multiple browsers.",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system must provide End User and Administrator functions which are easy to use and intuitive throughout."
    ]
  },
  {
    "text": "The CCTNS system should work even in an offline mode with the critical functionality ",
    "id": [
      517,
      408,
      516,
      536,
      532,
      529,
      545,
      528,
      544,
      535
    ],
    "example": [
      "The CCTNS system should be designed to have satisfactory performance even in Police Stations connected on low-bandwidth ",
      "The CCTNS system must provide End User and Administrator functions which are easy to use and intuitive throughout.",
      "The CCTNS system should be designed in manner that operational data is not lost in case of any failure of equipment or communication network.",
      "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs.",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should support secure virtual private network connections ",
      "The CCTNS system should ensure high scalability and performance through displaying of records on the screen in batches/paged manner. ",
      "The CCTNS system should support SSL encrypted connections ",
      "The CCTNS system should ensure high scalability and performance through hosting all the static content (documents, images) on the web server.",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries."
    ]
  },
  {
    "text": "The CCTNS system should be developed to be deployed in a 3-tier datacenter architecture ",
    "id": [
      521,
      1161,
      523,
      518,
      522,
      1086,
      702,
      509,
      526,
      1227
    ],
    "example": [
      "The CCTNS system should be developed for a centralized deployment and maintenance ",
      "Systems will interface to the “cloud” using a project defined protocol.",
      "The CCTNS system should be extensible to provide access to the interfaces through PDA’s and mobile data terminals ",
      "The CCTNS system should be implemented using Service Oriented Architecture (SOA) and have a modular design ",
      "The CCTNS system should be designed to have a n-tier architecture with the presentation logic separated from the business logic that is again separated from the data-access logic ",
      "The Tactical Control System shall provide an open software architecture to be capable of supporting additional CSCIs, CSCs, and CSUs for future AVs, future payloads, and payload capabilities (e.g.",
      "The Tactical Control System integration with C4I systems will be accomplished through development of interfaces that permit information exchange between the Tactical Control System and specified C4I systems.",
      "The 3 C’s (Core-Configuration-Customization) forms the guiding principle for the architecture.",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The remote Center Control GUI shall be designed to execute on a public network (e.g., Internet) and transmit equipment requests to the C-2-C software system."
    ]
  },
  {
    "text": "The CCTNS system should adopt standardized formats and common metadata elements ",
    "id": [
      519,
      414,
      495,
      521,
      526,
      538,
      532,
      537,
      729,
      535
    ],
    "example": [
      "The CCTNS system should be developed on Open Standards ",
      "The user interfaces of the CCTNS system should comply with Standard ISO 9241.",
      "The user interfaces of the CCTNS system should follow the guidelines specified under www.usability.gov ",
      "The CCTNS system should be developed for a centralized deployment and maintenance ",
      "The CCTNS system should have capability to support public access to a subset of data and functionality ",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "Communications procedures, formats, and interfaces will be interoperable with selected standard DoD C4I systems, architectures, and protocols.",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries."
    ]
  },
  {
    "text": "The CCTNS system should support selective encryption of the stored data.",
    "id": [
      538,
      540,
      532,
      537,
      534,
      533,
      527,
      535,
      409,
      536
    ],
    "example": [
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through do not allow hard delete and perform only soft tagging the row for deletion.",
      "The CCTNS system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through preventing SQL Injection.",
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting.",
      "The CCTNS system should support multi-tier authentication where required ",
      "The CCTNS system should ensure high standards of security and access control through utilizing parameterized queries.",
      "The CCTNS system must allow persistent defaults for data entry where desirable.",
      "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs."
    ]
  },
  {
    "text": "The search results should be fetched from the database in batches of 10 or 20 maximum as configured within the application.",
    "id": [
      502,
      501,
      548,
      318,
      596,
      236,
      549,
      547,
      373,
      406
    ],
    "example": [
      "In this context, performing a search means returning a result list.",
      "The CCTNS system must be able to perform a simple search within 5-8 seconds and a advanced search (multiple search criteria) within 10-15 seconds regardless of the storage capacity or number of cases in the CCTNS system.",
      "A hierarchical cache should be configured and used for caching of results of most frequently used searches.",
      "Upon the completion of data entry for a question, the administrator will use a submission button to initiate the update process.",
      "It is assumed that all auxiliary data needed for real time update of correlator parameters will be provided directly by the VLA Expansion Project Monitor and Control System system or by dedicated servers.",
      "This information must be saved in a file on the web server where the Space Fractions system is hosted and will be easily edited through simplified administrative screens.",
      "Database Indexes should be applied on the key columns used for searching.",
      "Only when the user clicks on a particular record to view its further details should a query be fired to fetch the additional details for this particular record only.",
      "The solution should enable the user to track the submitted defect or enhancement request.",
      "Such configurations must be saved in the user profile."
    ]
  },
  {
    "text": "The requirements contained in this document are numbered based on the section/subsection in which they appear.",
    "id": [
      1165,
      60,
      129,
      205,
      1164,
      204,
      1168,
      132,
      202,
      206
    ],
    "example": [
      "Requirements are listed in separate sections and in table format for each functional area.",
      "This section provides a description of the functional requirements.",
      "Section 2 is an overview of the descriptions of requirement determination, qualification procedures, rationale, and traceability that are used in the identification and the definitions of the requirements.",
      "This section includes information such as functional and data requirements, general constraints, and assumptions.",
      "The following sections define the requirements for the Center-to-Center project.",
      "Section two is a general description of the product requirements from a user's perspective.",
      "The Requirement Category Mnemonic is a two-letter mnemonic for each functional area.",
      "The APAF ground data system requirements are categorized according to functional areas and are defined in the following sections in table format.",
      "Section one is a brief overview of the product, including definitions and references.",
      "Section three is a detailed requirements specification targeted toward technical designers."
    ]
  },
  {
    "text": "The format of the document follows that outlined in the IEEE STD 830 document, IEEE The VLA Expansion Project Correlator Monitor and Control System is responsible for correlator configuration, real time monitor/control, and hardware testing/servicing.",
    "id": [
      556,
      554,
      562,
      563,
      561,
      570,
      616,
      551,
      599,
      620
    ],
    "example": [
      "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
      "The Correlator Monitor and Control System provides the physical link between the WIDAR Correlator hardware and the VLA Expansion Project monitor and control system.",
      "The Correlator Monitor and Control System exists as an integrated part of the overall VLA Expansion Project Monitor and Control Structure.",
      "The Correlator Monitor and Control System will provide a level of abstraction to modularize the correlator system within the VLA Expansion Project environment.",
      "The remainder of this document contains a more detailed description of the Correlator Monitor and Control System as well as the primary requirements necessary to design and build the EVLA Correlator Monitor and Control System.",
      "Correlator configurations and control instructions will be received from the VLA Expansion Project Monitor and Control System system in a form suitable for translation by the Master Correlator Control Computer.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "The primary goal of this document is to provide a complete and accurate list of requirements for the VLA Expansion Project Correlator Monitor and Control System.",
      "The Master Correlator Control Computer-CMIB, Master Correlator Control Computer-Correlator Power Control Computer, and Master Correlator Control Computer-VLA Expansion Project Monitor and Control System networks shall be on separate physical interfaces.",
      "The Correlator Power Control Computer shall be a high availability type general purpose computer capable of supporting a COTS operating system and have the ability to accept a large number of external hardware status signals either directly or through external interface hardware."
    ]
  },
  {
    "text": "This topology will place the real-time computing requirements in the slave layer and the quasi real-time, network-chaotic loads into the master layer.",
    "id": [
      564,
      565,
      616,
      602,
      572,
      575,
      600,
      597,
      615,
      601
    ],
    "example": [
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "The Master is expected to handle the bulk of the monitor or control interface with the outside world whereas the slaves will be only concerned with the correlator hardware systems under their direct control.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "Network routers/switches shall be employed at the Master Correlator Control Computer-VLA Expansion Project Monitor and Control System interface level to protect the Master Correlator Control Computer from unauthorized access and irrelevant network traffic.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
      "The Master Correlator Control Computer will accept external data feeds for models, time standards, fiber-link phase corrections and other required data to be packaged with control data delivered to the correlator hardware.",
      "There shall be a redundant communication path between the Master Correlator Control Computer and Correlator Power Control Computer to provide for remote reboot in the event of a networking or computing failure.",
      "The interface between the CMIB, Master Correlator Control Computer, and Correlator Power Control Computer shall be Ethernet of 100 Mbits/sec or better data rate.",
      "The CMIB shall conform to both electrical and physical The CMIB shall contain 64 Mbytes or greater of SDRAM, IDE hard disk interface, minimum of one serial and one parallel interface, PCI/ISA buses, 100BaseT network interface, capacity to boot and run a generic COTS operating system in a near real-time environment from local non-volatile storage.",
      "The interface between the Master Correlator Control Computer and external networks shall be Ethernet of 100 Pathways penetrating the correlator shielded room shall be fiber optic or other low RFI material to meet RFI specifications."
    ]
  },
  {
    "text": "The Correlator monitor subsystem will provide VLA Expansion Project system wide access to all correlator system states including the Monitor and Control System supervisor system state.",
    "id": [
      562,
      563,
      631,
      556,
      554,
      570,
      596,
      641,
      551,
      616
    ],
    "example": [
      "The Correlator Monitor and Control System exists as an integrated part of the overall VLA Expansion Project Monitor and Control Structure.",
      "The Correlator Monitor and Control System will provide a level of abstraction to modularize the correlator system within the VLA Expansion Project environment.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
      "The Correlator Monitor and Control System provides the physical link between the WIDAR Correlator hardware and the VLA Expansion Project monitor and control system.",
      "Correlator configurations and control instructions will be received from the VLA Expansion Project Monitor and Control System system in a form suitable for translation by the Master Correlator Control Computer.",
      "It is assumed that all auxiliary data needed for real time update of correlator parameters will be provided directly by the VLA Expansion Project Monitor and Control System system or by dedicated servers.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "The primary goal of this document is to provide a complete and accurate list of requirements for the VLA Expansion Project Correlator Monitor and Control System.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system."
    ]
  },
  {
    "text": "The translation will provide the correlator with specific goal oriented hardware configuration tables to satisfy the configuration requested by the A second interface with a human GUI will also allow for configuration of the correlator hardware, preferably through the same table structures used above.",
    "id": [
      571,
      1247,
      556,
      405,
      570,
      582,
      1157,
      595,
      1246,
      1159
    ],
    "example": [
      "This translation interface will be called the Virtual Correlator Interface.",
      "The Remote Control GUI shall be implemented using C/C++ and ESRI Map Objects.",
      "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
      "The interfaces must be made customizable or user-configurable to the extent possible.(e.g., the displayed columns in the table, move, resize, modify the appearance).",
      "Correlator configurations and control instructions will be received from the VLA Expansion Project Monitor and Control System system in a form suitable for translation by the Master Correlator Control Computer.",
      "Software tools will be provided to assist the user at all access levels from system wide configuration and control to a low level CMIB command line instruction.",
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "It is assumed that the Correlator will receive configuration data in a format that is unambiguous and results in a convergent hardware configuration.",
      "The Incident GUI shall be implemented using C/C++ and ESRI Map Objects.",
      "These building blocks allow the software to be utilized in a number of configurations (by simply altering the configuration parameters of the software)."
    ]
  },
  {
    "text": "Should a CMIB subsystem fail and not respond to reboot requests or other self-heal attempts, an alert notice will be issued so appropriate personnel can affect a hardware repair.",
    "id": [
      1102,
      558,
      773,
      1042,
      772,
      634,
      743,
      90,
      1139,
      802
    ],
    "example": [
      "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
      "The Correlator Monitor and Control System shall monitor correlator and correlator subsystem health and take corrective action autonomously to recover from hardware and computing system faults.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring.",
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform fault detection/location (FD/L).",
      "It will be capable of detecting, reporting on and automatically taking action to remedy or lessen the impact of the following types of abnormal conditions: processor hardware failure, operating system hangs or crashes, temperature or voltage deviations, computational performance below minimum specifications, computational error rates above maximum specification, internal communications failures.",
      "When the Tactical Control System software is halted due to an unplanned power interruption as well as abnormal program termination, then the Tactical Control System shall enter the Recovery Startup Mode upon application of power.",
      "When a security breach occurs and a contact sensor is set OPEN, the alarm system shall be activated.",
      "The Tactical Control System HCI shall provide for a rapid means to cancel aural warnings.",
      "The Tactical Control System shall provide the capability to override validation faults after the fault is acknowledged by the operator."
    ]
  },
  {
    "text": "It is assumed that the backend data processing and VLA Expansion Project Monitor and Control System systems will be capable of accepting output data rates generated by the Correlator Monitor and Control System.",
    "id": [
      563,
      596,
      556,
      570,
      574,
      575,
      554,
      631,
      623,
      573
    ],
    "example": [
      "The Correlator Monitor and Control System will provide a level of abstraction to modularize the correlator system within the VLA Expansion Project environment.",
      "It is assumed that all auxiliary data needed for real time update of correlator parameters will be provided directly by the VLA Expansion Project Monitor and Control System system or by dedicated servers.",
      "The Correlator Monitor and Control System shall receive configuration information from the VLA Expansion Project Monitor and Control System system and translate this info into a physical correlator hardware configuration.",
      "Correlator configurations and control instructions will be received from the VLA Expansion Project Monitor and Control System system in a form suitable for translation by the Master Correlator Control Computer.",
      "Data sample rates and contents will be fully controllable via either the VLA Expansion Project Monitor and Control System or the Backend processing controller.",
      "The Master Correlator Control Computer will accept external data feeds for models, time standards, fiber-link phase corrections and other required data to be packaged with control data delivered to the correlator hardware.",
      "The Correlator Monitor and Control System provides the physical link between the WIDAR Correlator hardware and the VLA Expansion Project monitor and control system.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "The Correlator Monitor and Control System processors shall be capable of meeting all data processing deadlines and anticipated future requirements The Correlator Monitor and Control System processors shall be capable of responding to correlator hardware inputs in a deterministic fashion with sufficient performance to avoid data loss, corruption or overflows.",
      "Ancillary monitor data including system health, error messages and configuration echoes will be spooled such that temporary loss of network communication with the VLA Expansion Project Monitor and Control System network will not result in loss of monitor data."
    ]
  },
  {
    "text": "The interface shall be transformer coupled copper twisted pair unless other materials are required for noise, ground isolation, or physical layout constraints.",
    "id": [
      93,
      622,
      648,
      601,
      1012,
      771,
      770,
      59,
      602,
      598
    ],
    "example": [
      "The system shall be able to change the state of a power switch (OFF to ON, or ON to OFF), in turn changing the state of an appliance connected to the power switch.",
      "This requirement is to allow correlator power monitoring and control to continue in the event of an Monitor and Control System network failure.",
      "Seamlessness shall be accomplished in a manner that is seamless, in that it does not affect hardware modules or software functionality that it meets at interfaces.",
      "The interface between the Master Correlator Control Computer and external networks shall be Ethernet of 100 Pathways penetrating the correlator shielded room shall be fiber optic or other low RFI material to meet RFI specifications.",
      "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct workstation and peripheral equipment maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct data link terminal maintenance.",
      "The system shall be able to use a power switch to change the state of the appliance (e.g., from “off” to “on”).",
      "Network routers/switches shall be employed at the Master Correlator Control Computer-VLA Expansion Project Monitor and Control System interface level to protect the Master Correlator Control Computer from unauthorized access and irrelevant network traffic.",
      "Network switches shall be employed to distribute traffic within a correlator rack and where their use will significantly reduce overall network wiring complexity."
    ]
  },
  {
    "text": "It is desired that the state of the correlator hardware be available through interrogation across the CMIB bus for monitoring and fault tolerance.",
    "id": [
      616,
      615,
      586,
      575,
      597,
      578,
      584,
      1071,
      623,
      608
    ],
    "example": [
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "The CMIB shall conform to both electrical and physical The CMIB shall contain 64 Mbytes or greater of SDRAM, IDE hard disk interface, minimum of one serial and one parallel interface, PCI/ISA buses, 100BaseT network interface, capacity to boot and run a generic COTS operating system in a near real-time environment from local non-volatile storage.",
      "Engineers and technicians will need tools to inspect and monitor individual CMIB layer devices from remote locations and have the ability to fault trace to a specific hot-swappable subsystem.",
      "The Master Correlator Control Computer will accept external data feeds for models, time standards, fiber-link phase corrections and other required data to be packaged with control data delivered to the correlator hardware.",
      "The interface between the CMIB, Master Correlator Control Computer, and Correlator Power Control Computer shall be Ethernet of 100 Mbits/sec or better data rate.",
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "The ability of the Correlator System to achieve and maintain high reliability and uptime will be vitally dependent upon reliable operation and rapid diagnosis and repair of faults in the hardware and software systems.",
      "The Tactical Control System hardware shall support the data rate characteristics of the AV, data link and payload to ensure interoperability.",
      "The Correlator Monitor and Control System processors shall be capable of meeting all data processing deadlines and anticipated future requirements The Correlator Monitor and Control System processors shall be capable of responding to correlator hardware inputs in a deterministic fashion with sufficient performance to avoid data loss, corruption or overflows.",
      "The CMIB shall have control of hardware warm boots such that an external command from the Master Correlator Control Computer to reboot the CMIB shall have an option to force a hardware warm boot."
    ]
  },
  {
    "text": "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible.",
    "id": [
      617,
      576,
      600,
      580,
      564,
      578,
      616,
      620,
      608,
      614
    ],
    "example": [
      "This computer may exist as a hot swappable or redundant CPU device capable of self-healing where possible.",
      "The ability to attempt recovery from failure or hot-swapped hardware devices will be built into this system.",
      "There shall be a redundant communication path between the Master Correlator Control Computer and Correlator Power Control Computer to provide for remote reboot in the event of a networking or computing failure.",
      "Due to the more hardware specific connections and controls of the Correlator Power Control Computer, actions taken by external system upon hard failures are TBD.",
      "The gateway to the correlator will be through the Virtual Correlator Interface which will exist as a software entity on the The Correlator Monitor and Control System will be designed and implemented as a Master/Slave network with one computer system coordinating the activities of a number of intelligent hardware control processors.",
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "The operating system/module combination shall be capable of supporting the real-time requirements of the correlator hardware, hardware monitor/control/diagnostics with support for standalone test bench operation with simulated control data generation, and the ability to access and upgrade correlator hardware The Master Correlator Control Computer shall be a high availability type general- purpose computer capable of supporting multiple Ethernet interfaces, COTS operating systems, and support server/host services for the CMIB operating system.",
      "The Correlator Power Control Computer shall be a high availability type general purpose computer capable of supporting a COTS operating system and have the ability to accept a large number of external hardware status signals either directly or through external interface hardware.",
      "The CMIB shall have control of hardware warm boots such that an external command from the Master Correlator Control Computer to reboot the CMIB shall have an option to force a hardware warm boot.",
      "Reboots should result in minimal system interruptions with the offending CPU reconfiguring and returning to service autonomously."
    ]
  },
  {
    "text": "All lower system error and debug messages shall be present at the Master Correlator Control Computer layer.",
    "id": [
      581,
      955,
      625,
      1072,
      578,
      1113,
      575,
      956,
      108,
      401
    ],
    "example": [
      "All use of the Correlator Monitor and Control System will be through the VCI or Master Correlator Control Computer.",
      "All digital messages received by the Tactical Control System shall be automatically checked for errors and corrected when possible.",
      "All system error and debug messages shall be categorized in a logical fashion such that message traffic can be filtered as to content, detail, and message rate.",
      "For each OUTRIDER system, the Tactical Control System shall provide full independent computer redundancy.",
      "It is intended that both primary and secondary Master Correlator Control Computer systems maintain full Correlator Monitor and Control System state information such that any hard failure in the primary node can be corrected by simply rerouting Monitor and Control System communications to the secondary.",
      "All Tactical Control System operator inputs shall be error checked such that any erroneous operator entry will not cause current processing to terminate.",
      "The Master Correlator Control Computer will accept external data feeds for models, time standards, fiber-link phase corrections and other required data to be packaged with control data delivered to the correlator hardware.",
      "The Tactical Control System shall provide the capability to log all incoming and outgoing formatted tactical messages.",
      "All DigitalHome operations shall incorporate exception handling so that the system responds to a user with a clear, descriptive message when an error or an exceptional condition occurs.",
      "All error messages produced by the CCTNS system must be meaningful, so that they can be appropriately acted upon by the users who are likely to see them."
    ]
  },
  {
    "text": "Operating system software shall either have source code available or come with sufficient diagnostics and customer support.",
    "id": [
      645,
      641,
      1089,
      582,
      631,
      407,
      632,
      669,
      371,
      201
    ],
    "example": [
      "Software tools and pre-built applications that do not have source code available shall come with a complete diagnostic package and customer support.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "The Tactical Control System software shall be capable of being hosted on a variety of computer operating systems that are organic to the various Services.",
      "Software tools will be provided to assist the user at all access levels from system wide configuration and control to a low level CMIB command line instruction.",
      "This software will provide full system access for testing, debugging, and control while the correlator is off line or under the control of the VLA Expansion Project Monitor and Control System system.",
      "The CCTNS system user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines ",
      "A Graphical User Interface shall be provided as an interface to the Correlator Monitor and Control System test software that allows for a convenient and configurable tool to access the Correlator Monitor and Control System remotely through the VCI.",
      "Complete and comprehensible hardware systems specifications and configuration information shall be readily available.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "This document is designed to provide information to both the client and the technical designers of the software."
    ]
  },
  {
    "text": "Software system and application code shall be well documented and written in a generally familiar language or languages.",
    "id": [
      670,
      669,
      201,
      454,
      116,
      147,
      414,
      641,
      729,
      418
    ],
    "example": [
      "Software shall be written in a style that is easily readable and using practices that allow for minimal confusion.",
      "Complete and comprehensible hardware systems specifications and configuration information shall be readily available.",
      "This document is designed to provide information to both the client and the technical designers of the software.",
      "Using appropriate terminology specific to the user’s tasks and information needs is important for making the content easy to understand.",
      "All system documents (Software Requirements Specification, Architectural Design Specification, Module Detailed Design, Module Source Code, and all Test Plans) shall be up-to-date, use the Homeowner document format [HO2305] and reside in the HomeOwner Document Archive at completion of the project.",
      "The Software Design Documents of each of the seven components (see section 1.2) shall contain the detailed information of the internal interfaces.",
      "The user interfaces of the CCTNS system should comply with Standard ISO 9241.",
      "All systems and application source code shall be available to or on the EVLA Correlator Monitor and Control Systems that execute it.",
      "Communications procedures, formats, and interfaces will be interoperable with selected standard DoD C4I systems, architectures, and protocols.",
      "User interfaces should meet its requirements and recommendations."
    ]
  },
  {
    "text": "During Phase 2, Tactical Control System Low Rate Initial Production (LRIP) will commence.",
    "id": [
      679,
      680,
      765,
      838,
      921,
      764,
      760,
      732,
      1064,
      747
    ],
    "example": [
      "Design and development of the Tactical Control System will be conducted in two phases.",
      "Phase 1 is defined as the Program Definition and Risk Reduction phase, and Phase 2 is defined as the Engineering and Manufacturing Development phase in accordance with Department Of Defense Instruction (DODI) - 5000.2R.",
      "In the Training Operations Mode the Tactical Control System shall support target coordinate development.",
      "AV specific components used to perform ground based closed loop command and control functions for Tactical Control System shall be initialized upon operator selection of a specific AV.",
      "The Tactical Control System shall have the functionality to conduct limited exploitation, to include voice and textual reporting for spot and mission objectives, on the payload product data.",
      "In the Training Operations Mode the Tactical Control System shall support payload product Mmanagement.",
      "In the Normal Operations Mode the Tactical Control System shall support target coordinate development.",
      "The initial TCS task analysis will produce a system baseline which will be optimized by engineering analysis and operator evaluations.",
      "A training program consisting of an initial security training and awareness briefing covering AIS security in general but also tailored to the Tactical Control System shall be developed.",
      "When executing in the Normal Startup Mode, the Tactical Control System shall provide the system functionality necessary to initialize the system to place it in the Operations State within 60 seconds from the time power is supplied and the Tactical Control System application is launched."
    ]
  },
  {
    "text": "Although developed as a total package, the Tactical Control System will be scaleable to meet the user's requirements for deployment.",
    "id": [
      696,
      996,
      990,
      1069,
      993,
      1004,
      989,
      988,
      1000,
      987
    ],
    "example": [
      "The Tactical Control System will provide software portability, scaleable functionality, and support for operational configurations tailored to the users’ needs.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The hardware of the Tactical Control System shall be capable of being scaled as well as being modular to meet the varying needs of the Services.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS."
    ]
  },
  {
    "text": "To the extent possible, the Tactical Control System will use standard Department of Defense (DoD) software components to achieve commonality.",
    "id": [
      697,
      1000,
      989,
      999,
      1004,
      990,
      993,
      994,
      987,
      997
    ],
    "example": [
      "To the extent possible, the Tactical Control System will use standard DoD components in order to achieve commonality.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS."
    ]
  },
  {
    "text": "The Tactical Control System will be connected with All Source Analysis System (ASAS).",
    "id": [
      711,
      986,
      705,
      1052,
      706,
      709,
      718,
      715,
      848,
      997
    ],
    "example": [
      "The Tactical Control System will be connected with Intelligence Analysis System (IAS)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ASAS.",
      "The Tactical Control System will be connected with Advanced Field Artillery Tactical Data System (AFATDS).",
      "The Tactical Control System is an Automated Information System (AIS).",
      "The Tactical Control System will be connected with Automated Target Hand-off System (ATHS)",
      "The Tactical Control System will be connected with Enhanced Tactical Radar Correlator (ETRAC)",
      "The Tactical Control System will be connected with Army Mission Planning System (AMPS)",
      "The Tactical Control System will be connected with Joint Surveillance Target Attack Radar System (JSTARS) Ground Station Module/Common",
      "The Tactical Control System shall allow the operator to control an AV using the LOS as well as SATCOM data links.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS."
    ]
  },
  {
    "text": "The Tactical Control System will be connected with Contingency Airborne Reconnaissance System (CARS)",
    "id": [
      712,
      876,
      709,
      978,
      719,
      1145,
      875,
      888,
      861,
      705
    ],
    "example": [
      "The Tactical Control System will be connected with Joint Deployable Intelligence Support System (JDISS)",
      "The Tactical Control System shall provide the necessary system capabilities required for payload control beyond line of sight via uplink command of two air vehicles of the same type using sequential communication techniques.",
      "The Tactical Control System will be connected with Enhanced Tactical Radar Correlator (ETRAC)",
      "The Tactical Control System will interface with external systems to conduct mission coordination and operations.",
      "The Tactical Control System will be connected with Tactical Aircraft Mission Planning System (TAMPS)",
      "The Tactical Control System shall have an objective capability to be integrated and operated from tactical and command and control aircraft.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall support a LOS data link and SATCOM data link capability.",
      "As and objective, the Tactical Control System shall be interoperable with the Integrity Beacon Landing System (IBLS), and the Common Automated Recovery System (CARS), both used by Outrider.",
      "The Tactical Control System will be connected with Advanced Field Artillery Tactical Data System (AFATDS)."
    ]
  },
  {
    "text": "The Tactical Control System will be connected with Joint Maritime Command Information System (JMCIS)",
    "id": [
      714,
      712,
      987,
      713,
      715,
      988,
      1009,
      704,
      983,
      688
    ],
    "example": [
      "The Tactical Control System will be connected with Joint Service Imagery Processing System - Navy (JSIPS-N)",
      "The Tactical Control System will be connected with Joint Deployable Intelligence Support System (JDISS)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS.",
      "The Tactical Control System will be connected with Joint Service Imagery Processing System – Air Force (JSIPS-AF)",
      "The Tactical Control System will be connected with Joint Surveillance Target Attack Radar System (JSTARS) Ground Station Module/Common",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System will be connected with Advanced Tomahawk Weapons Control Station (ATWCS).",
      "The Tactical Control System will be interoperable with C4I systems.",
      "The Tactical Control System will also provide connectivity to specifically identified Command, Control, Communications, Computers, and "
    ]
  },
  {
    "text": "The Tactical Control System will be connected with Air Force Mission Support System (AFMSS)",
    "id": [
      713,
      719,
      718,
      993,
      978,
      990,
      705,
      715,
      888,
      789
    ],
    "example": [
      "The Tactical Control System will be connected with Joint Service Imagery Processing System – Air Force (JSIPS-AF)",
      "The Tactical Control System will be connected with Tactical Aircraft Mission Planning System (TAMPS)",
      "The Tactical Control System will be connected with Army Mission Planning System (AMPS)",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System will interface with external systems to conduct mission coordination and operations.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System will be connected with Advanced Field Artillery Tactical Data System (AFATDS).",
      "The Tactical Control System will be connected with Joint Surveillance Target Attack Radar System (JSTARS) Ground Station Module/Common",
      "The Tactical Control System shall support a LOS data link and SATCOM data link capability.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems."
    ]
  },
  {
    "text": "The Tactical Control System system will be capable of controlling the Predator and Outrider AVs with a single control system, using existing military services standard hardware and software, and supporting interfaces with various C4I systems.",
    "id": [
      983,
      994,
      993,
      990,
      989,
      675,
      1004,
      1000,
      761,
      997
    ],
    "example": [
      "The Tactical Control System will be interoperable with C4I systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The purpose of the Tactical Control System is to provide the military services with a single command, control, data receipt, data processing, data export and dissemination system that is interoperable with the family of all present and future tactical unmanned aerial vehicles.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "In the Normal Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS."
    ]
  },
  {
    "text": "The Tactical Control System will provide receipt and transmission of secondary imagery and/or data from UAV.",
    "id": [
      682,
      735,
      683,
      684,
      912,
      723,
      917,
      789,
      677,
      786
    ],
    "example": [
      "The Tactical Control System will receipt and transmission of secondary imagery and/or data from multiple UAV.",
      "The Tactical Control System will provide direct receipt of imagery and/or data from UAV.",
      "The Tactical Control System will direct receipt of imagery and/or data from multiple UAV.",
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System shall be capable of receiving secondary HAE UAV payload imagery.",
      "The Tactical Control System will export and disseminate UAV imagery products, tactical communication messages, as well as mission plans and target coordinates.",
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "Tactical Control System will also be capable of receiving and processing information from High Altitude and Endurance (HAE) UAVs, their associated payloads, future development UAVs and payloads.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems."
    ]
  },
  {
    "text": "The Tactical Control System will provide control of the UAV payload in addition to direct receipt of imagery/data for UAV.",
    "id": [
      684,
      735,
      683,
      912,
      682,
      836,
      789,
      874,
      786,
      1005
    ],
    "example": [
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System will provide direct receipt of imagery and/or data from UAV.",
      "The Tactical Control System will direct receipt of imagery and/or data from multiple UAV.",
      "The Tactical Control System shall be capable of receiving secondary HAE UAV payload imagery.",
      "The Tactical Control System will receipt and transmission of secondary imagery and/or data from multiple UAV.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System will have the capability to control and monitor the AV payload(s).",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems.",
      "The Tactical Control System shall provide interfaces with the respective UAV program-provided data links for command and control."
    ]
  },
  {
    "text": "The Tactical Control System will provide control of the UAV, less launch and recovery, plus all the functions of level three from UAV.",
    "id": [
      685,
      684,
      686,
      788,
      789,
      736,
      687,
      783,
      836,
      727
    ],
    "example": [
      "The Tactical Control System will control of the UAV, less launch and recovery, plus all the functions of level three for the multiple UAV.",
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System has capability to have full function and control of the UAV from takeoff to landing for multiple UAV.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System will provide capability to have full function and control of the UAV from takeoff to landing.",
      "The Tactical Control System consists of the software, software-related hardware and the extra ground support hardware necessary for the control of the Outrider, and the Predator UAV, and future tactical UAVs.",
      "The Tactical Control System shall have the functionality to allow the operator to generate a UAV mission plan.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The primary function of the Tactical Control System is to provide command and control of the payload, Air Vehicle (AV), data link, and other necessary support equipment in order to employ tactical UAVs to conduct reconnaissance, surveillance, target acquisition, and target identification missions."
    ]
  },
  {
    "text": "In the Training Operations Mode the Tactical Control System shall support mission control and monitoring.",
    "id": [
      763,
      758,
      765,
      757,
      978,
      764,
      766,
      779,
      980,
      933
    ],
    "example": [
      "In the Training Operations Mode the Tactical Control System shall support mission planning.",
      "In the Normal Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "In the Training Operations Mode the Tactical Control System shall support target coordinate development.",
      "In the Normal Operations Mode the Tactical Control System shall support mission planning.",
      "The Tactical Control System will interface with external systems to conduct mission coordination and operations.",
      "In the Training Operations Mode the Tactical Control System shall support payload product Mmanagement.",
      "In the Training Operations Mode the Tactical Control System shall support C4I systems interface.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring.",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "The Tactical Control System shall plan and conduct a mission."
    ]
  },
  {
    "text": "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software upgrades.",
    "id": [
      773,
      771,
      770,
      768,
      772,
      769,
      966,
      1118,
      1117,
      756
    ],
    "example": [
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform software debug and monitoring.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct workstation and peripheral equipment maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct data link terminal maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct AV maintenance.",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall perform fault detection/location (FD/L).",
      "In the Maintenance Operations Mode, if computer workstation Human Computer Interface (HCI) is required, the Tactical Control System shall conduct payload maintenance.",
      "Tactical Control System shall be capable of executing workstation and peripheral equipment maintenance software and displaying appropriate status results.",
      "The Human Computer Interface (HCI) shall be designed and implemented in accordance with the Tactical Control System HCI Specification, Tactical Control System 108.[SSS462] ",
      "The Tactical Control System shall facilitate Human-Computer Interfaces (HCIs) that support operation of all system modes, functions, and capabilities.",
      "The Tactical Control System hardware and software shall execute periodic Fault Detection/Location (FD/L) while in the Normal Operations Mode and Training Mode, to include a periodic determination of level of interaction."
    ]
  },
  {
    "text": "As an objective, the Tactical Control System shall have the capability to import as well as create and modify map display overlays for fire support coordination measures [SSS547], airspace control measures [SSS548], and threat identification measures.",
    "id": [
      975,
      827,
      808,
      1133,
      797,
      999,
      989,
      1145,
      997,
      998
    ],
    "example": [
      "The Tactical Control System shall be capable of importing map information via operator procedure and shall be capable of incorporating vector format and Compressed ADRG (CADRG) maps.",
      "The Tactical Control System shall have the capability to load a map onto the display, to zoom in and out, to scroll, to print, and to clear a map on the map display.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System HCI shall provide the capability to select and amplify an object and point on a map as well as payload screen.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall have an objective capability to be integrated and operated from tactical and command and control aircraft.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the operator with a clearly indicated map scale.",
    "id": [
      821,
      827,
      902,
      1126,
      792,
      793,
      808,
      927,
      830,
      918
    ],
    "example": [
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "The Tactical Control System shall have the capability to load a map onto the display, to zoom in and out, to scroll, to print, and to clear a map on the map display.",
      "The Tactical Control System shall be capable of presenting to the operator a visual depiction of the minimum and maximum data link operational ranges.",
      "The Tactical Control System shall provide for multi-level information display tailoring by the operator.",
      "The Tactical Control System mission planning function shall provide a graphical user interface that gives the operator the ability to define waypoints on a map based display using a pointing device with full keyset redundancy.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions on the map display.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System will have the functionality to determine target coordinates, and estimate target coordinate accuracy.",
      "The Tactical Control System shall display icons indicating Tactical Control System position and Ground Data Terminal (GDT) position.",
      "The Tactical Control System operator shall be able to select the content of the overlay information."
    ]
  },
  {
    "text": "The Tactical Control System shall display an icon indicating payload center field of view and footprint when receiving downlink from the desired AV.",
    "id": [
      828,
      835,
      831,
      929,
      829,
      874,
      928,
      926,
      881,
      1132
    ],
    "example": [
      "The Tactical Control System shall display an icon indicating AV position when receiving downlink from the desired AV.",
      "The Tactical Control System shall provide the capability to display the payload swath for the selected payload for planning purposes.",
      "The Tactical Control System shall display an icon indicating Launch, Handover, and Recovery site (when applicable).",
      "The Tactical Control System shall have the functionality to determine the location of items of interest within the payload field of view, and express these locations in coordinates acceptable for military applications.",
      "The Tactical Control System shall display an icon, in variable sizes, indicating target position and type at coordinates selected by the operator.",
      "The Tactical Control System will have the capability to control and monitor the AV payload(s).",
      "The Tactical Control System shall support a target location function where the operator can request the current ground location of the payload field-of-view center.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions located on the payload imagery display.",
      "The Tactical Control System shall provide a graphical user interface display for the purpose of controlling the payload.",
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control."
    ]
  },
  {
    "text": "The Tactical Control System shall be able to generate payload planning information to be uplinked to the AV separate from a flight route plan.",
    "id": [
      798,
      875,
      818,
      835,
      797,
      834,
      874,
      784,
      839,
      786
    ],
    "example": [
      "The Tactical Control System shall provide the system functionality necessary to upload a flight route plan and payload plan (if applicable) to the AV via the selected system data link as well as direct ground connection.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall analyze the flight route plan selected for uplink to determine that the flight constraints of the AV and the limitation of the data link are not violated prior to transmission of the flight route plan to the AV.",
      "The Tactical Control System shall provide the capability to display the payload swath for the selected payload for planning purposes.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall provide the system functionality necessary to generate a payload plan.",
      "The Tactical Control System will have the capability to control and monitor the AV payload(s).",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from service specific mission planning systems.",
      "The Tactical Control System shall transmit command and control information to the AV via the uplink to the AV, and receive AV telemetry and payload information via downlink from the AV.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the capability to pass control of an AV to another Tactical Control System, and receive control of an AV from another Tactical Control System [SSS115].",
    "id": [
      875,
      843,
      839,
      841,
      854,
      874,
      884,
      788,
      789,
      848
    ],
    "example": [
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "The Tactical Control System shall transmit command and control information to the AV via the uplink to the AV, and receive AV telemetry and payload information via downlink from the AV.",
      "The Tactical Control System shall have the capability to control and monitor multiple types of AVs.",
      "The Tactical Control System shall have the capability to command the AV to use the navigation methods inherent to the selected AV.",
      "The Tactical Control System will have the capability to control and monitor the AV payload(s).",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System shall allow the operator to control an AV using the LOS as well as SATCOM data links."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary system capabilities required for AV flight control BLOS via uplink command to two MAE air vehicles.",
    "id": [
      876,
      843,
      854,
      798,
      884,
      845,
      1005,
      993,
      875,
      1145
    ],
    "example": [
      "The Tactical Control System shall provide the necessary system capabilities required for payload control beyond line of sight via uplink command of two air vehicles of the same type using sequential communication techniques.",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "The Tactical Control System shall have the capability to command the AV to use the navigation methods inherent to the selected AV.",
      "The Tactical Control System shall provide the system functionality necessary to upload a flight route plan and payload plan (if applicable) to the AV via the selected system data link as well as direct ground connection.",
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System shall provide interfaces with the respective UAV program-provided data links for command and control.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall have an objective capability to be integrated and operated from tactical and command and control aircraft."
    ]
  },
  {
    "text": "This control will include control of the ADT antenna and of the ADT transmitter and receiver.",
    "id": [
      857,
      859,
      858,
      885,
      892,
      895,
      893,
      898,
      896,
      901
    ],
    "example": [
      "The Tactical Control System shall provide the functionality to control the ADT antenna.",
      "The Tactical Control System shall provide the functionality to control the power, transmitter signal strength, and frequencies used by ADT for data link communication.",
      "This control will including its pointing direction and mode of transmission (e.g. omni and directional).",
      "Data terminal control shall include, but is not limited to, antenna pointing control, transmitter control, and receiver control.",
      "The Tactical Control System shall provide automatic pointing commands for directional antennas, and shall allow for the manual pointing of directional antennas when desired by the operator.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver functions of the selected data terminal.",
      "The Tactical Control System shall be capable of positioning antennas to maintain LOS as well as SATCOM.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal."
    ]
  },
  {
    "text": "The Tactical Control System shall provide override of payload automated as well as preprogrammed inputs.",
    "id": [
      836,
      965,
      834,
      879,
      862,
      780,
      882,
      724,
      903,
      874
    ],
    "example": [
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "Tactical Control System shall be capable of executing payload maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall provide the system functionality necessary to generate a payload plan.",
      "The Tactical Control System shall receive, process, and present payload data to the operator so that the status of the payload can be determined.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System will allow the operator to conduct payload product management. ",
      "Tactical Control System shall provide the capability to monitor payload adherence to the uplinked mission plan.",
      "The Tactical Control System will also receive, process, and display tasking orders, and operational information from Service specific mission planning systems.",
      "The Tactical Control System will have the functionality necessary to manage all aspects of payload product handling to include receiving, processing, displaying, and performing limited exploitation.",
      "The Tactical Control System will have the capability to control and monitor the AV payload(s)."
    ]
  },
  {
    "text": "The Tactical Control System shall display the current search footprint and the search history of the payload on the map.",
    "id": [
      827,
      793,
      1135,
      926,
      808,
      814,
      925,
      929,
      927,
      954
    ],
    "example": [
      "The Tactical Control System shall have the capability to load a map onto the display, to zoom in and out, to scroll, to print, and to clear a map on the map display.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions on the map display.",
      "The Tactical Control System HCI shall display the SAR imaging swath on the map display.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions located on the payload imagery display.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System flight route planner will provide payload search area information, such as visual acuity range due to atmospheric conditions, diurnal transition periods for thermal imagery, and lunar and solar terrain shadowing.",
      "The Tactical Control System shall have the capability to display Near-Real Time (NRT) imagery to include, as a minimum, date/time group, target location coordinates when the target is in the center of the field of view, north seeking arrow, and AV position and heading.",
      "The Tactical Control System shall have the functionality to determine the location of items of interest within the payload field of view, and express these locations in coordinates acceptable for military applications.",
      "The Tactical Control System will have the functionality to determine target coordinates, and estimate target coordinate accuracy.",
      "The Tactical Control System shall have the capability to review incoming annotated as well as un-annotated digital imagery."
    ]
  },
  {
    "text": "The Tactical Control System shall have the capability to simultaneously control and monitor a line-of-sight as well as a BLOS data terminal.",
    "id": [
      917,
      864,
      981,
      856,
      1018,
      963,
      836,
      964,
      841,
      1004
    ],
    "example": [
      "The Tactical Control System shall provide the capability to simultaneously view imagery as well as data from more than one payload, when applicable.",
      "Tactical Control System shall provide the capability to monitor specific telemetry elements real-time, and record all telemetry elements for future review and processing.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System shall support a concurrent uplink and downlink capability.",
      "The Tactical Control System shall be equipped to view incoming and outgoing, both annotated and un-annotated analog imagery.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall have the functionality to view incoming and outgoing, both annotated and un-annotated digital imagery messages.",
      "The Tactical Control System shall have the capability to control and monitor multiple types of AVs.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG."
    ]
  },
  {
    "text": "As a minimum the Tactical Control System LOS data terminal control modes shall include acquisition, autotrack, search, manual point, omni directional, as well as directional modes of operation, if applicable to the selected data link.",
    "id": [
      884,
      896,
      753,
      888,
      1014,
      797,
      898,
      895,
      845,
      886
    ],
    "example": [
      "The Tactical Control System shall be capable of interfacing with the specified data terminal and issuing data link terminal commands required to establish, control, and maintain the data link with a selected AV.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "When in the Operations State the Tactical Control System shall be capable of operating in three modes: normal operations mode, training operations mode, and maintenance operations mode.",
      "The Tactical Control System shall support a LOS data link and SATCOM data link capability.",
      "As a minimum this information will include the location of all data terminals, launch and recovery sites, and the controlling Tactical Control System.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver functions of the selected data terminal.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal."
    ]
  },
  {
    "text": "The operator shall be able to manually override the automatic function selection of the selected data terminal, if desired.",
    "id": [
      897,
      899,
      887,
      855,
      853,
      886,
      1229,
      746,
      752,
      896
    ],
    "example": [
      "The operator shall be able to manually override the automatic mode selection of the selected data terminal, if desired.",
      "The operator shall be able to manually override the automatic frequency selection if desired.",
      "The operator shall be able to manually override any automatic data terminal control mode selection if desired, except during Emission Control (EMCON) and Hazards of Electromagnetic Radiation to Ordnance (HERO) conditions.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, UAV navigation methods by sending the proper control commands to the UAV.",
      "The operator shall have the capability to initiate as well as change, to include as a minimum manual override, flight behaviors by sending the proper control commands to the UAV.",
      "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal.",
      "The user shall be provided with the capability to select a network identifier for a device command/control request.",
      "The Tactical Control System shall inform the operator if the operator attempts to execute a function prohibited as a result of the determined level of interaction.",
      "For recovery from abnormal termination, Tactical Control System shall prompt the operator to select the type of recovery to be executed: (1)Resume in the Same Modes And Data; (2)Resume in the Same Modes but Review and Modify the Command Data as Necessary; or, (3) Perform a Command Shutdown and Startup Via the Normal ",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of monitoring and displaying the signal quality of the received and transmitted signals for the selected data terminal.",
    "id": [
      901,
      961,
      900,
      898,
      896,
      952,
      895,
      962,
      859,
      864
    ],
    "example": [
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring the status of all incoming and outgoing tactical communication messages.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "The Tactical Control System shall be capable of reviewing incoming Tactical Communication Messages.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver functions of the selected data terminal.",
      "The Tactical Control System shall have the capability to review all tactical communication messages received and transmitted.",
      "The Tactical Control System shall provide the functionality to control the power, transmitter signal strength, and frequencies used by ADT for data link communication.",
      "Tactical Control System shall provide the capability to monitor specific telemetry elements real-time, and record all telemetry elements for future review and processing."
    ]
  },
  {
    "text": "This functionality, as a minimum, shall include: formatting, storing, internally routing, and recording the video [SSS190]; creating and storing a freeze frame of the video [SSS191]; retrieving and displaying the video [SSS192]; printing a hard copy of freeze frame video [SSS193]; and processing digital imagery for export and dissemination [SSS194].",
    "id": [
      950,
      924,
      922,
      1030,
      1007,
      1028,
      559,
      572,
      114,
      1144
    ],
    "example": [
      "Processing will include formatting, storing, routing, and display.",
      "The Tactical Control System shall provide the capability to capture frozen-frames of imagery and store these frozen images for further review and processing.",
      "Limited exploitation, as a minimum, will include image enhancement and annotation.",
      "The Tactical Control System shall, as a minimum, allow the Operator(s) to print freeze-frame video, C4I Messages, Mission Plans, FD/L information, and current map display to an internal printer.",
      "The Tactical Control System shall as a minimum, allow Operator(s) to print freeze-frame video, C4I Messages, Mission Plans, FD/L information, and current map display.",
      "An RS-170A video interface shall be provided for the system to output and input analog imagery and overlays to and from a Video Cassette Recorder (VCR) for recording and playback.",
      "The Correlator Monitor and Control System shall perform limited amounts of real-time data processing and probing such as providing tools to collect and display auto correlation products.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
      "The development of the DigitalHome system shall use methods and techniques such as the following to support system maintenance.",
      "The Tactical Control System HCI shall provide continuously-available, on-screen control functions for time and missioncritical operations, to include as a minimum print, freeze, declassification, mark VCR, declutter, cease RF transmission."
    ]
  },
  {
    "text": "The Tactical Control System shall have the ability to interface with Service specific ground and airborne Ultra High Frequency (UHF), Very High Frequency (VHF), UHF/VHF, and High Frequency (HF) radios for digital message transmission while using the same radios for record traffic.",
    "id": [
      979,
      859,
      898,
      901,
      896,
      895,
      876,
      864,
      940,
      913
    ],
    "example": [
      "The Tactical Control System shall provide the capability to interface with equipment necessary to provide connectivity with standard DoD tactical (VHF, UHF, and UHF/VHF) radios, Mobile Subscriber Equipment, and military and commercial satellite communications equipment.",
      "The Tactical Control System shall provide the functionality to control the power, transmitter signal strength, and frequencies used by ADT for data link communication.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver modes of the selected data terminal.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver functions of the selected data terminal.",
      "The Tactical Control System shall provide the necessary system capabilities required for payload control beyond line of sight via uplink command of two air vehicles of the same type using sequential communication techniques.",
      "Tactical Control System shall provide the capability to monitor specific telemetry elements real-time, and record all telemetry elements for future review and processing.",
      "The Tactical Control System shall export and disseminate formatted NITF 2.0 files, digital imagery, RS-170A video (with as well as without overlay), and tactical communication messages.",
      "Payload telemetry data shall be available to support other Tactical Control System functions as required."
    ]
  },
  {
    "text": "All erroneous messages that cannot be corrected by Tactical Control System shall be flagged to the operator.",
    "id": [
      1113,
      955,
      746,
      1102,
      802,
      801,
      108,
      887,
      956,
      961
    ],
    "example": [
      "All Tactical Control System operator inputs shall be error checked such that any erroneous operator entry will not cause current processing to terminate.",
      "All digital messages received by the Tactical Control System shall be automatically checked for errors and corrected when possible.",
      "The Tactical Control System shall inform the operator if the operator attempts to execute a function prohibited as a result of the determined level of interaction.",
      "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
      "The Tactical Control System shall provide the capability to override validation faults after the fault is acknowledged by the operator.",
      "The Tactical Control System shall notify the operator of all discrepancies found during the mission plan check as well as indicate successful completion of the mission plan check.",
      "All DigitalHome operations shall incorporate exception handling so that the system responds to a user with a clear, descriptive message when an error or an exceptional condition occurs.",
      "The operator shall be able to manually override any automatic data terminal control mode selection if desired, except during Emission Control (EMCON) and Hazards of Electromagnetic Radiation to Ordnance (HERO) conditions.",
      "The Tactical Control System shall provide the capability to log all incoming and outgoing formatted tactical messages.",
      "The Tactical Control System shall be capable of monitoring the status of all incoming and outgoing tactical communication messages."
    ]
  },
  {
    "text": "Tactical Control System shall be capable of executing AV maintenance software and displaying appropriate status results.",
    "id": [
      966,
      965,
      866,
      843,
      900,
      836,
      841,
      874,
      783,
      1083
    ],
    "example": [
      "Tactical Control System shall be capable of executing workstation and peripheral equipment maintenance software and displaying appropriate status results.",
      "Tactical Control System shall be capable of executing payload maintenance software and displaying appropriate status results.",
      "Tactical Control System shall provide the capability to monitor the status of all AV subsystems reporting status.",
      "The Tactical Control System shall provide the capability to control the AV flight commands as well as to release the AV to an autonomous flight control mode.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall have the capability to control and monitor multiple types of AVs.",
      "The Tactical Control System will have the capability to control and monitor the AV payload(s).",
      "The Tactical Control System shall have the functionality to allow the operator to generate a UAV mission plan.",
      "The Tactical Control System software will provide the functionality and capability to receive, process, and disseminate video and telemetry data from the AV and payload; perform mission planning; monitor and control the payload; monitor and control the AV; and monitor and control the data links."
    ]
  },
  {
    "text": "Tactical Control System shall be capable of executing data terminal maintenance software and displaying appropriate status results.",
    "id": [
      966,
      965,
      981,
      900,
      886,
      1129,
      901,
      751,
      856,
      779
    ],
    "example": [
      "Tactical Control System shall be capable of executing workstation and peripheral equipment maintenance software and displaying appropriate status results.",
      "Tactical Control System shall be capable of executing payload maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall receive, process, and present status data to the operator so that the status of the data terminal and the supported AV data link can be monitored.",
      "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System shall be capable of automatically recording system state data, interface communications and other information necessary to support event reconstruction.",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring."
    ]
  },
  {
    "text": "The Tactical Control System shall provide external interfaces to launch and recovery systems.",
    "id": [
      1009,
      978,
      860,
      980,
      981,
      1005,
      836,
      1006,
      788,
      993
    ],
    "example": [
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System will interface with external systems to conduct mission coordination and operations.",
      "As an objective, the Tactical Control System shall support an automatic launch and recovery system.",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide interfaces with the respective UAV program-provided data links for command and control.",
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "The Tactical Control System shall have provisions for simultaneously supporting both of the following external interfaces: ",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSTARS GSM.",
    "id": [
      993,
      989,
      988,
      1004,
      994,
      987,
      996,
      1000,
      995,
      997
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JDISS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with CARS.",
    "id": [
      989,
      993,
      997,
      998,
      1000,
      992,
      1004,
      996,
      995,
      999
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JDISS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with CCTV.",
    "id": [
      1000,
      994,
      1004,
      999,
      989,
      996,
      993,
      1002,
      995,
      1003
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TBMCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JDISS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ETRAC."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TAMPS.",
    "id": [
      989,
      996,
      993,
      997,
      998,
      1004,
      1002,
      992,
      999,
      1000
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TBMCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with MIES.",
    "id": [
      1004,
      996,
      989,
      993,
      988,
      994,
      997,
      998,
      999,
      987
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with COMPASS.",
    "id": [
      989,
      993,
      997,
      998,
      992,
      996,
      1004,
      999,
      990,
      1000
    ],
    "example": [
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TES.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with TEG.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System will provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with Service Mission Planners.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS."
    ]
  },
  {
    "text": "The Tactical Control System shall provide an interface between the Tactical Control System and an external hard copy printer.",
    "id": [
      1029,
      1009,
      1008,
      981,
      1019,
      1010,
      994,
      988,
      997,
      998
    ],
    "example": [
      "The Tactical Control System shall have ports for outputting data and imagery to an internal hard copy printer.",
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall have the functionality to output digital message data and imagery to a hard copy printer.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall provide an internal interface for establishing communications with the Real Time Processor (RTP) within Tactical Control System.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS."
    ]
  },
  {
    "text": "The Tactical Control System will provide an interface between the Tactical Control System and a video cassette recorder.",
    "id": [
      1009,
      1010,
      1027,
      1032,
      1019,
      875,
      992,
      995,
      994,
      989
    ],
    "example": [
      "The Tactical Control System shall provide an interface between the Tactical Control System and external data storage systems.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "The Tactical Control System shall be able to route VCR recorded payload video to the C4I Interfaces.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall provide an internal interface for establishing communications with the Real Time Processor (RTP) within Tactical Control System.",
      "The Tactical Control System shall have the capability to receive data from and control payloads on an AV that is being controlled from another Tactical Control System.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AMPS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JDISS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS."
    ]
  },
  {
    "text": "The Tactical Control System shall have an interface to an uninterruptible power supply.",
    "id": [
      1012,
      1011,
      948,
      1080,
      945,
      1045,
      981,
      1079,
      1072,
      1018
    ],
    "example": [
      "The Tactical Control System shall have the functionality to connect to the power supply equipment provided in the Tactical Control System operating environment.",
      "The Tactical Control System shall have an interface between the Tactical Control System and DoD standard power supply equipment.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate analog communication with peripheral devices.",
      "The Tactical Control System shall have an uninterrupted power supply for critical phases (landing and takeoff as a minimum) of mission execution.",
      "The Tactical Control System shall have the capability to establish and subsequently terminate digital communication with peripheral devices.",
      "The Tactical Control System shall be capable of restoring power in sufficient time to avoid loss of air vehicle control during power outages.",
      "The Tactical Control System shall provide the system functionality necessary to interface with the data terminal.",
      "The Tactical Control System shall be capable of restoring power in sufficient time to avoid loss of critical mission data and loss of air vehicle control during power outages.",
      "For each OUTRIDER system, the Tactical Control System shall provide full independent computer redundancy.",
      "The Tactical Control System shall support a concurrent uplink and downlink capability."
    ]
  },
  {
    "text": "The Tactical Control System shall provide sufficient cues to allow the operator to safely take-off, land and navigate under Instrument Flight Rules.",
    "id": [
      1040,
      862,
      821,
      852,
      822,
      845,
      856,
      1013,
      880,
      886
    ],
    "example": [
      "The Tactical Control System shall provide adequate capability to allow the operator to operate each UAV within its certified operational flight envelope.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "The Tactical Control System shall allow the operator to command the flight behavior characteristics inherent to the selected AV.",
      "The Tactical Control System shall provide the capability to create waypoints that define the desired flight path, define AV Altitude and Airspeed associated with the waypoint.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System shall have an interface to a source of current navigation information.",
      "The Tactical Control System shall permit the operator to control the payload using all methods supported by the payload installed in the selected AV.",
      "The Tactical Control System shall be capable of automatically selecting the proper mode of operation for the selected data terminal."
    ]
  },
  {
    "text": "For mission planning, the Tactical Control System shall provide terrain avoidance warning and minimum reception altitude calculations for line of sight flights.",
    "id": [
      812,
      813,
      822,
      808,
      865,
      815,
      845,
      797,
      786,
      784
    ],
    "example": [
      "The Tactical Control System flight route planner will provide terrain avoidance warnings for line-of-sight flights. ",
      "The Tactical Control System flight route planner will calculate the minimum data link reception altitude for line-of-sight flights.",
      "The Tactical Control System shall provide the capability to create waypoints that define the desired flight path, define AV Altitude and Airspeed associated with the waypoint.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "The Tactical Control System flight route planner will be able to designate flight corridors and restricted airspace.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from service specific mission planning systems."
    ]
  },
  {
    "text": "The Tactical Control System shall provide the required information to allow the operator to maintain safe separation from other aircraft and a safe altitude in civilian airspace per Federal Aviation Administration (FAA) rules.",
    "id": [
      856,
      845,
      1040,
      852,
      822,
      797,
      1145,
      847,
      898,
      815
    ],
    "example": [
      "The Tactical Control System shall provide the functionality to control, monitor, and display the operation of the Air Data ",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "The Tactical Control System shall provide adequate capability to allow the operator to operate each UAV within its certified operational flight envelope.",
      "The Tactical Control System shall allow the operator to command the flight behavior characteristics inherent to the selected AV.",
      "The Tactical Control System shall provide the capability to create waypoints that define the desired flight path, define AV Altitude and Airspeed associated with the waypoint.",
      "The Tactical Control System shall provide the capability to enter system configuration characteristics in the mission plan, to include selected AV type, AV identification number, selected payload type, ground control authorization information, and required communications pre-set for data links, tactical communications, and C4I data dissemination.",
      "The Tactical Control System shall have an objective capability to be integrated and operated from tactical and command and control aircraft.",
      "The Tactical Control System shall provide the capability to enter AV preset limits which, as a minimum, will include airspeed limits, altitude limits, and fuel limits.",
      "The Tactical Control System shall be capable of automatically controlling the transmitter and receiver frequencies of the selected data terminal.",
      "The Tactical Control System flight route planner will be able to designate flight corridors and restricted airspace."
    ]
  },
  {
    "text": "Additional local site procedures shall be developed to prevent the intentional or unintentional disclosure of sensitive information to unauthorized individuals.",
    "id": [
      533,
      649,
      90,
      57,
      392,
      652,
      971,
      1061,
      536,
      540
    ],
    "example": [
      "The CCTNS system should ensure high standards of security and access control through preventing cross-site scripting.",
      "The Correlator Monitor and Control System needs a robust security mechanism in place so that unauthorized users are not allowed access.",
      "When a security breach occurs and a contact sensor is set OPEN, the alarm system shall be activated.",
      "The system shall include security sound and light alarms, which can be activated when DigitalHome senses a security breach from a magnetic contact.",
      "The CCTNS system must allow the user to limit access to cases to specified users or user groups.",
      "This could be done via a username and associated password scheme that would authenticate and authorize the user access to the EVLA Correlator Monitor and Control System and, if applicable, grant the user access to restricted or controlled parts of the EVLA Correlator Monitor and Control System.",
      "The Tactical Control System shall restrict operator access to this capability via password protection.",
      "All hardware, software, documentation, and sensitive information processed by Tactical Control System shall be physically protected, minimally at the level determined by the risk index computed in to prevent intentional as well as unintentional disclosure, destruction, and modification.",
      "The CCTNS system should ensure high standards of security and access control through sanitizing the user-inputs.",
      "The CCTNS system should ensure high standards of security and access control through do not allow hard delete and perform only soft tagging the row for deletion."
    ]
  },
  {
    "text": "The Tactical Control System shall be capable of providing a 50% spare memory storage capacity over delivered storage used.",
    "id": [
      791,
      1082,
      1031,
      1070,
      1034,
      701,
      1010,
      1032,
      1074,
      958
    ],
    "example": [
      "The Tactical Control System shall be capable of storing a minimum of 500 mission plans under unique names to allow for later retrieval.",
      "As an objective a 75% spare memory storage capacity over storage used shall be provided.",
      "The Tactical Control System shall be able to access data storage devices.",
      "The Tactical Control System hardware shall allow for long range communications from one Tactical Control System to another [SSS375], data storage expansion [SSS376], access to other computers to share in processing capability [SSS377], and multiple external peripherals [SSS378].",
      "The Tactical Control System shall provide a tape drive for storage and retrieval of Tactical Control System data.",
      "The Tactical Control System hardware will permit long range communications from one to another, data storage expansion, access to other computers to share in processing capability, and multiple external peripherals.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from external data storage systems.",
      "The Tactical Control System shall have the functionality to transfer digital data as well as digital imagery to and from data storage devices.",
      "The Tactical Control System shall have sufficient throughput to support the processing requirements of the selected data link.",
      "The Tactical Control System shall have the capability to receive incoming annotated as well as un-annotated analog imagery."
    ]
  },
  {
    "text": "The Tactical Control System shall have software based on Defense Information Infrastructure/Common Operating Environment per Assistant Secretary of Defense for Command, Control, Communications, and Intelligence (ASD(C3I)) Joint Technical Architecture (JTA).",
    "id": [
      1084,
      987,
      988,
      989,
      997,
      998,
      999,
      1000,
      993,
      994
    ],
    "example": [
      "The Tactical Control System shall comply with the Assistant Secretary of Defense (C3I) Joint Technical Architecture (JTA).",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JMCIS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with JSIPS-N.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFATDS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with IAS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATHS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with ATWCS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with AFMSS.",
      "The Tactical Control System shall provide the necessary hardware and software functionality to allow the Tactical Control System to integrate with GCS/ACS IPF."
    ]
  },
  {
    "text": "auto-search and automatic target tracking), and future Tactical UAVs.",
    "id": [
      676,
      677,
      912,
      687,
      789,
      683,
      682,
      788,
      684,
      786
    ],
    "example": [
      "These UAVs shall include the Tactical Unmanned Aerial Vehicle (TUAV) and the Medium Altitude and Endurance (MAE) UAV (henceforth referred to as Outrider and Predator respectively), their associated payloads, and other network communication systems.",
      "Tactical Control System will also be capable of receiving and processing information from High Altitude and Endurance (HAE) UAVs, their associated payloads, future development UAVs and payloads.",
      "The Tactical Control System shall be capable of receiving secondary HAE UAV payload imagery.",
      "The Tactical Control System consists of the software, software-related hardware and the extra ground support hardware necessary for the control of the Outrider, and the Predator UAV, and future tactical UAVs.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to other Tactical Control Systems.",
      "The Tactical Control System will direct receipt of imagery and/or data from multiple UAV.",
      "The Tactical Control System will receipt and transmission of secondary imagery and/or data from multiple UAV.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from other Tactical Control Systems.",
      "The Tactical Control System will control of the UAV payload in addition to direct receipt of imagery/data for multiple UAV.",
      "The Tactical Control System shall have the functionality to transmit UAV mission plans to service specific mission planning systems."
    ]
  },
  {
    "text": "The controls shall allow the air vehicle and payload operators to perform mission control, mission monitoring, and mission updates and modifications while wearing cold weather clothing and in a Mission Oriented Protective Posture.",
    "id": [
      836,
      882,
      845,
      758,
      965,
      980,
      796,
      780,
      1042,
      764
    ],
    "example": [
      "The Tactical Control System will have the capability to control and monitor an AV, payload, data link, and C4I interfaces during the execution of a mission.",
      "Tactical Control System shall provide the capability to monitor payload adherence to the uplinked mission plan.",
      "The Tactical Control System shall provide the capability to control the flight of the selected AV in accordance with the specific ",
      "In the Normal Operations Mode the Tactical Control System shall support mission control and monitoring.",
      "Tactical Control System shall be capable of executing payload maintenance software and displaying appropriate status results.",
      "The Tactical Control System shall interface with external mission tasking systems (e.g., receive tasking orders, coordinate mission certification).",
      "The Tactical Control System shall allow the operator to enter as well as review mission plan parameters, including AV flight parameters, payload control parameters, data link control parameters, AV VCR control parameters (if applicable to the selected AV), and AV loiter patterns.",
      "The Tactical Control System will allow the operator to conduct payload product management. ",
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
      "In the Training Operations Mode the Tactical Control System shall support payload product Mmanagement."
    ]
  },
  {
    "text": "The Tactical Control System operator shall be required to enter an acknowledgment prior to disabling the display of critical warning flags for any AV, Payload, ADT, GDT, and Tactical Control System faults.",
    "id": [
      1102,
      1042,
      802,
      862,
      746,
      842,
      801,
      865,
      831,
      1142
    ],
    "example": [
      "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
      "During mission execution, the Tactical Control System shall provide the operator a cautions and warnings when the UAV system has identified a malfunction.",
      "The Tactical Control System shall provide the capability to override validation faults after the fault is acknowledged by the operator.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "The Tactical Control System shall inform the operator if the operator attempts to execute a function prohibited as a result of the determined level of interaction.",
      "Tactical Control System shall notify the operator when AV performance parameters are out of limits.",
      "The Tactical Control System shall notify the operator of all discrepancies found during the mission plan check as well as indicate successful completion of the mission plan check.",
      "Tactical Control System shall provide the capability to monitor AV adherence to the uplinked mission plan, detecting any deviations greater than 10% from projected flight path, and notifying the operator if deviations are detected.",
      "The Tactical Control System shall display an icon indicating Launch, Handover, and Recovery site (when applicable).",
      "For AV safety as well as mission-critical Warnings, the Tactical Control System HCI shall provide a default selection as well as an override option, along with a selection of adaptive responses, and the minimum information necessary to assist the operator in responding quickly and adaptively to the emergency."
    ]
  },
  {
    "text": "A combination of visual and auditory outputs will be provided to alert the Tactical Control System operator to situations which may require operator response.",
    "id": [
      1110,
      1024,
      862,
      1142,
      1102,
      781,
      1129,
      782,
      901,
      779
    ],
    "example": [
      "In addition to displayed alert messages to the Tactical Control System operator, auditory alerts to include tones shall also be provided.",
      "The Tactical Control System shall incorporate an intercom system that provides verbal communicate in the situation where there are multiple operators.",
      "As an objective, the Tactical Control System shall present sufficient cues to the operator to implement and monitor automatic launch and recovery, and to initiate abort procedures if required.",
      "For AV safety as well as mission-critical Warnings, the Tactical Control System HCI shall provide a default selection as well as an override option, along with a selection of adaptive responses, and the minimum information necessary to assist the operator in responding quickly and adaptively to the emergency.",
      "The Tactical Control System shall provide the operator a caution and warning diagnostic when the Tactical Control System system has identified a malfunction.",
      "The Tactical Control System will allow the operator to conduct targeting.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System will allow the operator to conduct C4I system interface.",
      "The Tactical Control System shall be capable of monitoring and displaying the signal strength of the received and transmitted signals for the selected data terminal.",
      "The Tactical Control System will allow the operator to conduct mission control and monitoring."
    ]
  },
  {
    "text": "The Tactical Control System shall provide access to the DII Style Manager so that pointing device characteristics can be modified.",
    "id": [
      1126,
      1129,
      1132,
      1127,
      808,
      821,
      792,
      784,
      833,
      696
    ],
    "example": [
      "The Tactical Control System shall provide for multi-level information display tailoring by the operator.",
      "The Tactical Control System shall provide the necessary processing, display, and control capabilities to ensure dynamic situational awareness input to the Tactical Control System operator.",
      "The Tactical Control System shall provide for a specific icon shape on a constant contrast background, as well as other visual information coding mechanisms, to cue the Tactical Control System operator regarding which UAVs are under his or her primary control.",
      "The Tactical Control System shall provide automated Tactical Control System system information, control options, and logical and simple operator guidance and support for immediate and adaptive responding to crisis situations.",
      "The Tactical Control System shall provide the capability to display mission waypoints and flight path graphically.",
      "The Tactical Control System shall provide the operator with an interactive graphics and map based flight route planning capability.",
      "The Tactical Control System mission planning function shall provide a graphical user interface that gives the operator the ability to define waypoints on a map based display using a pointing device with full keyset redundancy.",
      "The Tactical Control System shall have the functionality to receive and process UAV mission plans from service specific mission planning systems.",
      "The Tactical Control System shall provide the capability to graphically display Line of Sight versus terrain profile (DTED).",
      "The Tactical Control System will provide software portability, scaleable functionality, and support for operational configurations tailored to the users’ needs."
    ]
  },
  {
    "text": "The Tactical Control System HCI shall provide for the capability to automatically designate target locations from the payload screen onto the map screen.",
    "id": [
      1133,
      1138,
      1137,
      927,
      835,
      925,
      926,
      929,
      1136,
      793
    ],
    "example": [
      "The Tactical Control System HCI shall provide the capability to select and amplify an object and point on a map as well as payload screen.",
      "The Tactical Control System HCI shall provide the capability to display operator definable “Lock Out” zones around waypoints, Launch and Recovery Point (LRP), as well as any selected point on the AV flight path.",
      "The Tactical Control System HCI shall provide the capability to lock onto and hold a coordinate point on the payload imagery window.",
      "The Tactical Control System will have the functionality to determine target coordinates, and estimate target coordinate accuracy.",
      "The Tactical Control System shall provide the capability to display the payload swath for the selected payload for planning purposes.",
      "The Tactical Control System shall have the capability to display Near-Real Time (NRT) imagery to include, as a minimum, date/time group, target location coordinates when the target is in the center of the field of view, north seeking arrow, and AV position and heading.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions located on the payload imagery display.",
      "The Tactical Control System shall have the functionality to determine the location of items of interest within the payload field of view, and express these locations in coordinates acceptable for military applications.",
      "[SSS479] The Tactical Control System HCI shall provide the on-screen capability to select and efficiently move as well as reorient a previously defined SAR imaging swath.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions on the map display."
    ]
  },
  {
    "text": "Any data that is passed into the “cloud” in the above figure will be based on the ITS standards.",
    "id": [
      1205,
      137,
      538,
      1157,
      237,
      537,
      539,
      103,
      152,
      572
    ],
    "example": [
      "The Data Collector shall be designed to support the storage of TMDD data elements and message set information.",
      "The APAF system shall process the engineering and ancillary information necessary for calibration and science validation into IDFS data sets.",
      "The CCTNS system should ensure high standards of security and access control through encoding the incoming data or user request.",
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "The user's score must be kept as local data within the Space Fractions system so that the results may be given at the end of the Space Fractions system.",
      "The CCTNS system should ensure high standards of security and access control through validating the incoming data or user request.",
      "The CCTNS system should ensure high standards of security and access control through validating the data both at the client and server.",
      "Sensor (temperature, humidity, contact sensor, power state) shall have a minimum data acquisition rate of 10 Hz.",
      "The requirement associated with the privacy of the APAF ground data system is in the table below.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network."
    ]
  },
  {
    "text": "The Center shall support the information about each incident, including network identifier, incident description and roadway.",
    "id": [
      1173,
      1170,
      1194,
      1186,
      1196,
      1171,
      1203,
      1188,
      1174,
      1176
    ],
    "example": [
      "The Center shall support the information about each lane closure, including network identifier, lane closure id, closure description.",
      "For each roadway network it maintains, the Center shall provide the network name and link data information.",
      "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the following status information about each Dynamic Lane, including network identifier, link identifier, dynamic lane identifier, dynamic lane name and failure state.",
      "The Center shall provide the link information, including link identifier, link name and link type.",
      "The Center shall support the following status information about each Vehicle Priority, including vehicle identifier, network identifier, link identifier and intersection identifier.",
      "The Center shall support the following status information about each ESS, including network identifier, environmental sensor identifier, environment sensor name, type, location and status.",
      "The Center shall provide the following status information about each DMS, including network identifier, DMS identifier, DMS name.",
      "The Center shall support the following status information about each LCS, including network identifier, LCS identifier, LCS name, Location and Status."
    ]
  },
  {
    "text": "The Center shall support the following status information about each Parking Lot, including network identifier, parking lot identifier, parking lot name, location and status.",
    "id": [
      1202,
      1203,
      1176,
      1201,
      1186,
      1182,
      1198,
      1191,
      1200,
      1199
    ],
    "example": [
      "The Center shall support the following status information about each Park and Ride Lot, including network identifier, park and ride lot identifier, park and ride lot name, location, status and capacity.",
      "The Center shall support the following status information about each Vehicle Priority, including vehicle identifier, network identifier, link identifier and intersection identifier.",
      "The Center shall support the following status information about each LCS, including network identifier, LCS identifier, LCS name, Location and Status.",
      "The Center shall support the following status information about each Light/Commuter Location, including network identifier, link identifier, commuter or light rail identifier, commuter or light rail name, location and schedule adherence.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the status information about each ramp meter, including network identifier, Ramp Meter identifier, Ramp Meter name, Location and Status.",
      "The Center shall support the following status information about each Bus Stop, including network identifier, link identifier, relative link location, name and location.",
      "The Center shall support the following status information about each School Zone, including network identifier, link identifier, school zone identifier and school zone name.",
      "The Center shall support the following status information about each Light/Commuter Stop, including network identifier, link identifier, commuter or light rail stop identifier, commuter or light rail stop name, location and routes.",
      "The Center shall support the following status information about each Bus Location, including network identifier, link identifier, bus identifier, bus name, location and schedule adherece."
    ]
  },
  {
    "text": "The Center shall support the following information about network device status, including network identifier, number of DMSs, number of LCSs, DMS status data, LCS status data and CCTV status data.",
    "id": [
      1174,
      1176,
      1178,
      1180,
      1188,
      1186,
      1194,
      1177,
      1196,
      1184
    ],
    "example": [
      "The Center shall provide the following status information about each DMS, including network identifier, DMS identifier, DMS name.",
      "The Center shall support the following status information about each LCS, including network identifier, LCS identifier, LCS name, Location and Status.",
      "The Center shall provide the information status information about each CCTV, including network identifier, CCTV identifier, CCTV name, Location and Status.",
      "To support video snapshots, the Center shall be able to support the status information, including network identifier, CCTV identifier, CCTV name and status.",
      "The Center shall support the following status information about each ESS, including network identifier, environmental sensor identifier, environment sensor name, type, location and status.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status.",
      "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
      "To support LCS control in other centers, the Center shall be able to support the following device control command for a LCS, including network identifier, LCS identifier, username and Password.",
      "The Center shall support the following status information about each Dynamic Lane, including network identifier, link identifier, dynamic lane identifier, dynamic lane name and failure state.",
      "The Center shall support the following status information about each HAR, including network identifier, HAR identifier, HAR name, location and status."
    ]
  },
  {
    "text": "The device status requestor and Center shall support the following information for command timeframe request, including network identifier and device type.",
    "id": [
      1204,
      1229,
      1187,
      1175,
      1195,
      1185,
      1177,
      1197,
      1240,
      1186
    ],
    "example": [
      "The device status requestor and Center shall support the following information for command timeframe request, including network identifier, device type, days commands accepted and times commands accepted.",
      "The user shall be provided with the capability to select a network identifier for a device command/control request.",
      "To support Traffic Signal control in other centers, the Center shall be able to support the following device control command for a Traffic Signal, including network identifier, traffic signal identifier, username, password and traffic signal plan identifier.",
      "To support DMS control in other centers, the Center shall be able to support the following device control command for a DMS, including network identifier, DMS identifier, username and Password.",
      "To support Reversible Lane control in other centers, the Center shall be able to support the following device control command for a Reversible Lane, including network identifier, reversible lane identifier, username, password, plan and duration.",
      "To support HAR control in other centers, the Center shall be able to support the following device control command for a HAR, including network identifier, HAR identifier, username, password and message.",
      "To support LCS control in other centers, the Center shall be able to support the following device control command for a LCS, including network identifier, LCS identifier, username and Password.",
      "To support Dynamic Lane control in other centers, the Center shall be able to support the following device control command for a Dynamic Lane, including network identifier, dynamic lane identifier, username, password and lane plan.",
      "For each device command/control status request sent by the Remote GUI, the status returned from the network identifier will be displayed in a scrollable list on the GUI.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status."
    ]
  },
  {
    "text": "TCP/IP shall be used to transmit the DATEX/ASN data.",
    "id": [
      1207,
      606,
      1157,
      913,
      1206,
      47,
      572,
      160,
      138,
      1204
    ],
    "example": [
      "DATEX/ASN shall be used to transmit the TMDD message sets.",
      "This identifier will be used to form a unique IP address for CMIB network addressing and allow carry over IP addressing for hot swap modules.",
      "The data from these interfaces will communicate with the existing system in a “system specific” format.",
      "Payload telemetry data shall be available to support other Tactical Control System functions as required.",
      "The Center-to-Center Project shall utilize the TMDD standard (including message sets) to transmit information.",
      "The DigitalHome Gateway device shall provide communication with all the DigitalHome devices and shall connect with a broadband Internet connection.",
      "Specific data sets required by the Backend Data Processing System will be provided in a timely and robust fashion over a secondary virtual network.",
      "There shall be a network connection between SwRI and NISN for data transfers and distribution.",
      "The ASPERA-3 and MEX OA telemetry data shall be stored on a local SwRI archive for data availability and re-processing.",
      "The device status requestor and Center shall support the following information for command timeframe request, including network identifier, device type, days commands accepted and times commands accepted."
    ]
  },
  {
    "text": "The map shall display interstates and state highways on the graphical map.",
    "id": [
      1212,
      1209,
      1216,
      1217,
      1097,
      1214,
      1211,
      827,
      793,
      1125
    ],
    "example": [
      "Each link displayed on the map shall be color coded to provide a graphical depiction of speeds.",
      "The map provides a graphical depiction of the traffic conditions.",
      "The map shall be capable of displaying the following for a DMS.",
      "The map shall be capable of displaying the following for a LCS.",
      "Each control console shall have a display windows that provides the aircraft position, Tactical Control System position, flight path, and waypoint graphics in the foreground, which are positioned in relation to a map displayed in the background.",
      "The map shall display the current incidents (as icons) known to the Center-to-Center Project.",
      "The map user shall be able to pan the map in each of the following directions: North, South, East or West.",
      "The Tactical Control System shall have the capability to load a map onto the display, to zoom in and out, to scroll, to print, and to clear a map on the map display.",
      "The Tactical Control System shall provide the capability to compute the range and bearing between two geographic positions on the map display.",
      "The Tactical Control System shall use graphical representations to convey information, such as system status, C4I links, and AV-GDT links."
    ]
  },
  {
    "text": "The basemap data shall be derived from the North Central Texas Council of Governments (NCTCOG) GeoData warehouse.",
    "id": [
      139,
      1170,
      171,
      910,
      1188,
      1172,
      1202,
      138,
      121,
      1205
    ],
    "example": [
      "The ASPERA-3 and MEX OA IDFS data sets shall be stored on a local SwRI archive for data availability and analysis.",
      "For each roadway network it maintains, the Center shall provide the network name and link data information.",
      "ASPERA-3 IDFS data and MEX OA IDFS data shall be provided to NASA PDS.",
      "The NITF 2.0 imagery files generated by the Tactical Control System shall contain the necessary telemetry and support data to permit subsequent imagery exploitation by C4I systems.",
      "The Center shall support the following status information about each ESS, including network identifier, environmental sensor identifier, environment sensor name, type, location and status.",
      "The Center shall provide the node information, including node identifier, node name and node type description.",
      "The Center shall support the following status information about each Park and Ride Lot, including network identifier, park and ride lot identifier, park and ride lot name, location, status and capacity.",
      "The ASPERA-3 and MEX OA telemetry data shall be stored on a local SwRI archive for data availability and re-processing.",
      "These data products will be put into a form known as the Instrument Data File Set (IDFS).",
      "The Data Collector shall be designed to support the storage of TMDD data elements and message set information."
    ]
  },
  {
    "text": "All current incidents shall be displayed in tabular format with the following information contained in the table.",
    "id": [
      1214,
      1222,
      1220,
      1112,
      1215,
      162,
      1221,
      1196,
      1194,
      1186
    ],
    "example": [
      "The map shall display the current incidents (as icons) known to the Center-to-Center Project.",
      "The GUI shall provide a list of previously entered incidents.",
      "The Incident GUI shall allow the user to input the following information for each incident.",
      "All Tactical Control System warning messages and HCI actions shall be archived for later review.",
      "The user shall be able to click on an incident icon to obtain further information about the incident.",
      "The logistics-related requirements of the APAF ground data system are itemized in the following table.",
      "The Incident GUI shall allow the user to input the following information for each lane closure.",
      "The Center shall support the following status information about each Dynamic Lane, including network identifier, link identifier, dynamic lane identifier, dynamic lane name and failure state.",
      "The Center shall support the following status information about each Reversible Lane, including network identifier, reversible lane identifier, reversible lane name, link identifier, indicator status and indicator failure state.",
      "The Center shall support the following status information about each Traffic Signal, including network identifier,traffic signal identifier, traffic signal name,location and status."
    ]
  },
  {
    "text": "The GUI shall allow a user to delete a previously entered incident.",
    "id": [
      1225,
      1226,
      1219,
      663,
      1223,
      1220,
      371,
      1221,
      1222,
      1215
    ],
    "example": [
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "The GUI shall allow a user to delete a previously entered lane closure.",
      "The Incident GUI shall allow the user to enter incident or lane closure information without the use of an Center.",
      "The administrator shall have the ability to remove a user from the EVLA Correlator Monitor and Control System.",
      "The GUI shall allow the data about an incident to be modified.",
      "The Incident GUI shall allow the user to input the following information for each incident.",
      "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
      "The Incident GUI shall allow the user to input the following information for each lane closure.",
      "The GUI shall provide a list of previously entered incidents.",
      "The user shall be able to click on an incident icon to obtain further information about the incident."
    ]
  },
  {
    "text": "Once an Center is selected, the user shall be able to select a School Zone from a list and provide the following information, including Target School Zone and Plan.",
    "id": [
      1238,
      1239,
      1236,
      1234,
      1191,
      1192,
      1231,
      1230,
      1235,
      1237
    ],
    "example": [
      "Once an Center is selected, the user shall be able to select a Reversible Lane from a list and provide the following information, including Target Reversible Lane and Plan.",
      "Once an Center is selected, the user shall be able to select a Dynamic Lane from a list and provide the following information, including Target Dynamic Lane and Plan.",
      "Once an Center is selected, the user shall be able to select a Traffic Signal from a list and provide the following information, including Target Traffic Signal and Plan.",
      "Once an Center is selected, the user shall be able to select a Ramp Meter from a list and provide the following information, including Target Ramp Meter and Plan.",
      "The Center shall support the following status information about each School Zone, including network identifier, link identifier, school zone identifier and school zone name.",
      "To support School Zone control in other centers, the Center shall be able to support the following device control command for a School Zone, including network identifier, school zone identifier, username, password and plan.",
      "Once an Center is selected, the user shall be able to select a LCS from a list and provide the following information, including Target LCS and Assignment of lane arrows.",
      "Once an Center is selected, the user shall be able to select a DMS from a list and provide the following information, including Target DMS, Message to be displayed and Beacons On/Off.",
      "Once an Center is selected, the user shall be able to select a HAR from a list and provide the following information, including Target HAR and Text to be sent to the HAR.",
      "Once an Center is selected, the user shall be able to select a HOV from a list and provide the following information, including Target HOV and Plan."
    ]
  },
  {
    "text": "The Center-to-Center shall be implemented in the C/C++ programming language.",
    "id": [
      1245,
      509,
      1153,
      1247,
      1166,
      1167,
      1227,
      563,
      1246,
      1244
    ],
    "example": [
      "The Center-to-Center web interface shall be implemented using C/C++ and ESRI ARC IMS.",
      "The 3 C’s (Core-Configuration-Customization) forms the guiding principle for the architecture.",
      "The Center-to-Center project will be implemented using the evolving ITS Traffic Management Data Dictionary (TMDD) standard, the message sets associated with TMDD, other ITS Data Elements and Message Sets.",
      "The Remote Control GUI shall be implemented using C/C++ and ESRI Map Objects.",
      "The Center-to-Center project mnemonic uniquely identifies the Center-to-Center project to distinguish its requirements from the requirements of other ITS systems.",
      "The mnemonic for the Center-to-Center project is Center-to-Center.",
      "The remote Center Control GUI shall be designed to execute on a public network (e.g., Internet) and transmit equipment requests to the C-2-C software system.",
      "The Correlator Monitor and Control System will provide a level of abstraction to modularize the correlator system within the VLA Expansion Project environment.",
      "The Incident GUI shall be implemented using C/C++ and ESRI Map Objects.",
      "The Center-to-Center shall execute in a Microsoft Windows NT environment."
    ]
  }
]